{
	"Authors": "Ajahn Brahm",
	"BookTitle": "Journey to the Heart of the Lotus",
	"BookSubtitle": "Unlearning “Buddhist” Meditation",
	"ShortAbstract": "<p>Reflecting Ajahn Brahm’s unique way of teaching, the image of the lotus gradually unfolding is used as he shows us, chapter by chapter, how we too can discover the joy and happiness of meditation as taught by the Buddha.</p>",
	"Abstract": "<p>Not written yet.</p>",
	"AddInfo": [],
	"Copyright": [
		"This first edition published in 2024 by Wisdom &amp; Wonders Books.",
		"The author Ajahn Brahm has waived all copyright and related or neighbouring rights to Journey to the Heart of the Lotus and dedicates it to the public domain.",
		"TV Sunrise cartoon: Image courtesy of Michael Leunig",
		"Three Questions: Taken from the collection <em>‘What Men Live By, and Other Tales’</em> by Leo Tolstoy, as translated by Louise Maude and Aylmer Maude. This work is in the public domain.",
		"Find more information on Ajahn Brahm at <a href='https://bswa.org/'><span data-custom-style='Hyperlink'>bswa.org</a>",
		"Watch a video about the monastery where Ajahn Brahm resides at <span data-custom-style='Hyperlink'><a href='https://youtu.be/GOL5RTd-WDk'>youtu.be/GOL5RTd-Wdk</a>",
		"This is book is offered for free. Please do not sell this book.",
		"Also available to read online and for free download from <span data-custom-style='Hyperlink'><a href='https://wiswo.org/books/journey'>wiswo.org/books/journey</a>"
	],
	"CCLicense": "<div class='cclicense'><h3>CC0 1.0 Universal <span>(CC0 1.0) Public Domain Dedication</span></h3><div id = 'ccDetail'><p><strong>No Copyright</strong></p><ul>    <li>The person who associated a work with this deed has <em>dedicated</em> the work to the public domain by waiving all of his or her rights to the work worldwide under copyright law, including all related and neighboring rights, to the extent allowed by law.</li>    <li>You can copy, modify, distribute and perform the work, even for commercial purposes, all without asking permission. See Other Information below.</li></ul><p><strong>Other Information</strong></p><ul><li>In no way are the patent or trademark rights of any person affected by CC0, nor are the rights that other persons may have in the work or in how the work is used, such as publicity or privacy rights.</li><li>Unless expressly stated otherwise, the person who associated a work with this deed makes no warranties about the work, and disclaims liability for all uses of the work, to the fullest extent permitted by applicable law.</li><li>When using or citing the work, you should not imply endorsement by the author or the affirmer.</li></ul></div></div>",
	"FrontCover": "../_resources/book-data/journey/FrontLarge.jpg",
	"BackCover": "../_resources/book-data/journey/BackLarge.jpg",
	"BackMatter": [
		"<p>Discover the magic of kindfulness with Journey to the Heart of the Lotus, a guide to peace and insight based on the teachings of Ajahn Brahm on his 2023 Easter retreat at Jhana Grove.</p><p>Each chapter will take you deeper into the art of letting go, calming the mind and embracing the present moment.</p><p>Whether you're a seasoned meditator or just beginning your practice, a path to the radiant joy of stillness and true serenity awaits you within these pages.</p>"
	],
	"DownloadsAvailable": "pdf=yes,epub=yes,azw3=yes",
	"DownloadHTML": "",
	"AuthorsData": [
		{
			"ShortName": "Ajahn Brahm",
			"InfoImage": "../_resources/author-data/brahm/info.jpg",
			"ShortBio": [
				"Ajahn Brahmavamso Mahathera was born in London in 1951. ",
				"After graduating from Cambridge he taught in a school for one year before travelling to Thailand to train with Ajahn Chah. ",
				"After practising for nine years as a monk in Thailand, he was sent to Perth, Australia by Ajahn Chah in 1983. ",
				"He is Abbot of Bodhinyana monastery, Spiritual Director of the BSWA and a number of other Buddhist Societies and projects world-wide."
			]
		}
	]
}