{
    "Document" : "<span class='extlink'><a alt='SuttaCentral Guide' href = 'https://suttacentral.net/sn-guide-sujato'><img class='icon' src='../_resources/images/icons/sc-icon.png'>SuttaCentral Guides</a></span>",
    "Author" : "Bhikkhu Sujato",
    "Section" : "The Linked Discourses: ",
    "SubSection" : "the blueprint for Buddhist philosophy",
    "Title" : "5. The Book of the Six Sense Fields",
    "Quote" : "<h2 id='item5'>The Book of the Six Sense Fields</h2><p>The “Book of the Six Sense Fields” is the fourth of the five books of the Linked Discourses. It is named after the first and longest <em lang='pi' translate='no'>saṁyutta</em>. The second <em lang='pi' translate='no'>saṁyutta</em> on Feelings also deals with a major doctrinal topic, one that is closely related to the main theme. The remaining eight <em lang='pi' translate='no'>saṁyuttas</em> deal with secondary themes organized by subject or by person.</p><p>The number of discourses in the “Linked Discourses on the Six Sense Fields” varies between editions, mainly due to the way repetitions are counted; SuttaCentral follows Bhikkhu Bodhi’s translation in counting 248 discourses; see his introduction to this chapter for a discussion of the problems in counting the Suttas of this collection. They are collected in four <em lang='pi' translate='no'>paṇṇasakas</em>.</p><p>This <em lang='pi' translate='no'>saṁyutta</em> has an especially close relationship with the “Linked Discourses on the Aggregates”, one that goes far beyond the apparent thematic similarities. In fact, many of the discourses in the two collections are constructed on virtually identical lines. Bhikkhu Bodhi explores these connections with his notion of “template parallels”, which are found throughout the Saṁyutta Nikāya, but especially with these two sections.</p><p>The six sense fields complement the five aggregates as the summary of the noble truth of suffering. Where the aggregates focus on the functional structure of experience as basis for views of self, the emphasis here is on how sense experience stimulates desire.</p><p>The six sense fields are the means through which the world is known, and so each of them has two aspects. The “inner” aspect is the sense organs, for example the “eye” or the “ear”, which make it possible for an organism to experience the outside world by receiving sense stimuli. These are paired with the external sense stimuli, such as “sights” or “sounds”, which impact the sense organ (contact, <em lang='pi' translate='no'>phassa</em>) and give rise to the appropriate form of consciousness.</p><p>It’s best to avoid thinking of the external sense fields as “objects”, since in the suttas they are depicted in relation to the observing mind, and not as independently existing entities. There is no word for “object” in this sense in the early texts: existence is not objective, it is relational. The term <em lang='pi' translate='no'>ārammaṇa</em>, which came to be used in this sense much later in the Abhidhamma, means “support” in the suttas.</p><p>The operation of the senses is relatively straightforward until we come to the last sense, the “mind” and “thoughts” or “mental phenomena”. To clear up a possible confusion, this “sixth sense” is simply the mental faculty and has nothing to do with psychic powers. And unlike the five external senses, the “inner” sense field is not a physical organ: <em lang='pi' translate='no'>mano</em> does not mean “brain”.</p><p>The exact meaning of “mind” (<em lang='pi' translate='no'>mano</em>) in this context is not spelled out in detail, so let us consider this first. The suttas use three main terms for the mind: <em lang='pi' translate='no'>mano</em>, <em lang='pi' translate='no'>citta</em>, and <em lang='pi' translate='no'>viññāṇa</em>. In general these are synonyms and it is not possible to draw hard and fast distinctions between them (<a  class='extlink tipref' href='https://suttacentral.net/an3.60'>AN 3.60</a>, <a  class='extlink tipref' href='https://suttacentral.net/dn1#2'>DN 1:2</a>, <a  class='extlink tipref' href='https://suttacentral.net/sn12.61'>SN 12.61</a>). Nevertheless, they tend to be used in different contexts, each with a distinct nuance. These contexts can be understood in terms of the four noble truths; thus the different terms refer to the same thing, but imply a different aspect or response to that thing.</p><dl><dt><em lang='pi' translate='no'>Viññāṇa</em></dt><dd>In doctrinal contexts this is awareness itself, the sheer knowing of things. It appears in this sense in dependent origination, the aggregates, and the sense fields. Hence it pertains to the first noble truth, the suffering of the world, and it needs to be fully understood. In colloquial usage, however, it can take on a variety of shades of meaning, such as “understanding”.</dd><dt><em lang='pi' translate='no'>Mano</em></dt><dd>The mind in action, one of the three spheres of <em lang='pi' translate='no'>kamma</em>, a sense it inherits from the Upaniṣads. It is that which creates results, as in the famous first line of the Dhammapada: <em lang='pi' translate='no'>mano pubbaṅgamā dhammā</em>, “mind is the forerunner of all things”. It is particularly used in ethical contexts, the performance of mental acts that bear fruit of either good or bad. So it may be understood as primarily relating to the second and third noble truths, the origination and ending of suffering.</dd><dt><em lang='pi' translate='no'>Citta</em></dt><dd>The most general, and the least tightly bound to a particular technical sense. It is used widely as “mind”, “thought”, “heart”, etc. But when found in technical contexts it refers to <em lang='pi' translate='no'>samādhi</em>, to the purified awareness of deep meditative immersion. For this reason it is specially used in contexts relating to the path, the fourth noble truth.</dd></dl><p>In the six senses, <em lang='pi' translate='no'>mano</em> is clearly not identical with the “knowing” (<em lang='pi' translate='no'>viññāṇa</em>), as it gives rise to it. Nor is it the “known”, the phenomena of which the mind is aware, for that is <em lang='pi' translate='no'>dhammā</em>. Nor is it the turning towards or paying attention to the thing known, as is revealed in <a  class='extlink tipref' href='https://suttacentral.net/mn28'>MN 28</a> <cite class='text-translated'>The Longer Simile of the Elephant’s Footprint</cite> (<cite class='text-root'>Mahāhatthipadopamasutta</cite>):</p><blockquote><p>Though the mind is intact internally, so long as exterior thoughts don’t come into range and there’s no corresponding attention, there’s no manifestation of the corresponding type of consciousness.</p></blockquote><p>This passage suggests that, like the physical sense organs, <em lang='pi' translate='no'>mano</em> in some way pre-exists the actual moment of conscious awareness. This does not mean that it is some mystical substrata of consciousness, for as we have seen <em lang='pi' translate='no'>mano</em> is consistently used in the sense of the mind that performs acts, especially those with a moral dimension. So the <em lang='pi' translate='no'>mano</em> is that which has performed deeds in the past, fueling an ongoing mental continuum within which the results of those deeds may be experienced in the present. It is the mental faculty that bears the potential for conscious experience, created and conditioned by choices made in the past.</p><p>The “outer” aspect of the sixth sense is <em lang='pi' translate='no'>dhammā</em>, a term so ambiguous its translation is always difficult. Here it refers to anything that may be known directly by the mind, distinct from the five physical senses. The most technically correct translation is probably “mental phenomena”. However, this is clumsy and opaque, so “thought” may be used as a more colloquial rendering, so long as it is understood to include ideas, imagination, and so on, not just verbalized cognition.</p><p>The term <em lang='pi' translate='no'>āyatana</em> refers to something “stretched out”, a domain, field, or dimension of activity. However, the Visuddhimagga suggests that the sense of the word is primarily a “cause”, or perhaps “stimulus”:</p><blockquote><p>… base (<em lang='pi' translate='no'>āyatana</em>) should be understood as such (a) because of its actuating (<em lang='pi' translate='no'>āyatana</em>), (b) because of being the range (<em lang='pi' translate='no'>tanana</em>) of the origins (<em lang='pi' translate='no'>āya</em>), and (c) because of leading on (<em lang='pi' translate='no'>nayana</em>) what is actuated (<em lang='pi' translate='no'>āyata</em>). <cite class='text-translated'>Path of Purification</cite>, XV.4, translated by Bhikkhu Ñāṇamoḷi.</p></blockquote><p>Bhikkhu Ñāṇamoḷi rendered the term accordingly as “base”, which has been followed by Bhikkhu Bodhi. But this commentarial explanation is merely a series of false etymologies, or rather, puns. The point of such explanations is to provide material for teachers to reflect on and use in teaching, and they shouldn’t be taken uncritically. In fact the verbal root is not the obscure <em lang='pi' translate='no'>āyatati</em> (“to actuate”) but <em lang='pi' translate='no'>āyamati</em>, “to stretch, to extend”. <em lang='pi' translate='no'>Āyatana</em> is commonly used in this sense, and may be translated “field”, “dimension”, etc.</p><p>As so often, the context draws upon and redefines brahmanical terminology. The “six sense fields” (<em lang='pi' translate='no'>saḷāyatana</em>) were first mentioned in the Buddha’s third teaching, the famous Fire Discourse (Ādittapariyāya Sutta) which appears in this collection at <a  class='extlink tipref' href='https://suttacentral.net/sn35.28'>SN 35.28</a>. This sermon was given to a large assembly of brahmanical ascetics, following a period when the Buddha stayed in their “fire house”, a kind of shrine room for worshiping the sacred flame. And in Sanskrit, this place is called an <em lang='pi' translate='no'>āyatana</em>. The Upaniṣads also call the senses <em lang='pi' translate='no'>āyatana</em> in the sense of fields or scopes of activity and experience (eg. Bṛhadāraṇyaka Upaniṣad 4.1.4: <em lang='pi' translate='no'>cakṣur evāyatanam</em>, Bṛhadāraṇyaka Upaniṣad 6.1.5: <em lang='pi' translate='no'>mano vā āyatanam</em>; Chāndogya Upaniṣad 5.1.5: <em lang='pi' translate='no'>mano ha vā āyatanam</em>).</p><p>When the Buddha told those ascetics that “all is burning”, he was not giving an Abhidhamma analysis, for it was many centuries before Abhidhamma was developed. He was speaking in terms that the brahmins could understand.</p><p>One of the key projects of the brahmanical Upaniṣads was to reinterpret the deities of the Vedas. Rather than thinking of them as entities who lived in the sky, they became forces or essences that imbued all of reality. So for the brahmin ascetics, the flame (<em lang='pi' translate='no'>agni</em>) was worshiped as the embodiment of a sacred energy that was imminent in all things.</p><p>The teachings of the Fire Sermon respond to several key Upaniṣadic passages. In Bṛhadāraṇyaka Upaniṣad 1.3, it is told how evil entered into the world by the actions of the demons (<em lang='pi' translate='no'>asuras</em>). While the gods (<em lang='pi' translate='no'>devas</em>) were performing the ritual, they entered into the various senses and corrupted them, tainting them with evil and death. Hence when suffering is experienced through the senses, this is the reason. But those same senses can be freed from this corruption by being carried beyond death.</p><p>These purified, divine senses are further described at Bṛhadāraṇyaka Upaniṣad 2.5.1, the famous “Honey-Knowledge”, regarded as one of the highest and most secret teachings. It presents a template, applied to various different kinds of things. These are not organized so rationally as the Buddhist doctrines, but include quite different kinds of things in the same set, such as the elements, truth, the sun, etc. Nevertheless, the parallels with the teachings of the six senses are quite apparent.</p><blockquote><p><em lang='pi' translate='no'>ayam ādityaḥ sarveṣāṁ bhūtānāṁ madhu</em><br />This sun is the honey of all beings.<br /><em lang='pi' translate='no'>asyādityasya sarvāṇi bhūtāni madhu</em><br />All beings are the honey of the sun.<br /><em lang='pi' translate='no'>yaś cāyam asminn āditye tejomayo ’mṛtamayaḥ puruṣo yaś cāyam adhyātmaṁ cākṣuṣas tejomayo ’mṛtamayaḥ puruṣo ’yam eva sa yo ’yam ātmā</em><br />This person in the sun made of fire and immortality, and this person in the internal eye made of fire and immortality: this is that—that which is the self.<br /><em lang='pi' translate='no'>idam amṛtam idaṁ brahmedaṁ sarvam</em><br />This is the immortal, this is the divine, this is the all.<br />(Bṛhadāraṇyaka Upaniṣad 2.5.5, translation by myself.)</p></blockquote><p>The Brahmanical view is that all creation stems from Brahmā and hence is, in its truest essence, overflowing with divinity and bliss—honey. Any suffering is merely a temporary imperfection.</p><p>This is how they handled the great challenge to any theistic system, the problem of evil. For the brahmins, to focus on suffering is to miss the point. This is not merely a facile “positive thinking” doctrine, it is a profoundly contemplative philosophy, worked out in great detail across many complex sacred texts, and informed by deep meditative practice. It does not deny the reality of suffering, but it evokes a deeper reality where suffering cannot reach.</p><p>Rather than tackling the textual and philosophical issues, the Buddha preferred to point directly at experience. Divested of theology, the experience of our senses is not “honey” but “fire”. And while our philosophy may say that fire is sacred, the reality is that it burns. The Buddha was showing the ascetics that there is no need to invoke deities and metaphysics in order to understand their experience: they could see how it worked right here.</p><p>The forces lighting that fire can be readily discerned: greed, hate, and delusion. This classic Buddhist presentation of the fundamental defilements appears first in this passage. It is correlated with the three feelings: pleasant feeling stimulates desire; painful feeling provokes hate; and neutral feeling slips into delusion (<a  class='extlink tipref' href='https://suttacentral.net/mn44#25'>MN 44:25</a>, <a  class='extlink tipref' href='https://suttacentral.net/mn128#28'>MN 128:28</a>, <a  class='extlink tipref' href='https://suttacentral.net/sn36.3'>SN 36.3</a>).</p><p>The Fire Sermon, in its brevity, foreshadows several distinctive features of the teachings on the six senses as compared to the five aggregates. It is direct, emotional and powerful, speaking of the world that is burning, in contrast with the more intellectual approach of the aggregates.</p><p>By invoking the idea of the “all”, the Fire Sermon suggests that the scope of the six senses includes all that is experienced and known. This idea was expanded in multiple Suttas (<a  class='extlink tipref' href='https://suttacentral.net/sn35.33'>SN 35.33–52</a>). By contrast, no such claim to completeness is made of the aggregates. And the text treats sense experience as a conditioned process, the immediately visible dimension of dependent origination.</p><p>Since the sense fields make experience possible, it is through them that suffering comes to be (<a  class='extlink tipref' href='https://suttacentral.net/sn35.106'>SN 35.106</a>). It is in order to understand this suffering that one undertakes the spiritual path (<a  class='extlink tipref' href='https://suttacentral.net/sn35.81'>SN 35.81</a>, <a  class='extlink tipref' href='https://suttacentral.net/sn35.152'>SN 35.152</a>). The sense fields are, in fact, the world (<em lang='pi' translate='no'>loka</em>) that wears away (<em lang='pi' translate='no'>lujjati</em>; <a  class='extlink tipref' href='https://suttacentral.net/sn35.82'>SN 35.82</a>, <a  class='extlink tipref' href='https://suttacentral.net/sn35.84'>SN 35.84</a>), for “whatever in the world through which you perceive the world and conceive the world is called the world in the training of the noble one” (<a  class='extlink tipref' href='https://suttacentral.net/sn35.116'>SN 35.116</a>). This world is empty of self (<a  class='extlink tipref' href='https://suttacentral.net/sn35.85'>SN 35.85</a>).</p><p>Since the sense fields are produced by choices made in past lives, they are said to be “old kamma”; in this they contrast with the aggregates, for they include “choices”, which are the kamma made in the present. Having inherited the senses as the result of past deeds, however, we proceed to respond to them through thinking or conceiving of them in terms of a “self”, a process known in Pali as “identifying” (<em lang='pi' translate='no'>maññita</em>; <a  class='extlink tipref' href='https://suttacentral.net/sn35.146'>SN 35.146</a>, <a  class='extlink tipref' href='https://suttacentral.net/sn35.30'>SN 35.30–32</a>, <a  class='extlink tipref' href='https://suttacentral.net/sn35.90'>SN 35.90–91</a>, <a  class='extlink tipref' href='https://suttacentral.net/sn35.248'>SN 35.248</a>).</p><p>“Conceiving” and the closely related “conceit” (<em lang='pi' translate='no'>māna</em>) refer to the tendency of the mind to shape experience in terms of the self. Much of our thought is devoted to justifying, explaining, and interpreting our experience in ways that reinforce our notion of self. This can end up spinning out of control, in which case it is called “proliferation” (<em lang='pi' translate='no'>papañca</em>). To cut through this process the Buddha urges us to stop short with sense experience (<a  class='extlink tipref' href='https://suttacentral.net/sn35.94'>SN 35.94</a>, <a  class='extlink tipref' href='https://suttacentral.net/sn35.95'>SN 35.95</a>).</p><p>It is significant that, while the texts repeatedly speak of how the aggregates form the basis for theories of self (<em lang='pi' translate='no'>sakkāya</em>), the same is <em>not</em> said of the sense fields. If the aggregates provoke grasping to theories, the sense fields provoke grasping at <em>pleasure</em>, at the sheer vitality of sensory experience. Thus while the teachings on the aggregates emphasize <em>views</em>, here the focus shifts to <em>restraint</em>. A standard passage on sense restraint, familiar from the Gradual Training, speaks of preventing harmful qualities from invading the mind in the midst of sense experience (<a  class='extlink tipref' href='https://suttacentral.net/sn35.120'>SN 35.120</a>, <a  class='extlink tipref' href='https://suttacentral.net/sn35.127'>SN 35.127</a>, <a  class='extlink tipref' href='https://suttacentral.net/sn35.239'>SN 35.239</a>, <a  class='extlink tipref' href='https://suttacentral.net/sn35.240'>SN 35.240</a>). A person who chases the pleasure afforded by the senses is no less trapped by the pain they bring, and it is only by setting up mindfulness that one can achieve peace (<a  class='extlink tipref' href='https://suttacentral.net/sn35.132'>SN 35.132</a>, <a  class='extlink tipref' href='https://suttacentral.net/sn35.243'>SN 35.243–244</a>, <a  class='extlink tipref' href='https://suttacentral.net/sn35.247'>SN 35.247</a>).</p><p>In this way, by choosing the sense fields as a locus of practice one cuts directly at the roots of craving. This is emphasized in the final two <em lang='pi' translate='no'>vaggas</em>, which are especially rich in unforgettable imagery. The senses are an ocean traversed during the spiritual journey (<a  class='extlink tipref' href='https://suttacentral.net/sn35.228'>SN 35.228</a>). We’d be better off being tortured by hot pokers than being caught up in sense experience (<a  class='extlink tipref' href='https://suttacentral.net/sn35.235'>SN 35.235</a>). If you wish to train in meditation, you must learn to withdraw the senses like a tortoise drawing in its limbs, becoming safe from predators (<a  class='extlink tipref' href='https://suttacentral.net/sn35.240'>SN 35.240</a>). Pleasant experiences are the bait of Māra (<a  class='extlink tipref' href='https://suttacentral.net/sn35.230'>SN 35.230</a>). The six senses are like six very different animals, all tied together, and fighting to get to their own territory (<a  class='extlink tipref' href='https://suttacentral.net/sn35.247'>SN 35.247</a>).</p>"
}