[
  {"id":"Amaro 2021a","accessed":{"date-parts":[["2024",1,6]]},"author":[{"family":"Amaro","given":"Ajahn"}],"citation-key":"Amaro 2021a","file":"Amaro_2021_Catastrophe-Apostrophe.pdf","ISBN":"978-1-78432-179-6","issued":{"date-parts":[["2021"]]},"publisher":"Amaravati Buddhist Monastery, St Margarets, Great Gaddesden, Hemel Hempstead, Hertfordshire. HP1 3BZ","title":"Catastrophe/Apostrophe: The Buddha’s Teachings on Dependent Origination/Cessation","type":"book","URL":"https://forestsangha.org/teachings/books/catastrophe-apostrophe-the-buddha-s-teachings-on-dependent-origination-cessation?language=English"},
  {"id":"Analayo 2008a","author":[{"family":"Anālayo","given":"Bhikkhu"}],"citation-key":"Analayo 2008a","container-title":"Mahachulalongkornrajavidyalaya University Journal of Buddhist Studies","file":"Anālayo_2008_Rebirth and the Gandhabba.pdf","issued":{"date-parts":[["2008"]]},"page":"91–105","title":"Rebirth and the Gandhabba","type":"article-journal","URL":"https://www.buddhismuskunde.uni-hamburg.de/personen/analayo.html","volume":"1"},
  {"id":"Analayo 2011a","abstract":"A thorough examination of each discourse in the Majjhima-nikāya in the light of its parallels.\nIn this thousand-page tome, Bhikkhu Analayo goes systematically through the MN, one sutta at a time, and explains how the Pāli text differs (or not) from its parallels preserved in Sanskrit, Chinese and Tibetan. Perhaps surprisingly, they don’t differ all that much, though in some places the differences do shed light on the original teaching and shows what kinds of changes occurred to the texts during the process of transmission.\nThe book begins and ends with Bhikkhu Analayo’s reflections on the EBTs and the process of oral transmission, and while the book could certainly be read cover-to-cover, the primary way to use this book is as a reference work alongside the Majjhima Nikaya.","author":[{"family":"Anālayo","given":"Bhikkhu"}],"citation-key":"Analayo 2011a","file":"Anālayo_2011_A Comparative Study of the Majjhima-nikāya.pdf;Anālayo_2011_A Comparative Study of the Majjhima-nikāya2.pdf","issued":{"date-parts":[["2011"]]},"language":"en","note":"attachment-label:Vol1;Vol2","publisher":"Dharma Drum Publishing Corporation","title":"A Comparative Study of the Majjhima-nikāya","type":"document"},
  {"id":"Analayo 2013a","author":[{"family":"Analayo","given":"Bhikkhu"},{"family":"Bucknell","given":"Roderick S."},{"family":"Bingenheimer","given":"Marcus"}],"citation-key":"Analayo 2013a","collection-title":"BDK english tripiṭaka series middle-length discourses","file":"Analayo et al_2013_The Madhyama Āgama.pdf","issued":{"date-parts":[["2013"]]},"number-of-pages":"556","number-of-volumes":"3","publisher":"Bukkyō Dendō Kyōkai","title":"The Madhyama Āgama Volume I","type":"book","URL":"https://bdkamerica.org/product/the-madhyama-agama-middle-length-discourses-volume-i/","volume":"1"},
  {"id":"Analayo 2014a","author":[{"family":"Anālayo","given":"Bhikkhu"}],"citation-key":"Analayo 2014a","container-title":"The Dharma Drum Journal of Buddhist Studies","file":"Anālayo_2014_On the Five Aggregates 4.pdf","issue":"14","issued":{"date-parts":[["2014"]]},"page":"1-72","title":"On the Five Aggregates 4: A Translation of Saṃyukta-āgama Discourses 33 to 58","type":"article-journal","URL":"https://www.buddhismuskunde.uni-hamburg.de/pdf/5-personen/analayo/translations/sa04.pdf"},
  {"id":"Analayo 2015a","author":[{"family":"Anālayo","given":"Bhikkhu"}],"citation-key":"Analayo 2015a","event-place":"Taipei","file":"Anālayo_2015_Saṃyukta-āgama Studies.pdf","issued":{"date-parts":[["2015"]]},"number-of-pages":"595","publisher":"Dharma Drum Publishing","publisher-place":"Taipei","title":"Saṃyukta-āgama Studies","type":"book","URL":"https://www.buddhismuskunde.uni-hamburg.de/pdf/5-personen/analayo/sastudies.pdf"},
  {"id":"Analayo 2017a","abstract":"With this article I examine Pāli discourse references to luminosity of the mind in the light of their parallels, with a view to discerning early stages in the development of a notion that has had a considerable impact on Buddhist thought and practice.","accessed":{"date-parts":[["2023",3,14]]},"author":[{"family":"Anālayo","given":"Bhikkhu"}],"citation-key":"Analayo 2017a","container-title":"Journal of the Oxford Centre for Buddhist Studies","file":"Anālayo_2017_The Luminous Mind in Theravāda and Dharmaguptaka Discourses.pdf","ISSN":"2047-1076","issue":"0","issued":{"date-parts":[["2017",11,15]]},"language":"en","license":"Copyright (c) 2017 Bhikkhu Anālayo","page":"10-51","source":"www.jocbs.org","title":"The Luminous Mind in Theravāda and Dharmaguptaka Discourses","type":"article-journal","URL":"http://www.jocbs.org/index.php/jocbs/article/view/163","volume":"13"},
  {"id":"Analayo 2017a","abstract":"In this book, Bhikkhu Analayo, scholar and meditation teacher, examines central aspects of Buddhist meditation as reflected in the early discourses of the Buddha, based on revised and reorganized material from previously published articles. The main topics he takes up are mindfulness, the path to awakening, absorption, and the brahmaviharas. He compares parallel versions of the discourses in a variety of languages which offers a window on the earliest stages in the development of these Buddhist teachings.\"This book is a joy to read! It offers a pragmatic and accessible analysis of the role of mindfulness, tranquility, and the brahmaviharas in the early discourses of the Buddha.\" Shaila Catherine\"This book is a dharma treasure of scholarship and discernment, opening up new possibilities for our own practice and realization.\" Joseph Goldstein\"Readers will find this a fascinating and thought-provoking book that informs, illuminates, and challenges. It is a rich resource that enables both scholars and meditators to reflect more deeply on issues relating to meditation in early Buddhism.\" Peter Harvey","author":[{"family":"Analayo","given":"Bhikkhu"}],"citation-key":"Analayo 2017a","file":"Analayo_2017_Early Buddhist Meditation Studies.pdf","issued":{"date-parts":[["2017",3,22]]},"language":"English","number-of-pages":"254","publisher":"Barre Center for Buddhist Studies","title":"Early Buddhist Meditation Studies","type":"book"},
  {"id":"Analayo 2018a","abstract":"Join a rigorous scholar and Buddhist monk on a brisk tour of rebirth from ancient doctrine to contemporary debates. German Buddhist monk and university professor Bhikkhu Analayo had not given much attention to the topic of rebirth before some friends asked him to explore the treatment of the issue in early Buddhist texts. This succinct volume presents his findings, approaching the topic from four directions. The first chapter examines the doctrine of rebirth as it is presented in the earliest Buddhist sources and the way it relates to core doctrinal principles. The second chapter reviews debates about rebirth throughout Buddhist history and up to modern times, noting the role of confirmation bias in evaluation of evidence. Chapter 3 reviews the merits of current research on rebirth, including near-death experience, past-life regression, and children who recall previous lives. The chapter concludes with an examination of xenoglossy, the ability to speak languages one has not learned previously, and chapter 4 examines the particular case of Dhammaruwan, a Sri Lankan boy who chants Pali texts that he does not appear to have learned in his present life. Rebirth in Early Buddhism and Current Research brings together the many strands of the debate on rebirth in one place, making it both comprehensive and compact. It is not a polemic but an interrogation of the evidence, and it leaves readers to come to their own conclusions.","author":[{"family":"Analayo","given":"Bhikkhu"}],"citation-key":"Analayo 2018a","event-place":"Somerville, MA","file":"Analayo_2018_Rebirth in Early Buddhism and Current Research.pdf","ISBN":"978-1-61429-446-7","issued":{"date-parts":[["2018",5,24]]},"language":"English","number-of-pages":"296","publisher":"Wisdom Publications,U.S.","publisher-place":"Somerville, MA","source":"Amazon","title":"Rebirth in Early Buddhism and Current Research","type":"book"},
  {"id":"Analayo 2020a","author":[{"family":"Anālayo","given":"Bhikkhu"},{"family":"Bucknell","given":"Roderick S."}],"citation-key":"Analayo 2020a","collection-title":"BDK english tripiṭaka series middle-length discourses","file":"Anālayo_Bucknell_2020_The Madhyama Āgama.pdf","issued":{"date-parts":[["2020"]]},"number-of-pages":"450","number-of-volumes":"3","publisher":"Bukkyō Dendō Kyōkai","title":"The Madhyama Āgama Volume II","type":"book","URL":"https://bdkamerica.org/product/the-madhyama-%E2%80%82gama-middle-length-discourses-volume-ii/","volume":"2"},
  {"id":"Analayo 2021a","abstract":"This article presents a critical examination of a few selected positions taken by Ñāṇavīra Thera in his Notes on Dhamma.","author":[{"family":"Analayo","given":"Bhikkhu"}],"citation-key":"Analayo 2021a","container-title":"Journal of Buddhist Studies","file":"Analayo_2021_Clearing the Path Continues.pdf","issued":{"date-parts":[["2021"]]},"title":"Clearing the Path Continues: Notes on Ñāṇavīra Thera’s ‘Notes on Dhamma’","type":"article-journal","volume":"18"},
  {"id":"Analayo 2022a","author":[{"family":"Anālayo","given":"Bhikkhu"},{"family":"Bucknell","given":"Roderick S."}],"citation-key":"Analayo 2022a","collection-title":"BDK english tripiṭaka series middle-length discourses","file":"Anālayo_Bucknell_2022_The Madhyama Āgama.pdf","issued":{"date-parts":[["2022"]]},"number-of-pages":"500","number-of-volumes":"3","publisher":"Bukkyō Dendō Kyōkai","title":"The Madhyama Āgama Volume III","type":"book","URL":"https://www.bdkamerica.org/product/the-madhyama-agama-middle-length-discourses-volume-iii/","volume":"3"},
  {"id":"Analayo 2022b","abstract":"Various dimensions of the cultivation of mindfulness in its early Buddhist historical setting can be better appreciated in the light of their doctrinal background. One aspect of this doctrinal background is the ancient Indian tetralemma, which differs from the Aristotelian logic that has informed much of Western thought. The tetralemma proposes that, in addition to affirmation and denial, at times a particular situation may be more appropriately captured by a combination of both (partly yes and partly no). Or else, another situation may call for neither affirmation nor negation. Although at first sight the resultant fourfold perspective can appear puzzling, closer inspection shows this model of thought to have a considerable potential for countering mental rigidity and enabling the transcendence of binary thought patterns, thereby being perhaps relevant to research on the relationship between mindfulness and cognitive flexibility.","author":[{"family":"Anālayo","given":"Bhikkhu"}],"citation-key":"Analayo 2022b","container-title":"Mindfulness","container-title-short":"Mindfulness","DOI":"10.1007/s12671-021-01678-6","issued":{"date-parts":[["2022",6,1]]},"source":"ResearchGate","title":"Beyond the Limitations of Binary Thinking: Mindfulness and the Tetralemma","title-short":"Beyond the Limitations of Binary Thinking","type":"article-journal","volume":"13"},
  {"id":"Analayo 2023a","abstract":"The Signless and the Deathless : On the Realization of Nirvana (Hardback) (9781614298885)","author":[{"family":"Analayo","given":"Bhikkhu"}],"citation-key":"Analayo 2023a","file":"","ISBN":"978-1-61429-888-5","issued":{"date-parts":[["2023",11,19]]},"language":"en-gb","title":"The Signless and the Deathless : On the Realization of Nirvana","title-short":"The Signless and the Deathless","type":"book"},
  {"id":"Bausch 2015a","abstract":"This dissertation traces regional philosophy in religious texts, namely the Kāṇva Śatapatha Brāhmaṇa and the Suttanipāta. Receiving the Vedas in the East, Yājñavalkya and the Vājasaneyins enlivened earlier Vedic concepts and augmented Vedic propensities for asceticism. The region of Kosala flourished during the lifetime of Śākyamuni Buddha, and as a result, the Kāṇva School formed an important part of the cultural milieu in which the historical Buddha lived. The Suttanipāta depicts the Buddha as knowledgeable in Vedic practices and lore and as interacting with brāhmaṇas, arguably both before and after a separate Buddhist identity formed. Considering this background, the relationship between late Vedic and early Buddhist thought must be reassessed. Because value is acquired and erased when concepts circulate, the Buddha’s teaching in the Suttanipāta can be considered a philosophical project to create new concepts and to translate practices that respond to a changing milieu.Through a close analysis of Yājñavalkya’s interpretation of the agnihotra and Sāvitrī ṛk as related to cognitive processes, this study uncovers the metaphysical meaning of philosophical concepts, such as svàr, vā́ja, dhī́, and prajā, etc. In particular, the dissertation demonstrates that Yājñavalkya’s concept of karma (rite) in the Kāṇva Śatapatha Brāhmaṇa implies what is called karmic retribution. Vedic concepts for the unmanifest govern the idea of karmic retribution and the goal of becoming cognizant of the inflow of unmanifest energy in conscious cognition. The Buddha again revitalizes these concepts when teaching a brāhmaṇa audience in the Suttanipāta. The Buddhist concepts of upadhi, āsava, crossing over to the far shore, and the serpent shedding his skin enliven earlier Vedic philosophy, which was expressed in systems of conceptual metaphors. In this way, Kosalan philosophy in the Kāṇva Śatapatha Brāhmaṇa and the Suttanipāta advances theories of causality and two modes of knowing—one karmically conditioned by past actions (saṃjñā/saññā), and the other a direct knowing (prajñāna/paññā) unmediated by karmic retribution.","accessed":{"date-parts":[["2024",1,6]]},"author":[{"family":"Bausch","given":"Lauren Michelle"}],"citation-key":"Bausch 2015a","file":"Bausch_2015_Kosalan Philosophy in the Kāṇva Śatapatha Brāhmaṇa and the Suttanipāta.pdf","issued":{"date-parts":[["2015"]]},"language":"en","publisher":"UC Berkeley","source":"escholarship.org","title":"Kosalan Philosophy in the Kāṇva Śatapatha Brāhmaṇa and the Suttanipāta","type":"thesis","URL":"https://escholarship.org/uc/item/2940b93h"},
  {"id":"Bausch 2018a","abstract":"The Buddha was born and raised in the region of Kosala, where thrived the Vedic school of the Kāṇvas. The Kāṇvas inherited Yājñavalkya’s teachings in their recension of the","author":[{"family":"Bausch","given":"Lauren M."}],"citation-key":"Bausch 2018a","container-title":"Journal of the International Association of Buddhist Studies","DOI":"10.2143/JIABS.41.0.3285738","file":"Bausch_2018_The Kāṇva Brāhmaṇas and Buddhists in Kosala.pdf","issued":{"date-parts":[["2018"]]},"page":"27-53","title":"The Kāṇva Brāhmaṇas and Buddhists in Kosala","type":"article-journal","volume":"41"},
  {"id":"Bernhard 1968a","author":[{"family":"Bernhard","given":"Franz"}],"citation-key":"Bernhard 1968a","container-title":"Wiener Zeitschrift für die Kunde Süd- und Ostasiens","file":"","issued":{"date-parts":[["1968"]]},"page":"54–63","title":"Zur Interpretation der Pratītyasamutpāda-formel","type":"article-journal","volume":"7–8"},
  {"id":"Bingenheimer 2011a","author":[{"family":"Bingenheimer","given":"Marcus"}],"citation-key":"Bingenheimer 2011a","edition":"Chu ban","event-place":"Tai bei Shi","file":"Bingenheimer_2011_Studies in Āgama literature.pdf","ISBN":"978-957-17-2139-2","issued":{"date-parts":[["2011"]]},"language":"eng chi","number-of-pages":"345","publisher":"Xin wen feng chu ban gu fen you xian gong si","publisher-place":"Tai bei Shi","source":"K10plus ISBN","title":"Studies in Āgama literature: with special reference to the Shorter Chinese Saṃyuktāgama","title-short":"Studies in Āgama literature","type":"book"},
  {"id":"Bodhi 1984a","abstract":"The Mahanidana Sutta is the Buddha’s longest discourse on dependent arising, often taken to be the key to his entire teaching. The commentary treats this doctrine according to the Abhidhamma method, explained in an appendix. A penetrative introduction lays bare the sutta’s structure and the philosophical significance of dependent arising.","author":[{"family":"Bodhi","given":"Bhikku"},{"family":"Buddha","given":""}],"citation-key":"Bodhi 1984a","file":"Bodhi_1984_The Great Discourse on Causation.pdf","ISBN":"978-955-24-0117-6","issued":{"date-parts":[["1984"]]},"language":"en","number-of-pages":"162","publisher":"Buddhist Publication Society","title":"The Great Discourse on Causation: The Mahānidāna Sutta and Its Commentaries","title-short":"The Great Discourse on Causation","type":"book"},
  {"id":"Bodhi 1995a","abstract":"This book offers a complete translation of the Majjhima Nikāya, or Middle Length Discourses of the Buddha, one of the major collections of texts in the Pali Canon, the authorized scriptures of Theravāda Buddhism. This collection—among the oldest records of the historical Buddha’s original teachings—consists of 152 suttas or discourses of middle length, distinguished as such from the longer and shorter suttas of the other collections. The Majjhima Nikāya might be concisely described as the Buddhist scripture that combines the richest variety of contextual settings with the deepest and most comprehensive assortment of teachings. These teachings, which range from basic ethics to instructions in meditation and liberating insight, unfold in a fascinating procession of scenarios that show the Buddha in living dialogue with people from many different strata of ancient Indian society: with kings and princes, priests and ascetics, simple villagers and erudite philosophers. Replete with drama, reasoned argument, and illuminating parable and simile, these discourses exhibit the Buddha in the full glory of his resplendent wisdom, majestic sublimity, and compassionate humanity.\n\nThe translation is based on an original draft translation left by the English scholar-monk Bhikkhu Ñāṇamoli, which has been edited and revised by the American monk Bhikkhu Bodhi, who provides a long introduction and helpful explanatory notes. Combining lucidity of expression with accuracy, this translation enables the Buddha to speak across twenty-five centuries in language that addresses the most pressing concerns of the contemporary reader seeking clarification of the timeless issues of truth, value, and the proper conduct of life.","accessed":{"date-parts":[["2023",3,15]]},"citation-key":"Bodhi 1995a","event-place":"Boston","file":"1995_The Middle Length Discourses of the Buddha.pdf","ISBN":"978-0-86171-072-0","issued":{"date-parts":[["1995"]]},"language":"en","note":"attachment-label:Contents, Preface, Introduction & Summary of Suttas","number-of-pages":"1424","publisher":"Wisdom Publications","publisher-place":"Boston","title":"The Middle Length Discourses of the Buddha: A new translation of the Majjhima Nikāya","translator":[{"family":"Ñāṇamoli","given":"Bhikkhu"},{"family":"Bodhi","given":"Bhikkhu"}],"type":"book","URL":"https://wisdomexperience.org/product/middle-length-discourses-buddha/"},
  {"id":"Bodhi 1998a","abstract":".","accessed":{"date-parts":[["2024",1,6]]},"author":[{"family":"Bodhi","given":"Bhikkhu"}],"citation-key":"Bodhi 1998a","container-title":"Buddhist Studies Review","DOI":"10.1558/bsrv.v15i1.14728","file":"C:\\Users\\Stuart\\Zotero\\storage\\4GGXI9IT\\Bodhi_1998_A Critical Examination of Ñanavira Thera's 'A Note on Paticcasamuppada'- part1.pdf","ISSN":"1747-9681","issue":"1","issued":{"date-parts":[["1998",6,16]]},"language":"en","page":"43-64","source":"journal.equinoxpub.com","title":"A Critical Examination of Ñanavira Thera's 'A Note of Paticcasamuppada': Part One","title-short":"A Critical Examination of Ñanavira Thera's 'A Note of Paticcasamuppada'","type":"article-journal","URL":"https://journal.equinoxpub.com/BSR/article/view/14728","volume":"15"},
  {"id":"Bodhi 1998b","abstract":".","accessed":{"date-parts":[["2024",1,6]]},"author":[{"family":"Bodhi","given":"Bhikkhu"}],"citation-key":"Bodhi 1998b","container-title":"Buddhist Studies Review","DOI":"10.1558/bsrv.v15i2.14698","file":"C:\\Users\\Stuart\\Zotero\\storage\\GGWI7USX\\Bodhi_1998_A Critical Examination of Ñanavira Thera's 'A Note on Paticcasamuppada'- part2.pdf","ISSN":"1747-9681","issue":"2","issued":{"date-parts":[["1998",6,16]]},"language":"en","page":"157-181","source":"journal.equinoxpub.com","title":"A Critical Examination of Ñanavira Thera's 'A Note on Paticcasamuppada': Part Two","title-short":"A Critical Examination of Ñanavira Thera's 'A Note on Paticcasamuppada'","type":"article-journal","URL":"https://journal.equinoxpub.com/BSR/article/view/14698","volume":"15"},
  {"id":"Bodhi 2000a","author":[{"family":"Bodhi","given":"Bhikkhu"},{"family":"Buddha","given":""}],"citation-key":"Bodhi 2000a","collection-title":"Teachings of the Buddha","event-place":"Boston","file":"","ISBN":"978-0-86171-331-8","issued":{"date-parts":[["2000"]]},"language":"eng","number-of-pages":"2072","publisher":"Wisdom Publications","publisher-place":"Boston","title":"The Connected Discourses of the Buddha: A Translation of the Saṃyutta Nikāya ; translated from the Pāli","title-short":"The Connected Discourses of the Buddha","type":"book"},
  {"id":"Bodhi 2007a","author":[{"family":"Bodhi","given":"Bhikkhu"},{"family":"Anuruddha","given":"Ācariya"}],"citation-key":"Bodhi 2007a","edition":"3. ed","event-place":"Kandy, SriLanka","file":"Anuruddha_Bodhi_2007_A comprehensive manual of Abhidhamma.pdf","ISBN":"978-955-24-0103-9","issued":{"date-parts":[["2007"]]},"language":"eng","number-of-pages":"400","publisher":"Buddhist Publication Society","publisher-place":"Kandy, SriLanka","title":"A Comprehensive Manual of Abhidhamma: the Abhidhammattha Sangaha of Ācariya Anuruddha","title-short":"A comprehensive manual of Abhidhamma","type":"book"},
  {"id":"Bodhi 2012a","abstract":"The present volume, which continues Wisdom s famous Teachings of the Buddha series, contains a full translation of the Anguttara Nikaya. The Anguttara arranges the Buddha s discourses in accordance with a numerical scheme intended to promote retention and easy comprehension. In an age when writing was still in its infancy, this proved to be the most effective way to ensure that the disciples could grasp and replicate the structure of a teaching. A broad survey of the Anguttara Nikaya shows that its primary focus is on practice, and it treats practice from a wide-angle perspective. The subjects of the discourses range from the basic ethical observances recommended to the busy layperson, through the pillars of mind training, to the highest meditative attainments. The Anguttara is also distinguished among the four Nikayas by its interest in types of persons, which it describes and classifies in detail, often with stunning similes. In such a work, it is fitting that the Buddha appears, not merely as a teacher, but as a real person with his own life story and achievements.","author":[{"family":"Bodhi","given":"Bhikkhu"}],"citation-key":"Bodhi 2012a","edition":"Annotated edition","event-place":"Boston","file":"","ISBN":"978-1-61429-040-7","issued":{"date-parts":[["2012",11,13]]},"language":"English","number-of-pages":"1936","publisher":"Wisdom Publications,U.S.","publisher-place":"Boston","title":"The Numerical Discourses of the Buddha: A Complete Translation of the Anguttara Nikaya","title-short":"The Numerical Discourses of the Buddha","type":"book"},
  {"id":"Bodhi 2015b","abstract":"This new Pariyatti Edition brings together eight essays of Bhikkhu Bodhi, five of which were earlier published in academic journals and volumes, and three not published before. Most of the essays are critical responses to various modern interpretations of the Dhamma that the author considers to be at odds with the Buddha’s teachings, in particular as transmitted and interpreted by the Theravāda school of Buddhism. The other essays are in depth discussions of important Buddhist doctrinal terms.","author":[{"family":"Bodhi","given":"Bhikkhu"}],"citation-key":"Bodhi 2015b","file":"Bodhi_2015_Investigating the Dhamma.pdf","ISBN":"978-955-24-0416-0","issued":{"date-parts":[["2015"]]},"language":"en","number-of-pages":"178","publisher":"Buddhist Publication Society","title":"Investigating the Dhamma: A Collection of Papers","title-short":"Investigating the Dhamma","type":"book"},
  {"id":"Bodhi 2017b","abstract":"The latest volume in the Teachings of the Buddha series translates the most ancient layer of the Buddha's teachings, a text that matches the Dhammapada in its concise power and its centrality to the Buddhist tradition. Celebrated translator Bhikkhu Bodhi illuminates these verses and their canonical commentaries with elegant renderings and authoritative annotation in this landmark volume. The Suttanipata, or \"Group of Discourses\" is a collection of sermons by the Buddha that includes some of the most popular suttas of the Pali Canon, such as the Loving-Kindness Sutta and the Rhinoceros-Horn Sutta. The suttas are primarily in verse, though several are in mixed prose and verse. The Suttanipata contains discourses that extol the figure of the muni, the illumined sage, who wanders homeless completely detached from the world. Other suttas, such as the Discourse on Downfall and the Discourse on Blessings, establish the foundations of Buddhist lay ethics. The last two chapters--the Atthakavagga (Chapter of Octads) and the Parayanavagga (The Way to the Beyond)--are considered to be among the most ancient parts of the Pali Canon. The Atthakavagga advocates a critical attitude toward views and doctrines. The Parayanavagga is a beautiful poem in which sixteen spiritual seekers travel across India to meet the Buddha and ask him profound questions pertaining to the highest goal.  The commentary, the Paramatthajotika, relates the background story to each sutta and explains each verse in detail. The volume includes numerous excerpts from the Niddesa, an ancient commentary already included in the Pali Canon, which offers detailed expositions of each verse in the Atthakavagga, the Parayanavagga, and the Rhinoceros Horn Sutta.  The translator provides a long, insightful introduction, a guide to the individual suttas, extensive notes, a list of parallels to the discourses of the Suttanipata, and a list of the numerical sets mentioned in the commentaries.","author":[{"family":"Bodhi","given":"Bhikkhu"}],"citation-key":"Bodhi 2017b","file":"","ISBN":"978-1-61429-429-0","issued":{"date-parts":[["2017",10,26]]},"language":"English","number-of-pages":"1568","publisher":"Wisdom Publications,U.S.","title":"The Suttanipata: An Ancient Collection of Buddha's Discourses","title-short":"The Suttanipata","type":"book"},
  {"id":"Bodhi 2021a","abstract":"Renowned scholar-monk and bestselling translator Bhikkhu Bodhi's definitive, practical guide on how to read ancient Buddhist texts in the original language. Bhikkhu Bodhi's sophisticated and practical instructions on how to read the Pali of the Buddha's discourses will acquaint students of Early Buddhism with the language and idiom of these sacred texts. Here the renowned English translator of the Pali Canon opens a window into key suttas from the Sa?yutta Nikaya, giving a literal translation of each sentence followed by a more natural English rendering, then explaining the grammatical forms involved. In this way, students can determine the meaning of each word and phrase and gain an intimate familiarity with the distinctive style of the Pali suttas--with the words, and world, of the earliest Buddhist texts.  Ven. Bodhi's meticulously selected anthology of suttas provides a systematic overview of the Buddha's teachings, mirroring the four noble truths, the most concise formulation of the Buddha's guide to liberation. Reading the Buddha's Discourses in Pali shares with readers not only exceptional language instruction but also a nuanced study of the substance, style, and method of the early Buddhist discourses.","author":[{"family":"Bodhi","given":"Bhikkhu"}],"citation-key":"Bodhi 2021a","event-place":"Somerville, MA, USA","file":"","ISBN":"978-1-61429-700-0","issued":{"date-parts":[["2021",1,8]]},"language":"English","number-of-pages":"500","publisher":"Wisdom Publications,U.S.","publisher-place":"Somerville, MA, USA","title":"Reading the Buddha's Discourses in Pali: A Practical Guide to the Language of the Ancient Buddhist Canon","title-short":"Reading the Buddha's Discourses in Pali","type":"book"},
  {"id":"Bodhi-Audio 1979a","abstract":"In the fall of 1979, while living at the Washington Buddhist Vihara, Ven. Bhikkhu Bodhi gave a series of lectures on the fundamental teachings of Early Buddhism. Bhante Gunaratana, at the time the President of the Buddhist Vihara Society, suggested he record the lectures so that the Vihara could distribute them as a set of cassette tapes.\n\nIn the summer of 1981, Ven. Bodhi recorded his ten lectures in the basement of the Washington Buddhist Vihara, using an ordinary, nonprofessional recorder. An enthusiastic lay supporter had the master copies reproduced in large quantities for expanded distribution. They have continued to be distributed on tape and as CDs for over twenty-five years, and are considered “public domain” for anyone to copy and distribute freely. The one condition is that they must not be sold.\n\nWe recommend that the first time you listen to them, you listen to them in their proper sequence:","author":[{"family":"Bodhi","given":"Bhikkhu"}],"citation-key":"Bodhi-Audio 1979a","collection-title":"The Buddha’s Teaching As It Is","event-place":"Washington Buddhist Vihara","file":"C:\\Users\\Stuart\\Zotero\\storage\\2SVSXVXI\\BB-001_The_Buddha.mp3;C:\\Users\\Stuart\\Zotero\\storage\\RD82QYN2\\BB-002_Four_Noble_Truths.mp3;C:\\Users\\Stuart\\Zotero\\storage\\S3BZYUWB\\BB-003_Nature_of_Existence.mp3;C:\\Users\\Stuart\\Zotero\\storage\\K2INX6NZ\\BB-004_Dependent_Origination.mp3;C:\\Users\\Stuart\\Zotero\\storage\\8V6TKUVS\\BB-005_Rebirth_and_Kamma.mp3;C:\\Users\\Stuart\\Zotero\\storage\\TWSXYRJS\\BB-006_Nibbana.mp3;C:\\Users\\Stuart\\Zotero\\storage\\3CGH4DCU\\BB-007_Eightfold_Path.mp3;C:\\Users\\Stuart\\Zotero\\storage\\7TXX8RUY\\BB-008_Meditation.mp3;C:\\Users\\Stuart\\Zotero\\storage\\64UEPFXH\\BB-009_Social_Teachings_of_Buddha.mp3;C:\\Users\\Stuart\\Zotero\\storage\\DSHCI3Q5\\BB-010_The_Sangha.mp3","publisher-place":"Washington Buddhist Vihara","title":"The Buddha’s Teaching As It Is - All 10 recordings","type":"song","URL":"https://bodhimonastery.org/the-buddhas-teaching-as-it-is.html"},
  {"id":"Brahm 2006a","abstract":"Meditation can be a way to radically encounter bliss and to begin—and sustain—real transformation in ourselves.In Mindfulness, Bliss, and Beyond, self-described meditation junkie Ajahn Brahm shares his knowledge and experience of the jhanas - a core part of the Buddha's original meditation teaching. Never before has this material been approached in such an empowering way, by a teacher of such authority and popularity.  Full of surprises, delightfully goofy humor, and entertaining stories that inspire, instruct, and illuminate, Mindfulness, Bliss, and Beyond will encourage those new to meditation, and give a shot in the arm to more experienced practitioners as well.","author":[{"family":"Brahm","given":""}],"citation-key":"Brahm 2006a","file":"","ISBN":"0-86171-275-7","issued":{"date-parts":[["2006",8,10]]},"language":"English","number-of-pages":"308","publisher":"Wisdom Publications","title":"Mindfulness, Bliss, and Beyond: A Meditator's Handbook","title-short":"Mindfulness, Bliss, and Beyond","type":"book"},
  {"id":"Brahmali 2009a","abstract":"The only way of moving towards consensus on the controversial subject of the nature of Nibbana is by appealing to the sole source of authority common to practically all Buddhists: the Nikayas/Agamas. In the present paper I will first give an overview of the usage of the term Nibbana in the Nikayas. I will then argue that, according to the Nikayas, Nibbana cannot be regarded as a self. Next, I will point out that the Nikayas do not see Nibbana as a form of consciousness, including such exceptional kinds of consciousness as anidassana viññana and appatitthita viññana. Nor can Nibbana be regarded as equivalent to mind, or any particular state of mind. In the final section I aim to show that the most reasonable interpretation of the Nikayas is that final Nibbana is no more than the cessation of the five khandhas.","accessed":{"date-parts":[["2023",3,14]]},"author":[{"family":"Brahmāli","given":"Bhikkhu"}],"call-number":"Original 2009","citation-key":"Brahmali 2009a","container-title":"Buddhist Studies Review","DOI":"10.1558/bsrv.v26i1.33","file":"Brahmāli_2009_What the Nikayas Say and Do not Say about Nibbana.pdf","ISSN":"1747-9681","issue":"1","issued":{"date-parts":[["2009",8,22]]},"language":"en","note":"attachment-label:Original 2009\ntMS:niknib","page":"33-66","source":"journal.equinoxpub.com","title":"What the Nikayas Say and Do not Say about Nibbana","type":"article-journal","URL":"https://journal.equinoxpub.com/BSR/article/view/8891","volume":"26"},
  {"id":"Bucknell 1999a","author":[{"family":"Bucknell","given":"Roderick S."}],"citation-key":"Bucknell 1999a","container-title":"Journal of the International Association of Buddhist Studies","file":"Bucknell_1999_Conditioned Arising Evolves.pdf","issue":"2","issued":{"date-parts":[["1999"]]},"page":"311-342","title":"Conditioned Arising Evolves: Variation and Change in Textual Accounts of the Paṭicca-samuppāda Doctrine","type":"article-journal","volume":"22"},
  {"id":"Buddhadasa 2020a","author":[{"family":"Buddhadasa","given":"Bhikkhu"}],"citation-key":"Buddhadasa 2020a","file":"Buddhadasa_2020_Paticcasamuppada.pdf","issued":{"date-parts":[["2020"]]},"language":"English","publisher":"Buddhadasa Foundation","title":"Paticcasamuppada: Pratical Dependent Origination By. Buddhadasa Bhikkhu","title-short":"Paticcasamuppada","type":"book"},
  {"id":"Choong 2000a","abstract":"This book is a comparative examination of the main teachings contained in the Sutranga portion of the Pali Samyutta-nikaya (SN) and its counterpart in Chinese canon, a translation of a now lost Sanskrit Samyuktagama (Za-ahan-jing) (SA). The SN and SA are essentially two different versions of the same collection of discourses.This study builds on the work of Yin Shun, which demonstrates the historical importance of SN/SA in the formation of the early Buddhist canon. In particular, it is based on Yin Shun's recognition of the three-anga structure of SN/SA, and of the status of its Sutranga portion as of prime importance in the historical formation of this nikaya/agama, and as containing the most fundamental teachings of Buddha. The aim of this research is to reveal and clarify the similarities and differences between SN and SA, with regard to the principal Buddhist teachings contained in their Sutranga portion.","author":[{"family":"Choong","given":"Mun-Keat"}],"citation-key":"Choong 2000a","event-place":"Wiesbaden","file":"Choong_2000_The Fundamental Teachings of Early Buddhism, A Comparative Study Based on the.pdf","ISBN":"978-3-447-04232-1","issued":{"date-parts":[["2000"]]},"language":"English","number-of-pages":"269","publisher":"Harrassowitz","publisher-place":"Wiesbaden","title":"The Fundamental Teachings of Early Buddhism, A Comparative Study Based on the Sūtrāṅga portion of the Pāli Saṃyutta-Nikāya and the Chinese Saṃyuktāgama","title-short":"The Fundamental Teachings of Early Buddhism","type":"book"},
  {"id":"Cintita 2021a","accessed":{"date-parts":[["2024",1,7]]},"author":[{"family":"Cintita","given":"Bhikkhu"}],"citation-key":"Cintita 2021a","file":"Cintita_2021_Dependent Coarising.pdf","issued":{"date-parts":[["2021",1,1]]},"language":"en","title":"Dependent Coarising: Meaning Construction in the Twelve Links","title-short":"Dependent Coarising","type":"book"},
  {"id":"Collins 1982a","abstract":"This book explains the Buddhist doctrine of annattá (\"not-self\"), which denies the existence of any self, soul, or enduring essence in man. The author relates this doctrine to its cultural and historical context, particularly to its Brahman background. He shows how the Theravada Buddhist tradition has constructed a philosophical and psychological account of personal identity on the apparently impossible basis of the denial of self. Although the emphasis of the book is firmly philosophical, Dr. Collins makes use of a number of academic disciplines, particularly those of anthropology, linguistics, sociology, and comparative religion, in an attempt to discover the \"deep structure\" of Buddhist culture and imagination, and to make these doctrines comprehensible in terms of the western history of ideas.","author":[{"family":"Collins","given":"Steven"}],"citation-key":"Collins 1982a","edition":"Repr., [3.] impr","event-place":"Cambridge","file":"","ISBN":"978-0-521-24081-9","issued":{"date-parts":[["1982"]]},"language":"eng","number-of-pages":"323","publisher":"Cambridge Univ. Press","publisher-place":"Cambridge","title":"Selfless Persons: Imagery and thought in Theravāda Buddhism","title-short":"Selfless Persons","type":"book"},
  {"id":"Dict-CPD","abstract":"A Critical Pāli Dictionary Online is maintained by the Data Center for the Humanities at the University of Cologne in cooperation with the Pali Text Society. The project was originally carried out by the Department of Cross-Cultural and Regional Studies (ToRS) at the University of Copenhagen. It has been set up again in 2016 by Marcello Perathoner (Cologne Center for eHumanities) • Contact: cpd-contact@uni-koeln.de","accessed":{"date-parts":[["2024",1,7]]},"citation-key":"Dict-CPD","container-title":"Critical Pāli Dictionary","file":"","title":"Critical Pali Dictionary","type":"webpage","URL":"https://cpd.uni-koeln.de/"},
  {"id":"Dict-CPED","author":[{"family":"Mahathera","given":"Buddhadatta"}],"citation-key":"Dict-CPED","file":"Mahathera_1949_The Concise Pali-English Dictionary.pdf","issued":{"date-parts":[["1949"]]},"number-of-pages":"315","title":"The Concise Pali-English Dictionary","type":"book","URL":"https://dictionary.sutta.org/"},
  {"id":"Dict-DOP","abstract":"As of 2020, three of the four volumes have been published: Part I (A-Kh), Part II (G-N), and Part III (P-Bh).\n\nThe first volume of Cone's dictionary covered the letters a-kh. Part Two thus represents the first substantial advance in Pali lexicography since the early 1920's, when the relevant portion of T.W. Rhys Davids and W. Stede's Pali-English Dictionary was first published. The third volume of Cone's dictionary covered the letters p-bh.\n\nThis impressive new dictionary has several improvements over the classic Pali Text Society Pali Dictionary, including the use of Pali quotations from the Canon to illustrate the meaning of words, instead of simply references to those passages.\n\nThis dictionary has two main aims: first, to help its user read and understand the Pali Canon and its commentaries; and second, to provide a picture of the language, syntax, and even grammar of these texts. As of 2020, three of the four volumes have been published: Part I (A-Kh), Part II (G-N), and Part III (P-Bh).\n\nThe last parts of this dictionary is currently being prepared (but may be a very long time before publication) and the Dictionary is likely to remain the principle lexical resource for scholars working with Pali texts for some generations to come.","author":[{"family":"Cone","given":"Margaret"}],"citation-key":"Dict-DOP","event-place":"Oxford","file":"","issued":{"date-parts":[["2021"]]},"language":"pli eng","publisher":"Pali Text Society","publisher-place":"Oxford","title":"A Dictionary of Pāli","title-short":"A Dictionary of Pāli","type":"book"},
  {"id":"Dict-DPD","author":[{"family":"Bodhirasa","given":"Bhikkhu"}],"citation-key":"Dict-DPD","file":"","issued":{"date-parts":[["2022"]]},"title":"Digital Pāḷi Dictionary","type":"webpage","URL":"https://digitalpalidictionary.github.io/"},
  {"id":"Dict-DPPN","author":[{"family":"Malalasekera","given":"G. P."}],"citation-key":"Dict-DPPN","file":"","issued":{"date-parts":[["1937"]]},"title":"Dictionary of Pāli Proper Names","type":"webpage","URL":"https://www.palikanon.com/english/pali_names/dic_idx.html"},
  {"id":"Duroiselle 1906-2007","abstract":"This book was first published in 1906 at the \"Rangoon College\" of British occupied\nBurma; the second edition followed in 1915. An electronic text released into the public\ndomain constituted the 3rd edition in 1997. The present edition of the electronic text has been\nextensively re-formatted to display the Pali text with Unicode compliant characters, and should not\nrequire any special fonts to display properly on a contemporary computer. I have made corrections\nto typographical errors, and have made aesthetic changes to the layout and sequence of the tables,\nbut I have refrained from substantially revising or editing the text.\nEisel Mazard, Xishuangbanna, Yunnan, P.R.C., 2007","accessed":{"date-parts":[["2024",1,7]]},"author":[{"family":"Duroiselle","given":"Charles"}],"citation-key":"Duroiselle 1906-2007","edition":"4.3","file":"Duroiselle_2007_A Practical Grammar of the Pāli Language.pdf","issued":{"date-parts":[["2007"]]},"language":"en","source":"www.academia.edu","title":"A Practical Grammar of the Pāli Language","type":"book","URL":"https://www.academia.edu/37146113/A_Practical_Grammar_of_the_P%C4%81li_Language"},
  {"id":"Falk 1943a","author":[{"family":"Falk","given":"Maryla"}],"citation-key":"Falk 1943a","event-place":"Calcutta","file":"Falk_1943_Nāma-Rūpa and Dharma-Rūpa.pdf","issued":{"date-parts":[["1943"]]},"language":"eng","number-of-pages":"222","publisher":"University of Calcutta","publisher-place":"Calcutta","source":"Open WorldCat","title":"Nāma-Rūpa and Dharma-Rūpa: Origin and Aspects of an Ancient Indian Conception","title-short":"Nāma-rūpa and dharma-rūpa","type":"book"},
  {"id":"Flood 2003a","call-number":"BL1202 .B72 2003","citation-key":"Flood 2003a","collection-title":"Blackwell companions to religion","editor":[{"family":"Flood","given":"Gavin D."}],"event-place":"Malden, MA","file":"Flood_2003_The Blackwell Companion to Hinduism.pdf","ISBN":"978-0-631-21535-6","issued":{"date-parts":[["2003"]]},"number-of-pages":"599","publisher":"Blackwell Pub","publisher-place":"Malden, MA","source":"Library of Congress ISBN","title":"The Blackwell Companion to Hinduism","type":"book"},
  {"id":"Frauwallner 1953/1973","author":[{"family":"Frauwallner","given":"Erich"}],"citation-key":"Frauwallner 1953/1973","event-place":"Delhi","file":"Frauwallner_1973_History of Indian Philosophy.pdf;Frauwallner_1973_History of Indian Philosophy2.pdf","ISBN":"978-81-208-0987-1 978-0-89581-370-1","issued":{"date-parts":[["1953"],["1973"]]},"language":"eng","note":"attachment-label:Vol1;Vol2","publisher":"Motilal Banarsidass","publisher-place":"Delhi","title":"History of Indian Philosophy","translator":[{"family":"Bedekar","given":"Vitthal Mahadeo"}],"type":"book"},
  {"id":"Frauwallner 1995a","author":[{"family":"Frauwallner","given":"Erich"}],"citation-key":"Frauwallner 1995a","collection-title":"SUNY series in Indian thought","event-place":"Albany (N.Y)","file":"Frauwallner_1995_Studies in Abhidharma Literature and the Origins of Buddhist Philosophical.pdf","ISBN":"978-0-7914-2699-9","issued":{"date-parts":[["1995"]]},"language":"eng","publisher":"State university of New York press","publisher-place":"Albany (N.Y)","title":"Studies in Abhidharma Literature and the Origins of Buddhist Philosophical Systems","translator":[{"family":"Kidd","given":"Sophie Francis"},{"family":"Steinkellner","given":"Ernst"}],"type":"book"},
  {"id":"Frazer1890a","author":[{"family":"Frazer","given":"James George"}],"citation-key":"Frazer1890a","collection-title":"Oxford world's classics","event-place":"New York city","file":"Frazer_1890_The Golden Bough.pdf","ISBN":"978-0-19-283541-3","issued":{"date-parts":[["1890"]]},"number-of-pages":"752","publisher":"The Macmillan Company","publisher-place":"New York city","title":"The Golden Bough: A Study in Magic and Religion","title-short":"The golden bough","type":"book"},
  {"id":"Horner IB 1954a","abstract":"The second collection of the Sutta-piṭaka containing 152 suttas including some of the best known sermons in the Pāli canon, e.g. Alagaddūpamasutta, Aṇgulimāla-sutta and Mahāsīhanāda-sutta. \n3 volumes:\nVol. I: (1954, 1993, 1995, 2016 paperback reprint / POD);\nVol. II: (1957, 1989, 1994, 2016 paperback reprint / POD);\nVol. III:  (1959, 1993)","citation-key":"Horner IB 1954a","collection-title":"The Collection of the Middle Length Sayings (Majjhima-Nikaya)","editor":[{"family":"Horner","given":"I. B."}],"event-place":"London","file":"Horner_1954_The Collection of the Middle Length Sayings (Majjhima-Nikaya).pdf","issued":{"date-parts":[["1954"]]},"language":"en","number-of-volumes":"3","publisher":"Pali Text Society","publisher-place":"London","title":"The Collection of the Middle Length Sayings (Majjhima-Nikaya)","translator":[{"family":"Horner","given":"I. B."}],"type":"book","URL":"https://palitextsociety.org/product/middle-length-sayings-3-volume-set/","volume":"1"},
  {"id":"Horner IB 1957a","abstract":"The second collection of the Sutta-piṭaka containing 152 suttas including some of the best known sermons in the Pāli canon, e.g. Alagaddūpamasutta, Aṇgulimāla-sutta and Mahāsīhanāda-sutta. \n3 volumes:\nVol. I: (1954, 1993, 1995, 2016 paperback reprint / POD);\nVol. II: (1957, 1989, 1994, 2016 paperback reprint / POD);\nVol. III:  (1959, 1993)","citation-key":"Horner IB 1957a","collection-title":"The Collection of the Middle Length Sayings (Majjhima-Nikaya)","editor":[{"family":"Horner","given":"I. B."}],"event-place":"London","file":"D:\\Data\\tMS\\dev\\books\\_resources\\zotero-attach\\Horner_1957_The Collection of the Middle Length Sayings (Majjhima-Nikaya) Vol.pdf","issued":{"date-parts":[["1957"]]},"number-of-volumes":"3","publisher":"Pali Text Society","publisher-place":"London","title":"The Collection of the Middle Length Sayings (Majjhima-Nikaya) Vol.2","translator":[{"family":"Horner","given":"I. B."}],"type":"book","URL":"https://palitextsociety.org/product/middle-length-sayings-3-volume-set/","volume":"2"},
  {"id":"Horner IB 1959a","abstract":"The second collection of the Sutta-piṭaka containing 152 suttas including some of the best known sermons in the Pāli canon, e.g. Alagaddūpamasutta, Aṇgulimāla-sutta and Mahāsīhanāda-sutta. \n3 volumes:\nVol. I: (1954, 1993, 1995, 2016 paperback reprint / POD);\nVol. II: (1957, 1989, 1994, 2016 paperback reprint / POD);\nVol. III:  (1959, 1993)","citation-key":"Horner IB 1959a","collection-title":"The Collection of the Middle Length Sayings (Majjhima-Nikaya)","editor":[{"family":"Horner","given":"I. B."}],"event-place":"London","file":"D:\\Data\\tMS\\dev\\books\\_resources\\zotero-attach\\Horner_1959_The Collection of the Middle Length Sayings (Majjhima-Nikaya) Vol.pdf","issued":{"date-parts":[["1959"]]},"number-of-volumes":"3","publisher":"Pali Text Society","publisher-place":"London","title":"The Collection of the Middle Length Sayings (Majjhima-Nikaya) Vol.3","translator":[{"family":"Horner","given":"I. B."}],"type":"book","URL":"https://palitextsociety.org/product/middle-length-sayings-3-volume-set/","volume":"3"},
  {"id":"Rhys Davids TW 1921a","abstract":"T.W. Rhys Davids and William Stede, 1921-25, reprinted 1992,1995, repr. with corrections 2015  See also University of Chicago site.","accessed":{"date-parts":[["2023",3,15]]},"author":[{"family":"Rhys Davids","given":"T.W."},{"family":"Stede","given":"William"}],"citation-key":"Rhys Davids TW 1921a","file":"Rhys Davids_Stede_1921_Pāli-English Dictionary.pdf","issued":{"date-parts":[["1921"]]},"publisher":"Pali Text Society","title":"Pāli-English Dictionary","type":"book","URL":"https://palitextsociety.org/product/pali-english-dictionary/"},
  {"id":"Sujato 2011a","abstract":"I’ve just read yet another assertion that tries to slip a ‘cosmic consciousness’ Nibbana into the Suttas. In these kinds of arguments the same mistakes are made again and again, and you should beware of them.","accessed":{"date-parts":[["2023",3,15]]},"author":[{"family":"Sujato","given":"Bhikkhu"}],"citation-key":"Sujato 2011a","container-title":"Sujato’s Blog","file":"Sujato_2011_Nibbana is not viññāṇa2.pdf","issued":{"date-parts":[["2011",5,12]]},"language":"en","title":"Nibbana is not viññāṇa. Really, it just isn’t.","type":"post-weblog","URL":"https://sujato.wordpress.com/2011/05/13/vinna%e1%b9%87a-is-not-nibbana-really-it-just-isn%e2%80%99t/"},
  {"id":"Sujato 2011b","abstract":"Thanks to Sylvester for raising some more issues regarding the ‘non-manifest consciousness.’ In this follow-up post I will address the verse he quotes and a number of other issues.","accessed":{"date-parts":[["2023",3,15]]},"author":[{"family":"Sujato","given":"Bhikkhu"}],"citation-key":"Sujato 2011b","container-title":"Sujato’s Blog","file":"Sujato_2011_Nibbana is not Viññāṇa.pdf","issued":{"date-parts":[["2011",5,18]]},"language":"en","title":"Nibbana is still not Viññāṇa","type":"post-weblog","URL":"https://sujato.wordpress.com/2011/05/18/"},
  {"id":"Sujato 2018a","abstract":"Early Buddhist texts and modern translations. Suttas (sutras) from the Tipitaka (Tripitaka) in Pali, Chinese, Sanskrit, and Tibetan with the Buddha's teachings on mindfulness, insight, wisdom, and meditation.","accessed":{"date-parts":[["2023",3,15]]},"citation-key":"Sujato 2018a","container-title":"SuttaCentral","file":"","issued":{"date-parts":[["2018"]]},"language":"en","title":"Translations of the Pali Canon at SuttaCentral","translator":[{"family":"Sujato","given":"Bhikkhu"}],"type":"webpage","URL":"https://suttacentral.net/search?query=author:sujato"},
  {"id":"Thanissaro 2014a","accessed":{"date-parts":[["2023",3,15]]},"citation-key":"Thanissaro 2014a","file":"","issued":{"date-parts":[["2014"]]},"language":"en","title":"Translations of the Pali Canon at Access to Insight","translator":[{"family":"Thanissaro","given":"Bhikkhu"}],"type":"webpage","URL":"https://accesstoinsight.org/"},
  {"id":"Velez 2004a","accessed":{"date-parts":[["2024",1,7]]},"author":[{"family":"Velez de Cea","given":"Abraham"}],"citation-key":"Velez 2004a","container-title":"The Indian International Journal of Buddhist Studies","file":"Velez de Cea_2004_The silence of the Buddha and the questions about the Tathlgata after death.pdf","issued":{"date-parts":[["2004"]]},"language":"en","page":"119-141","source":"www.academia.edu","title":"The silence of the Buddha and the questions about the Tathlgata after death","type":"article-journal","URL":"https://www.academia.edu/70655233/The_silence_of_the_Buddha_and_the_questions_about_the_Tathlgata_after_death","volume":"5"},
  {"id":"Warder 2001a","author":[{"family":"Warder","given":"Anthony Kennedy"}],"citation-key":"Warder 2001a","edition":"3. ed","event-place":"Oxford","file":"Warder_2001_Introduction to Pali.pdf","ISBN":"978-0-86013-197-7","issued":{"date-parts":[["2001"]]},"language":"en","number-of-pages":"471","publisher":"Pali Text Soc","publisher-place":"Oxford","title":"Introduction to Pali","type":"book"},
  {"id":"wiswo-doab","abstract":"This essay discusses the meaning of the twelve factors that make up the standard description of dependent origination. It then analyses the nature of the causes linking each pair of neighbouring factors, using a Western model of causality. It examines why the Buddha placed such importance on dependent origination? Asks what is its purpose? And in the final section it proposes that the function of dependent origination is threefold: To explain how there can be rebirth without a soul. To answer the question “What is life?” To understand why there is suffering, and where suffering comes to an end.","author":[{"family":"Brahm","given":"Ajahn"}],"citation-key":"wiswo-doab","container-title":"Wisdom & Wonders","file":"","genre":"Dhamma Book","issued":{"date-parts":[["2021"]]},"language":"English","title":"Dependent Origination","type":"webpage","URL":"https://wiswo.org/books/doab"},
  {"id":"wiswo-gkbk","author":[{"family":"Dhammika","given":"Bhante S"}],"citation-key":"wiswo-gkbk","container-title":"Wisdom & Wonders","file":"","genre":"Dhamma Book","issued":{"date-parts":[["2015"]]},"language":"English","title":"Good Karma! Bad Karma! What Exactly is Karma?","type":"webpage","URL":"https://wiswo.org/books/gkbk"},
  {"id":"wiswo-niknib","abstract":"The only way of moving towards consensus on the controversial subject of the nature of Nibbana is by appealing to the sole source of authority common to practically all Buddhists: the Nikayas/Agamas. In the present paper I will first give an overview of the usage of the term Nibbana in the Nikayas. I will then argue that, according to the Nikayas, Nibbana cannot be regarded as a self. Next, I will point out that the Nikayas do not see Nibbana as a form of consciousness, including such exceptional kinds of consciousness as anidassana viññana and appatitthita viññana. Nor can Nibbana be regarded as equivalent to mind, or any particular state of mind. In the final section I aim to show that the most reasonable interpretation of the Nikayas is that final Nibbana is no more than the cessation of the five khandhas.","accessed":{"date-parts":[["2023",3,11]]},"author":[{"family":"Brahmāli","given":"Bhikkhu"}],"citation-key":"wiswo-niknib","container-title":"Wisdom & Wonders","file":"","genre":"Dhamma Book","issued":{"date-parts":[["2022"]]},"language":"en","title":"What the Nikayas Say and Do not Say about Nibbana","type":"webpage","URL":"https://wiswo.org/books/niknib"},
  {"id":"www.wisdomlib.orgGreatChronicleBuddhas2019","abstract":"Also known as the Mahabuddhavamsa, this book is a large compilation of stories involving the Buddha, formar Buddhas, Buddhist disciples, and former li...","accessed":{"date-parts":[["2023",3,30]]},"author":[{"family":"www.wisdomlib.org","given":""}],"citation-key":"www.wisdomlib.orgGreatChronicleBuddhas2019","file":"C:\\Users\\Stuart\\Zotero\\storage\\HLWFIM4G\\the-great-chronicle-of-buddhas.html","issued":{"date-parts":[["2019",8,25]]},"language":"en","title":"The Great Chronicle of Buddhas","type":"webpage","URL":"https://www.wisdomlib.org/buddhism/book/the-great-chronicle-of-buddhas"}
]
