{
    "Document" : "The Connected Discourses of the Buddha",
    "Author" : "Bhikkhu Bodhi",
    "Section" : "II. The Book of Causation (Nidānavagga)",
    "SubSection" : "Introduction",
    "Title" : "12. Nidānasaṁyutta",
    "Quote": "<p>The Nidānasaṃyutta collects into one chapter of nine vaggas ninety-three short suttas concerned with dependent origination (paṭicca-samupp̄da). This chapter might have even been named the Paṭicca- samuppādasaṃyutta, but the compilers of the canon must have considered such a title too unwieldy and settled upon a more concise designation for it. The word <em>nidāna</em> means cause or source, and is sometimes used in a chain of synonyms that includes <em>hetu</em>, <em>samudaya</em>, and <em>paccaya</em>, “cause, origin, condition” (see DN II 57,27 foll.). The word gives its name to the longest sutta in the Nikāyas on <em>paṭicca-samuppāda</em>, the Mahānidāna Sutta (DN No. 15).</p> <p>Dependent origination is one of the central teachings of early Buddhism, so vital to the teaching as a whole that the Buddha is quoted elsewhere as saying, “One who sees dependent origination sees the Dhamma, and one who sees the Dhamma sees dependent origination” (MN I 190,37–191,2). The ultimate purpose of the teaching on dependent origination is to expose the conditions that sustain the round of rebirths, saṃsāra, so as to show what must be done to gain release from the round. Existence within saṃsāra is suffering and bondage (<em>dukkha</em>), and hence the ending of suffering requires deliverance from the round. To win deliverance is a matter of unravelling the causal pattern that underlies our bondage, a process that begins with understanding the causal pattern itself. It is dependent origination that defines this causal pattern.</p> <p>Dependent origination is usually expounded in a sequence of twelve factors (dv̄adasaṅga) joined into a chain of eleven propositions. In the Nidānasaṃyutta this formula is cited many times. It is expounded in two orders: by way of origination (called <em>anuloma</em> or forward sequence), and by way of cessation (called <em>paṭiloma</em> or reverse sequence). Sometimes the presentation proceeds from the first factor to the last, sometimes it begins at the end and traces the chain of conditions back to the first. Other suttas pick up the chain somewhere in the middle and work either backwards or forwards. We find the bare formula at <strong>12:1</strong>, with formal definitions of the twelve factors in the “analysis of dependent origination” at <strong>12:2</strong>. The whole formula in turn exemplifies an abstract structural principle of conditionality, “When this exists, that comes to be; with the arising of this, that arises. When this does not exist, that does not come to be; with the cessation of this, that ceases” (for references, see <strong>II, n. 14</strong>). This structural principle can be given different applications than those found in the formula of dependent origination, and indeed underlies almost every aspect of the Buddha’s teaching, from his ideas about social reformation to his outline of the path to Nibbāna.</p> <p>To hope to find in the Nidānasaṃyutta a clear explanation of the sequence of conditions, as we might expect from a modern textbook on the subject, is to court disappointment. The formula preserved in the texts is stripped to the bone, perhaps serving as a mnemonic device, and it seems likely that the original expositions on the topic were fleshed out with elaborations that were not recorded in the suttas but were transmitted orally within the lineage of teachers. Because the texts lack a clearcut explanation of the formula, modern interpreters of early Buddhism have sometimes devised capricious theories about its original meaning, theories which assume that the Buddhist tradition itself has muddled up the interpretation of this most basic Buddhist doctrine. To avoid the arbitrariness and wilfulness of personal opinion, it seems more prudent to rely on the method of explanation found in the Buddhist exegetical tradition, which despite minor differences in details is largely the same across the spectrum of early Buddhist schools. Here I will give only a concise summary of the interpretation offered by the Pāli tradition.</p> <p>Because of (i) ignorance (<em>avijjā</em>), lack of direct knowledge of the Four Noble Truths, a person engages in volitional actions, wholesome and unwholesome activities of body, speech, and mind; these are (ii) the volitional formations <em>saṅkhārā</em>), in other words, kamma. The volitional formations sustain consciousness from one life to the next and determine where it re-arises; in this way volitional formations condition (iii) consciousness (<em>viññāṇa</em>). Along with consciousness, beginning with the moment of conception, comes (iv) “name-and-form” (<em>nāmarūpa</em>), the sentient organism with its physical form (<em>rūpa</em>) and its sensitive and cognitive capacities (<em>nāma</em>). The sentient organism is equipped with (v) six sense bases (<em>saḷāyatana</em>), the five physical sense faculties and the mind as organ of cognition. The sense bases allow (vi) contact (<em>phassa</em>) to occur between consciousness and its objects, and contact conditions (vii) feeling (<em>vedanā</em>). Called into play by feeling, (viii) craving (<em>taṇha</em>) arises, and when craving intensifies it gives rise to (ix) clinging (<em>upādāna</em>), tight attachment to the objects of desire through sensuality and wrong views. Impelled by one’s attachments, one again engages in volitional actions pregnant with (x) a new existence (<em>bhava</em>). At death this potential for new existence is actualized in a new life beginning with (xi) birth (<em>jāti</em>) and ending in (xii) aging-and- death ( <em>̄maraṇjarāmaraṇa</em>).</p> <p>From this we can see that the traditional interpretation regards the twelve factors as spread out over a span of three lives, with ignorance and volitional formations pertaining to the past, birth and aging-and-death to the future, and the intermediate factors to the present. The segment from consciousness through feeling is the resultant phase of the present, the phase resulting from past ignorance and kamma; the segment from craving through active existence is the kammically creative phase of the present, leading to renewed existence in the future. Existence is distinguished into two phases: one, called kamma-existence (<em>kammabhava</em>), belongs to the causal phase of the present; the other, called rebirth-existence (<em>upapattibhava</em>), belongs to the resultant phase of the future. The twelve factors are also distributed into three “rounds”: the round of defilements (<em>kilesavaṭṭa</em>) includes ignorance, craving, and clinging; the round of action (<em>kammavaṭṭa</em>) includes volitional formations and kamma-existence; all the other factors belong to the round of results (<em>vipakavaṭṭa</em>). Defilements give rise to defiled actions, actions bring forth results, and results serve as the soil for more defilements. In this way the round of rebirths revolves without discernible beginning.</p> <div class='tablewrap'><table> <thead> <tr> <th>3 Periods</th> <th>12 Factors</th> <th>20 Modes and 4 Groups</th> </tr> </thead> <tbody> <tr> <td>past</td> <td>1. ignorance</td> <td>5 past causes:</td> </tr> <tr> <td></td> <td>2. volitional formations</td> <td>1, 2, 8, 9, 10</td> </tr> <tr> <td>present</td> <td>3. consciousness</td> <td>5 present effects:</td> </tr> <tr> <td></td> <td>4. name-and-form</td> <td>3, 4, 5, 6, 7</td> </tr> <tr> <td></td> <td>5. six sense bases</td> <td></td> </tr> <tr> <td></td> <td>6. contact</td> <td></td> </tr> <tr> <td></td> <td>7. feeling</td> <td></td> </tr> <tr> <td></td> <td>8. craving</td> <td>5 present causes:</td> </tr> <tr> <td></td> <td>9. clinging</td> <td>8, 9, 10, 1, 2</td> </tr> <tr> <td></td> <td>10. existence</td> <td></td> </tr> <tr> <td>future</td> <td>11. birth</td> <td>5 future effects:</td> </tr> <tr> <td></td> <td>12. aging-and-death</td> <td>3, 4, 5, 6, 7</td> </tr> </tbody> <tfoot> <tr> <td colspan='3'>The two roots</td> </tr> <tr> <td colspan='3'>1. Ignorance (from past to present)</td> </tr> <tr> <td colspan='3'>2. Craving (from present to future)</td> </tr> <tr> <td colspan='3'>The three connections</td> </tr> <tr> <td colspan='3'>1. Past causes with present effects (between 2 & 3)</td> </tr> <tr> <td colspan='3'>2. Present effects with present causes (between 7 & 8)</td> </tr> <tr> <td colspan='3'>3. Present causes with future effects (between 10 & 11)</td> </tr> <tr> <td colspan='3'>The three rounds</td> </tr> <tr> <td colspan='3'>1. The round of defilements: 1, 8, 9</td> </tr> <tr> <td colspan='3'>2. The round of kamma: 2, 10 (part)</td> </tr> <tr> <td colspan='3'>3. The round of results: 3, 4, 5, 6, 7, 10 (part), 11, 12</td> </tr> </tfoot> <caption>TABLE 4 Dependent Origination according to the Pāli exegetical tradition</caption> </table></div> <p>This method of dividing up the factors should not be misconstrued to mean that the past, present, and future factors are mutually exclusive. The distribution into three lives is only an expository device which, for the sake of concision, has to resort to abstraction and oversimplification. As many of the suttas in the Nidānasaṃyutta show, in their dynamic operation groups of factors separated in the formula inevitably become intertwined. Thus whenever there is ignorance, then craving and clinging invariably come along; and whenever there is craving and clinging, then ignorance stands behind them. We might regard the twelve factors as composed of two parallel series defining a single process, the conditioned regeneration of saṃsāra from within itself, but doing so from complementary angles. The first series treats ignorance as the root, and shows how ignorance leads to kammic activity (i.e., the volitional formations) and thence to a new existence consisting in the interplay of consciousness and name-and-form. The second series makes craving the root, and shows how craving leads to clinging and kammic activity (i.e., active existence) and thence to the production of a new existence that begins with birth and ends in aging and death. To join the two segments, the factors within name-and-form from which craving arises must be drawn out, and thus we get the three links— the six sense bases, contact, and feeling.</p> <p>The three-life interpretation of dependent origination has sometimes been branded a commentarial invention on the ground that the suttas themselves do not divide the terms up into different lifetimes. However, while it is true that we do not find in the suttas an explicit distribution of the factors into three lives, close examination of the variants on the standard formula lend strong support to the three- life interpretation. One example is <strong>12:19</strong>, where ignorance and craving are first assigned jointly to a past life, giving rise to a new life lived in a conscious body with its six sense bases; and then, in the case of the fool (but not the wise man), ignorance and craving again function as joint causes in the present life to bring about renewed birth and suffering in the future life. A close examination of other variants in this saṃyutta would also establish that the series of terms extends over several lives.</p> <p>The opening vagga calls immediate attention to the importance of dependent origination with a string of suttas showing how the seven Buddhas of the past, ending in “our” Buddha Gotama, attained perfect enlightenment by awakening to dependent origination, the eye-opening discovery that ended their long search for the light of wisdom (<strong>12:4–10</strong>). Later the Buddha gives a more detailed account of his own awakening to dependent origination, where he illustrates his discovery of the Noble Eightfold Path with the beautiful parable of the ancient city (<strong>12:65</strong>). According to <strong>12:20</strong>, the causal connections between the factors operate whether or not Buddhas arise: they are the persistent, stable, invariable laws of actuality. The task of a Tathāgata is to discover them, fathom them thoroughly, and then proclaim them to the world. The invariability of the causal law, and the regularity in the arising of Perfectly Enlightened Buddhas, are thus joined into a single order ultimately identical with the Dhamma itself.</p> <p>Several suttas show that dependent origination served the Buddha as a “teaching by the middle” (<em>majjhena tathāgato dhammaṃ deseti</em>), enabling him to steer clear of the two extreme views about the human condition that have polarized reflective thought through the centuries. One is the metaphysical thesis of eternalism (<em>sassatavāda</em>), which posits a permanent self as the underlying ground of personal existence, a self which, in classical Indian thought, transmigrates from one life to the next while retaining its individual identity. The other extreme is annihilationism (<em>ucchedavāda</em>), which holds that the individual can be reduced to the phenomenal personality and that at death, with the dissolution of the body, the person is entirely cut off and annihilated. Both extremes pose insuperable problems, for the one encourages an obstinate clinging to the conditions out of which suffering arises while the other threatens to undermine ethics and to make suffering inexplicable except as the product of chance. Dependent origination offers a new perspective which rises above the extremes. The teaching shows individual existence to be constituted by a current of conditioned phenomena which is devoid of a metaphysical self, yet which continues from life to life as long as the causes that sustain it remain efficacious. Thereby dependent origination offers a meaningful explanation of the problem of suffering which avoids, on the one hand, the philosophical conundrums posed by the hypothesis of a permanent self, and on the other the dangers of ethical anarchy posed by annihilationism. As long as ignorance and craving remain, the round of rebirths continues on, kamma yields its pleasant and painful fruit, and the great mass of suffering accumulates. With their removal, and only with their removal, can a complete end be made to the whole round of saṃsāric suffering.</p> <p>The most elegant exposition of dependent origination as the “middle teaching” is without doubt the famous Kaccānagotta Sutta (<strong>12:15</strong>), in which the Buddha holds up this principle as an alternative to the extremes of existence and nonexistence. Dependent origination provides the key for understanding the arising of suffering as well as pleasure and pain (<strong>12:17</strong>, <strong>18</strong>; see too <strong>12:24–26</strong>), and again for cutting through a variety of philosophical antinomies adopted by the thinkers of his era (<strong>12:46–48</strong>).</p> <p>Though the twelve-factored formula of dependent origination is the most common expression of the doctrine, the Nidānasaṃyutta introduces a number of little-known variants that help to illuminate the standard version. One is a ten-factored variant in which ignorance and volitional formations are omitted and consciousness and name-and-form become mutually dependent (<strong>12:65</strong>). This is illustrated by the simile of two sheaves of reeds which support each other and collapse when either is withdrawn (<strong>12:67</strong>). An interesting sequence of three texts (<strong>12:38–40</strong>) speaks about the conditions for “the maintenance of consciousness” (<em>viññāṇāssa ṭhitiyā</em>), that is, how consciousness passes on to a new existence. The causes are said to be the underlying tendencies, i.e., ignorance and craving, and “what one intends and plans,” i.e., one’s volitional activities. Once consciousness becomes established, the production of a new existence begins, thus showing that we can proceed directly from consciousness (the usual third factor) to existence (the usual tenth factor).</p> <p>These variants make it plain that the sequence of factors should not be regarded as a linear causal process in which each preceding factor gives rise to its successor through the simple exercise of efficient causality. The relationship among the factors is always one of complex conditionality rather than linear causation. The conditioning function can include such diverse relations as mutuality (when two factors mutually support each other), necessary antecedence (when one factor must be present for another to arise), distal efficiency (as when a remotely past volitional formation generates consciousness in a new life), etc. Moreover, by contemplating a number of variant texts side by side, we can see that at selected points in the series the links loop back in ways that reinforce the complexity of the process. Thus, while consciousness precedes the six sense bases in the usual formula, at <strong>12:43</strong> and <strong>12:44</strong> the six sense bases are shown to be conditions for consciousness. While consciousness normally precedes craving, <strong>12:64</strong> makes craving (with lust and delight) the condition for the continuation of consciousness and volitional formations the condition for existence.</p> <p>The positive and negative sequences of dependent origination are expanded definitions of the second and third of the Four Noble Truths, as shown by the variant at <strong>12:43</strong>. From the six internal and external sense bases, as we just saw, consciousness arises, and this is followed by contact, feeling, and craving, which is then declared to be the origin of suffering; when craving is abandoned, suffering stops. The next sutta, <strong>12:44</strong>, employs a similar pattern to explain the origin and passing away of the world. This reveals dependent origination to be, not a remote and inaccessible metaphysical law, but a process perpetually underpinning our own everyday sensory experience, activated by our responses to the feelings arisen at the six sense bases. As the suttas <strong>12:52–60</strong> show, when attention to the objects of perception is driven by a thirst for gratification, craving is intensified, and this builds up another round of suffering. But when one learns to discern the danger in the objects of clinging, craving ceases, bringing the subsequent factors to a standstill.</p> <p>In several suttas the formula for dependent origination is integrated with another doctrinal paradigm, that of the four nutriments (<em>āhāra</em>). These are the four strong supports for sentient existence, namely, edible food (for the body), contact (for feeling), mental volition (for the production of renewed existence), and consciousness (for name-and-form). The ideas of nutrition and conditionality closely correspond, both implying the contingency and insubstantiality of all phenomena of existence. Hence it is natural for the formula of the four nutriments to be grafted on to an exposition of dependent origination. In <strong>12:12</strong>, in relation to the nutriments, the Buddha repeatedly rejects questions that imply the presence of a substantial subject or agent behind the process of experience. The conditioning factors themselves constitute the ongoing flow of experience, with no need to posit a permanent self as the “someone” at the receiving end of feeling and perception, or at the instigating end of action. <strong>12:63</strong>, entirely devoted to the four nutriments with no explicit mention made of dependent origination, introduces four thought-provoking similes to expose the dangers in the four nutriments and to inspire a sense of revulsion towards the whole process of nutrition. Because at least three of the four nutriments are internal to the sentient organism itself, the teaching of the four nutriments implies, at a very deep level, that sentient existence not only requires nutriment from outside but is itself a self-sustaining process of nutrition.</p> <p>One variant in this saṃyutta stands in a class of its own. This is the short but pithy Upanisā Sutta (<strong>12:23</strong>), which shows that the same principle of conditionality that underlies the movement of saṃsāra also undergirds the path to liberation. Each stage of the path arises with its predecessor as a condition or proximate cause, all the way from the initial act of faith to the final knowledge of deliverance. This presentation of the doctrine has sometimes been called “transcendental dependent origination.”</p> <p>Since the round is propelled by craving, and craving is nurtured by ignorance, to break the forward movement of the series ignorance must be replaced by knowledge. With the removal of ignorance all the factors that flow from it—craving, clinging, and kammic activity—come to a halt, bringing to an end the round of rebirths with all its attendant suffering. From one angle, as is often shown in the Nidānasaṃyutta, ignorance means not knowing the dependently arisen phenomena, their origin, their cessation, and the way to their cessation (<strong>12:14</strong>, <strong>49</strong>, etc.). Thus the ignorance at the head of the causal series, the ignorance which sustains the forward movement of dependent origination, is nothing other than ignorance about dependent origination itself. From this it follows that the knowledge needed to bring dependent origination to a stop is just knowledge of how dependent origination works.</p> <p>Several important suttas in the Nidānasaṃyutta make it clear that dependent origination is not merely an explanatory principle to be accepted on trust but an essential component of the knowledge needed to reach the end of suffering. Often the Buddha states that the connections among the factors are to be directly known, both by way of origination and by way of cessation. They are thus not merely aspects of theory but the content of intuitive insight. To gain this knowledge is to acquire the right view of a noble disciple who has personally seen the truth of the Dhamma and entered the path of a trainee (<em>sekha</em>), one bound to reach the Deathless in seven more lives at most, without ever falling away. Direct knowledge of dependent origination is not the unique mark of the arahant—a widespread misconception—but an achievement already reached by the stream-enterer on making “the breakthrough to the Dhamma” (<em>dhammābhisamaya</em>). The noble disciple’s knowledge of dependent origination has two aspects: one is a direct perception of the relationships between each pair of factors in the present; the other, an inferential knowledge that this fixed order of phenomena holds invariably in the past and future, so that anyone who comprehends dependent origination must comprehend it in exactly the same way that the noble disciple has comprehended it (see <strong>12:33–34</strong>). Once the stream-enterer gains this knowledge, attainment of the final goal is irrevocably assured, as is clear from <strong>12:41</strong> and from the paragraph concluding <strong>12:27</strong>, <strong>28</strong>, and <strong>49–50</strong>.</p> <p>Towards the end of this chapter, in 12:70 we read the story of the wanderer Susı̄ma, who entered the order as a “thief of Dhamma” intending to learn the Buddha’s teaching to gain advantages for his own company of followers. On being subjected to a catechism by the Buddha on the five aggregates and dependent origination, he underwent a genuine change of heart and confessed his evil intentions. This sutta introduces a class of arahants described as “liberated by wisdom” (paññ̄vimuttapaññāvimutta), who have won the final goal by understanding the Dhamma without gaining the supernormal powers or the formless meditations. The sutta also makes it clear that knowledge of the true nature of phenomena, i.e., of the five aggregates and dependent origination, precedes knowledge of Nibbāna.</p><p>The Nidānasaṃyutta closes with two vaggas cast as repetition series. Vagga VIII applies the four- truth template of the “ascetics and brahmins” paradigm to each factor of the standard formula (excluding ignorance, implicitly included as the condition for volitional formations). Vagga IX is an “incorporated repetition series,” because each sutta incorporates all eleven factors along with their conditions into an abbreviated text. It is thus implied that each sutta could be “unpacked” by taking each factor with its condition as the subject of a separate sutta, so that the total number of suttas in the vagga would increase from twelve to 132.</p>"
}