{
    "Document" : "The Connected Discourses of the Buddha",
    "Author" : "Bhikkhu Bodhi",
    "Section" : "General Introduction",
    "SubSection" : "",
    "Title" : "Nāmarūpa",
    "Quote": "<p><span class='quotepno'>47</span>In MLDB, I also had changed Ven. Ñāṇamoli’s “name-and-form” back to his earlier rendering, “mentality-materiality.” In some respects the latter is doctrinally more accurate, but it is also unwieldly, particularly when translating verse, and thus here I return to “name-and-form.” The compound was of pre-Buddhistic origins and is used in the Upaniṣads to denote the <span class='quotepno'>48</span>differentiated manifestation of <em>brahman,</em> the nondual reality. For the sages of the Upaniṣads, <em>nāmarūpa</em> is the manifestation of <em>brahman</em> as multiplicity, apprehended by the senses as diversified appearances or forms, and by thought as diversified names or concepts (the assignment of names and concepts being understood as grounded in objective reality rather than as the end-product of a purely subjective process). The Buddha adopted this expression and invested it with a meaning consonant with his own system. Here it becomes the physical and cognitive sides of individual existence. In the expression <em>bahiddhā nāmarūpa</em>, “external name-and-form” (at II 24,2), we seem to find a vestige of the original meaning—the world as distinguished according to its appearances and names—but divested of the monistic implications.</p><p>In the Buddha’s system, <em>rūpa</em> is defined as the four great elements and the form derived from them. Form is both internal to the person (as the body with its senses) and external (as the physical world). The Nikāyas do not explain derived form (<em>upādāya rūpaṃ</em>), but the Abhidhamma analyses it into some twenty-four kinds of secondary material phenomena which include the sensitive substances of the sense faculties and four of the five sense objects (the tactile object is identified with three of the great elements—earth, heat, and air—which each exhibit tangible properties). Though I render <em>nāma </em>as name, this should not be taken too literally. <em>Nāma</em> is the assemblage of mental factors involved in cognition: feeling, perception, volition, contact, and attention (<em>vedanā</em>, <em>saññā</em>, <em>cetanā</em>, <em>phassa</em>, <em>manasikāra</em>; II 3,34–35). These are called “name” because they contribute to the process of cognition by which objects are subsumed under conceptual designations.</p>    <p>It should be noted that in the Nikāyas, <em>nāmarūpa</em> does not include consciousness (<em>viññāṇa</em>). Consciousness is its condition, and the two are mutually dependent, like two sheaves of reeds leaning one against the other (II 114,17–19). Consciousness can operate only in dependence on a physical body (<em>rūpa</em>) and in conjunction with its constellation of concomitants (<em>nāma</em>); conversely, only when consciousness is present can a compound of material elements function as a sentient body and the mental concomitants participate in cognition. Occasionally the texts speak of the “descent of consciousness” (<em>viññāṇassa avakkanti</em>) <span class='quotepno'>49</span>serving as a condition for name-and-form (II 91, 14–15); this means that the arrival of the current of consciousness from the past existence into the new one is the necessary condition for the arising of a new psychophysical organism at conception. Sometimes too the texts speak of the descent of name-and-form (<em>nāmarūpassa avakkanti</em>, II 66,12, 90,19, 101,13); this denotes the beginning of sentient life when the current of consciousness, arriving from the previous existence, becomes established under the fresh conditions.</p>"
}

