{
    "Document" : "Reading the Buddha's Discourses in Pali: A Practical Guide to the Language of the Ancient Buddhist Canon",
    "Author" : "Bhikkhu Bodhi",
    "Section" : "A Very Brief Overview of Pāli Grammar",
    "SubSection" : "",
    "Title" : "Prefixes",
    "Quote": "<p>The meaning of a simple verb can be altered and enhanced by the addition of prefixes, which are also attached to nouns. The most common prefixes, with the nuances they suggest, are:</p><ul> <li><em>ati</em>, “beyond, above”</li> <li><em>adhi</em>, “toward, up to”</li> <li><em>anu</em>, “along with, after”</li> <li><em>abhi</em>, “toward, facing, over, superior”</li> <li><em>ava</em> or <em>o</em>, “downward”</li> <li><em>ā</em>, “toward”</li> <li><em>ud</em>, “upward”</li> <li><em>upa</em>, “toward”</li> <li><em>dur</em>, “bad, wrong”</li> <li><em>ni</em>, “down, out”</li> <li><em>nī</em> or <em>nir</em>, “away, out”</li> <li><em>pa</em>, “toward”</li> <li><em>paṭi</em> or <em>pati</em>, “back to, opposite, sequential”</li> <li><em>pari</em>, “round, fully”</li> <li><em>vi</em>, “separate, distinctive”</li> <li><em>sam</em>, “together, complete”</li> <li><em>su</em>, “well, easy, very.”<sup>34</sup></li></ul><p>To illustrate how a prefix can modify the meaning of a verb, let us take the root <em>ñā</em>, which yields the verb <em>jānāti</em>, “knows.” The prefixed verb <em>abhijānāti</em> means “knows directly” or “knows in a superior way.” The corresponding noun <em>abhiññā</em> comes to denote superior knowledge. <em>Anujānāti</em>, often used in the context of monastic discipline, means “allows” or “authorizes.” <em>Pajānāti</em> is rendered “understands” or “discerns”; its corresponding noun <em>paññā</em> is usually translated as “wisdom.” <em>Paṭijānāti</em> can mean “acknowledges” or “claims,” and its noun <em>paṭiññā</em> is “a claim.” <em>Parijānāti</em> might be rendered “fully understands,” and its noun <em>pariññā</em>, “full understanding.” <em>Vijānāti</em> suggests “distinctly knows.” Its cognate noun <em>viññāṇa</em>, used for the six types of sensory consciousness, may originally have denoted some kind of distinct knowledge, but that nuance has faded into the background. <em>Sañjānāti</em> (from <em>sam</em> + <em>ñā</em>) has taken on the meaning “perceives.” Its corresponding noun <em>saññā</em> is usually rendered “perception,” but may have originally denoted a syncretic knowledge, a nuance lost by the time of the Nikāyas.</p><p>Two more examples may be briefly considered. The verb <em>gacchati</em> means “goes,” but <em>upagacchati</em> “goes toward, approaches,” <em>āgacchati</em> “comes,” <em>vigacchati</em>, “vanishes,” <em>nigacchati</em>, “undergoes, encounters,” and <em>adhigacchati</em>, “finds, achieves.” The prefixed verb <em>uppajjati</em> means “arises,” but <em>āpajjati</em> means “enters upon, incurs,” <em>paṭipajjati</em> “proceeds, practices,” <em>vipajjati</em> “fails,” and <em>sampajjati</em> “succeeds.”</p><p>The above examples should show that one must be cautious about interpreting words with prefixes. While the meaning that emerges from the addition of the prefix is sometimes obvious (for instance, <em>abhikkamati</em> means “goes forward” and <em>paṭikkamati</em> “comes back”), often one cannot deduce the meaning of a verb simply by adding the nuance of the prefix to the meaning of the basic verb. It is thus advisable always to learn the meaning of a prefixed verb from a dictionary or glossary and to interpret it in context.</p>"
}