[
  {
    "fnNumber": "1",
    "fnHTML": "<p>I have benefited from the kindness of Ven. Bhikkhu Bodhi and Prof. Peter Harvey who both offered their careful comments and invaluable suggestions on a draft version of the present paper. Despite our disagreement on certain issues, the paper is considerably improved as a result of their generosity. My thanks are also due to a number of monks at Bodhinyana Monastery for their proofreading.</p>"
  },
  {
    "fnNumber": "2",
    "fnHTML": "<p>I will provide references for these interpretations during the course of the paper.</p>"
  },
  {
    "fnNumber": "3",
    "fnHTML": "<p>Most of the quotes found in this paper are taken from existing translations (see the bibliography at the end of this paper). Occasionally, where existing translations did not seem satisfactory, I have supplied my own. I have indicated all such instances. I have sometimes supplied Pali words and phrases for clarification.</p>"
  },
  {
    "fnNumber": "4",
    "fnHTML": "<p>With the exception of most of the <span lang='pi'>Khuddaka</span>-<span lang='pi'>Nikāya</span>. I use the terms <span lang='pi'>suttas</span> and <span lang='pi'>Nikāyas</span> throughout this paper to refer to the four main <span lang='pi'>Nikāyas</span> of the Pali Canon, the <span lang='pi'>Vinaya</span>-<span lang='pi'>Piṭaka</span> and some of the works of the <span lang='pi'>Khuddaka</span>-<span lang='pi'>Nikāya</span>, specifically the <span lang='pi'>Udāna</span>, the <span lang='pi'>Itivuttaka</span>, the <span lang='pi'>Dhammapada</span> and the <span lang='pi'>Thera&shy;gāthā</span>. I have also occasionally consulted parallel passages in the Chinese Buddhist Canon.</p>"
  },
  {
    "fnNumber": "5",
    "fnHTML": "<p>See in particular SN 38.1:2.3–2.4 and SN 39.1-15:2.3–2.4, but cf. also SN 43.12/SN 43.13/SN 43.14-43, SN 45.6, SN 45.36 and AN 3.53/AN 3.54.</p>"
  },
  {
    "fnNumber": "6",
    "fnHTML": "<p>This would thus include the actual event of becoming an <span lang='pi'>arahant</span>. As pointed out by <span class='sesame' data-sesame-key='zotref:'>Harvey 1995</span>, p.183, at SN 38.1:2.3–2.4 <span lang='pi'>arahant</span>-ship is explicitly defined as the destruction of lust, hatred and delusion. This shows the close relationship between <span lang='pi'>Nibbāna</span> and <span lang='pi'>arahant</span>-ship in general. Harvey tries to show at some length that <span lang='pi'>Nibbāna</span> here refers to the event of attaining <span lang='pi'>arahant</span>-ship, not an aspect of the general state of <span lang='pi'>arahant</span>-ship. His first argument is that the Pali terminology points to an event rather than an ongoing reality. Without going into detail, it seems to me that the terminology is open to either interpretation, but most likely it refers to both. His second and main argument is based on the fact that <span lang='pi'>Nibbāna</span> is the end of <span lang='pi'>dukkha</span> whereas the <span lang='pi'>arahant</span> still has some <span lang='pi'>dukkha</span> remaining and thus the general state of <span lang='pi'>arahant</span>-ship cannot be called <span lang='pi'>Nibbāna</span>. But <span lang='pi'>Nibbāna</span> at <span lang='pi'>arahant</span>-ship is called <span lang='pi'>Nibbāna</span> ‘with residue remaining’ Iti 44:3.1–3.5, the residue being the experience of ‘what is agreeable and disagreeable … pleasure and pain (<span lang='pi'>dukkha</span>)’. It seems clear enough, therefore, that the presence of a residue of suffering does not bar the absence of lust, hatred and delusion in an <span lang='pi'>arahant</span> from being called <span lang='pi'>Nibbāna</span>.</p>"
  },
  {
    "fnNumber": "7",
    "fnHTML": "<p>The literal meaning of <span lang='pi'>Nibbāna</span> is ‘extinguishment’. (Alternatively, <span lang='pi'>Nibbāna</span> could perhaps be translated as ‘extinction’. However, ‘extinction’ has such negative connotations in English—connotations that obviously do not pertain to <span lang='pi'>Nibbāna</span>—that ‘extinguishment’ seems more appropriate). <span lang='pi'>Nibbāna</span> as the destruction of lust, hatred and delusion is therefore simply the permanent extinguishing of these three defilements. In fact, <span lang='pi'>Nibbāna</span> is a relative term in the <span lang='pi'>suttas</span>, its precise connotation depending on what is being extinguished. At AN 9.47, AN 9.48, AN 9.49, AN 9.50 and AN 9.51 each <span lang='pi'>jhāna</span> and each immaterial attainment is said to be ‘provisional <span lang='pi'>Nibbāna</span> (<span lang='pi'>nib&shy;bān&shy;aṁ</span> … <span lang='pi'>par&shy;iyā&shy;yena</span>)’. ‘Non-provisional <span lang='pi'>Nibbāna</span>’ is reached at <span lang='pi'>arahant</span>-ship, and ‘final <span lang='pi'>Nibbāna</span>’ at the death of the <span lang='pi'>arahant</span> (see below). In each case something is extinguished (either temporarily or permanently): in first <span lang='pi'>jhāna</span> the five hindrances and the five senses are temporarily extinguished, in the second <span lang='pi'>jhāna</span> <span lang='pi'>vitakka</span>-<span lang='pi'>vicāra</span> etc.. At final <span lang='pi'>Nibbāna</span> all five aggregates are permanently extinguished.</p>"
  },
  {
    "fnNumber": "8",
    "fnHTML": "<p>The <span lang='pi'>arahant’s</span> destruction of lust, hatred and delusion is unconditioned, since it is permanent. For this reason <span lang='pi'>Nibbāna</span> is also known as <span lang='pi'>asaṅkhata</span>, ‘not conditioned’.</p>"
  },
  {
    "fnNumber": "9",
    "fnHTML": "<p>Note that my emphasis in this paper is not on final <span lang='pi'>Nibbāna</span> as the event of the death of the <span lang='pi'>arahant</span> but on that which happens beyond the <span lang='pi'>arahant’s</span> death.</p>"
  },
  {
    "fnNumber": "10",
    "fnHTML": "<p>In fact, it seems difficult to find any unambiguous references apart from the one quoted here.</p>"
  },
  {
    "fnNumber": "11",
    "fnHTML": "<p>That it is attainable by all <span lang='pi'>ariyas</span> is the commentarial interpretation. In contrast to this, a verse at AN 3.32 seems to say that this <span lang='pi'>samādhi</span>—the perception in this <span lang='pi'>samādhi</span> is given as ‘This is peaceful, this is sublime, that is … <span lang='pi'>Nibbāna</span>’, but it seems to be equivalent to the one quoted above—is attainable only by <span lang='pi'>ara&shy;hants</span>, i.e. one who ‘has crossed over birth and old age’, <span lang='pi'>atāri</span> <span lang='pi'>so</span> <span lang='pi'>jātijaran</span> <span lang='pi'>ti</span>. Whatever the correct interpretation, the broader argument remains unaffected.</p>"
  },
  {
    "fnNumber": "12",
    "fnHTML": "<p>For instance in the <span lang='pi'>Paramatthadīpanī</span>-<span lang='pi'>ṭīkā</span>: ‘<span lang='pi'>evaṁ</span> <span lang='pi'>suññatādināmaṁ</span> <span lang='pi'>nib&shy;bān&shy;aṁ</span> <span lang='pi'>ārammaṇaṁ</span> <span lang='pi'>katvā</span> <span lang='pi'>pavattāni</span> <span lang='pi'>maggaphalānipi</span> <span lang='pi'>ārammaṇavasenapi</span> <span lang='pi'>suññatādināmaṁ</span> <span lang='pi'>labhati</span>’, ‘Thus having made <span lang='pi'>Nibbāna</span>, which is called “emptiness” etc., the object, the resulting path and fruit obtain the name “emptiness” etc. on account of the object’. It is noteworthy that this statement is found in a modern (19th century) commentarial work. In his translation and explanation of the <span lang='pi'>Abhidhammattha</span> <span lang='pi'>Saṅgaha</span>, in which he refers extensively to the above mentioned <span lang='pi'>ṭīkā</span>, <span class='sesame' data-sesame-key='zotref:'>Bodhi 1993</span>, p.363 states that: ‘the attainment of fruition (<span lang='pi'>phalasamāpatti</span>) is a meditative attainment by which a noble disciple enters into supramundane absorption with <span lang='pi'>Nibbāna</span> as object’.</p><p>It is difficult to ascertain with any precision when the idea of <span lang='pi'>Nibbāna</span> as an object of consciousness first appears in Pali literature. It might be claimed that it appears already in the Canonical Abhidhamma where the <span lang='pi'>asaṅkhatadhātu</span> is included in the <span lang='pi'>dhammāyatana</span> (<a href='https://suttacentral.net/vb2/en/thittila?reference=main/pts&amp;highlight=false#pts-vp-pli72' class='extlink'>Vibh 72</a>). However, the <span lang='pi'>asaṅkhatadhātu</span> is then defined in exactly the same way as in the <span lang='pi'>suttas</span>, namely, as the destruction of lust, hatred and delusion (<a href='https://suttacentral.net/vb2/en/thittila?reference=main/pts&amp;highlight=false#pts-vp-pli73' class='extlink'>Vibh 73</a>). There is no indication that <span lang='pi'>Nibbāna</span> is an ‘existing entity’ which is taken as a direct object of consciousness. Exactly how the commentaries understand <span lang='pi'>Nibbāna</span> is also a moot point. I am not able to discuss this here, since it would be a major study in itself to trace the historical development of how <span lang='pi'>Nibbāna</span> is understood in Pali literature.</p>"
  },
  {
    "fnNumber": "13",
    "fnHTML": "<p><span lang='pi'>Nibbāna</span> cannot simply be classified as a mind object—with the corresponding consciousness being mind-consciousness—since all mind objects and their corresponding objects are said to be impermanent and suffering; see e.g. SN 35.32. Indeed, the Salāyatana-Saṁyutta contains a large number of <span lang='pi'>suttas</span> that directly state that mental phenomena (dhammas) are suffering. These statements often have an almost equational quality. And there is no clear statement anywhere in the <span lang='pi'>suttas</span> that there are any exceptions to this. In fact the six senses together with their six objects are called ‘the all’ (SN 35.23), clearly indicating that there are no further senses or sense objects apart from these. These statements taken together make it impossible, to my mind, to accept the idea of <span lang='pi'>Nibbāna</span> as a mind object cognised by mind-consciousness. (The post-canonical literature, however, sometimes seems to take a different position, see e.g. the Milindapañha, <a href='https://suttacentral.net/mil6.2.5/en/tw_rhysdavids' class='extlink tipref'>Mil 6.2.5</a>).</p>"
  },
  {
    "fnNumber": "14",
    "fnHTML": "<p>Deep states of <span lang='pi'>samādhi</span>, in particular the <span lang='pi'>jhānas</span>, consist of completely stable and uninterrupted perceptions, until one emerges.</p>"
  },
  {
    "fnNumber": "15",
    "fnHTML": "<p>This interpretation hinges on understanding <span lang='pi'>bha&shy;va&shy;ni&shy;ro&shy;dho</span> <span lang='pi'>nib&shy;bān&shy;aṁ</span> to be an equational sentence: ‘the cessation of existence is <span lang='pi'>Nibbāna</span>’. On this reading, the expression is clearly an idea about <span lang='pi'>Nibbāna</span>, not a direct reference to it. If instead one were to translate this phrase as two words in apposition, ‘the cessation of existence, Nibbāna’, then this would be a direct reference to <span lang='pi'>Nibbāna</span> and one would have to conclude that the phrase concerns a direct perception of <span lang='pi'>Nibbāna</span>. There are other suttas (AN 3.32, AN 10.6, AN 11.7, and AN 11.8), however, that speak of the same sort of <span lang='pi'>samādhi</span> but whose interpretation is unambiguous. In these <span lang='pi'>suttas</span> the relevant perception is given as ‘this is peaceful, this is sublime, that is … <span lang='pi'>Nibbāna</span> (<span lang='pi'>etaṁ</span> <span lang='pi'>santaṁ</span>, <span lang='pi'>etaṁ</span> <span lang='pi'>paṇītaṁ</span>, <span lang='pi'>yad</span> <span lang='pi'>idaṁ</span> … <span lang='pi'>nibbānan</span> <span lang='pi'>ti</span>)’. Here the wording is such—i.e. the verb ‘to be’ is required—that there can be no doubt that we are dealing with a sentence not just words in apposition. It seems quite clear, therefore, that this concerns a perception of an idea, an idea about <span lang='pi'>Nibbāna</span>—i.e. ‘this is peaceful, this is sublime’—not a direct experience of <span lang='pi'>Nibbāna</span>. From this it is necessary to conclude that the expression <span lang='pi'>bha&shy;va&shy;ni&shy;ro&shy;dho</span> <span lang='pi'>nib&shy;bān&shy;aṁ</span> should also be understood as a sentence, not just two words in apposition.</p>"
  },
  {
    "fnNumber": "16",
    "fnHTML": "<p>This is equivalent to what the commentaries call <span lang='pi'>phalasamāpatti</span>/<span lang='pi'>phalasamāpatti</span>-<span lang='pi'>samādhi</span>; see Mp V 2, 23 and Mp V 80, 14.</p>"
  },
  {
    "fnNumber": "17",
    "fnHTML": "<p>‘Extinguishment’ being the literal meaning of <span lang='pi'>Nibbāna</span> (see <span class='internalLink' data-target='#footnote7'>footnote 7</span> above).</p>"
  },
  {
    "fnNumber": "18",
    "fnHTML": "<p>See <span class='sesame' data-sesame-key='zotref:'>Harvey 1995</span>, pp.17–19 for a short survey of such attempts, followed by a critique of them. Other than Harvey’s references, there has also been the suggestion that the <span lang='pi'>anattā</span> doctrine is a strategy of spiritual development that is not meant as a metaphysical position on the existence of an <span lang='pi'>attā</span> (<span class='sesame biblioref'>Ṭhānissaro 1993a</span>).</p>"
  },
  {
    "fnNumber": "19",
    "fnHTML": "<p>The translation is based on <a href='https://suttacentral.net/sn12.20/en/bodhi' class='extlink'>Ven. Bhikkhu Bodhi’s translation</a> of a similar passage at SN 12.20.</p>"
  },
  {
    "fnNumber": "20",
    "fnHTML": "<p>See also <span class='sesame biblioref'>Norman 1991</span>, p.207 (p.5 in pdf).</p>"
  },
  {
    "fnNumber": "21",
    "fnHTML": "<p>This does not mean that one may cling to <span lang='pi'>Nibbāna</span>. The <span lang='pi'>pu&shy;thuj&shy;jana</span> by definition knows nothing but the five <span lang='pi'>khan&shy;dhas</span>. Since he does not know what <span lang='pi'>Nibbāna</span> is he cannot possibly cling to it. (He could perhaps cling to some idea of <span lang='pi'>Nibbāna</span>, but such an idea would still be included within the five <span lang='pi'>khan&shy;dhas</span>.) Once one becomes a stream-enterer, i.e. once one understands the <span lang='pi'>Dhamma</span>, one knows that the nature of <span lang='pi'>Nibbāna</span> is such that it cannot be clung to (see the last section of this paper).</p>"
  },
  {
    "fnNumber": "22",
    "fnHTML": "<p>There is no reason to see the denial here of ‘individual existence’ as implying the existence of a universal self or any other non-individual permanent entity.</p>"
  },
  {
    "fnNumber": "23",
    "fnHTML": "<p>See in particular <span class='sesame' data-sesame-key='zotref:'>Harvey 1995</span>, pp.198–214 and <span class='sesame biblioref'>Johansson 1969</span>, p.111. Harvey does not in fact use the words ‘permanent consciousness’ in describing final <span lang='pi'>Nibbāna</span>. Instead, he says final <span lang='pi'>Nibbāna</span> is a ‘stopped discernment’ (<span class='sesame' data-sesame-key='zotref:'>Harvey 1995</span>, p.201; ‘discernment’ being Harvey’s translation of <span lang='pi'>viññāṇa</span>) or ‘consciousness beyond time’ (208). (He also argues that this ‘timeless’ <span lang='pi'>Nibbāna</span> can be periodically experienced by the <span lang='pi'>arahant</span> during life, 208). But the idea that <span lang='pi'>nirodha</span> can be understood as a ‘stopped state’ rather than just ‘cessation’ is not supported by the use of <span lang='pi'>nirodha</span> in the <span lang='pi'>Nikāyas</span>. Wherever its meaning is unambiguous it means ‘ending’, ‘cessation’; there is never any sense that it refers to a ‘state’. To make his point Harvey also employs the double meaning in English of the word ‘stopped’. For him a ‘stopped discernment’ is thus a consciousness that stands still, continuing without change, not a consciousness that has ended. In Pali, however, <span lang='pi'>nirodha</span>/<span lang='pi'>niruddha</span> has no such double meaning, it only means ‘stopped’ as in ‘ceased’ or ‘ended’.</p><p>As for Harvey’s use of the phrase ‘consciousness beyond time’, as opposed to ‘permanent consciousness’, it is difficult to see that it makes any difference. As a general tool of interpretation, it seems clear that the <span lang='pi'>Nikāyas</span> cannot possibly refute every single formulation that constitutes a contradiction to their outlook. In many cases, such as the present one, one has to make reasonable assumptions as to the implications of the <span lang='pi'>suttas</span>’ statements. As far as I can see, a consciousness beyond time would for all practical purposes be the same as a permanent consciousness, since it is change that gives rise to a perception of time. Moreover, since <span lang='pi'>Nibbāna</span> is specifically said to be <span lang='pi'>dhuva</span>, ‘stable’ (SN 43.20), which in the suttas is used as a synonym for <span lang='pi'>nicca</span>, ‘permanent’, the idea of ‘consciousness beyond time’ as opposed to ‘permanent consciousness’ seems to be a red herring.</p>"
  },
  {
    "fnNumber": "24",
    "fnHTML": "<p>See in particular the Pañca Sutta (which is identical to the Anattalakkhaṇa Sutta) at SN 22.59. This does not mean that <span lang='pi'>Nibbāna</span> is a permanent self, since <span lang='pi'>Nibbāna</span> is not a ‘phenomenon’. See the last section of this paper for why this is so.</p>"
  },
  {
    "fnNumber": "25",
    "fnHTML": "<p>Again, since <span lang='pi'>Nibbāna</span> is entirely different from consciousness (or any of the five khandhas), this does not mean that <span lang='pi'>Nibbāna</span> is not <span lang='pi'>anattā</span>.</p>"
  },
  {
    "fnNumber": "26",
    "fnHTML": "<p>Deep states of <span lang='pi'>samādhi</span> will be particularly attractive to grasp as a self because of their qualities of peace, stability, contentment, bliss, etc. If one has not heard or properly understood the Buddha’s teachings, it seems there will be an almost irresistible pull towards seeing these states as one’s true <span lang='pi'>attā</span>.</p><p>An interesting passage in this context is found at DN 15:27.1–32.11. Here the Buddha asks the following semi-rhetorical question: ‘Where nothing at all is felt, could there be any sense of “I am” with reference to that (<span lang='pi'>tattha</span>)?’ (DN 15:30.3). From the subsequent conversation it is clear that the correct answer is ‘no’ and therefore that such a ‘state’ cannot be regarded as a self.</p><p><span class='sesame' data-sesame-key='zotref:'>Harvey 1995</span>, p.31 seems to interpret this to mean that if there is no experience of ‘I am’ at the time one abides in a particular state, i.e. that there is no self-awareness in that state, then that is sufficient to show that that state cannot be regarded as a permanent self. If this were correct, then any deep state of samādhi, during which there is no perception ‘I am’, could also not be taken as a self. Yet, as I have argued above, it is perfectly possible to regard such states as an <span lang='pi'>attā</span> once one emerges from them.</p><p>But the passage at DN 15:27.1–32.11 does not have to be interpreted as Harvey does. Its interpretation hinges on the import of the word <span lang='pi'>tattha</span>, which Harvey translates as ‘there’. But, as is implied in my translation above, <span lang='pi'>tattha</span> frequently has a ‘locative’ sense, meaning ‘in this case’, ‘about this’, ‘with reference to this’. If this is the intended meaning also in the present case, then the passage means there can be no sense of ‘I am’ with reference to that state. In other words, one is incapable of taking that state as a permanent self even after one emerges from it, which is precisely what one would expect of a ‘state’ where nothing at all is felt, where nothing at all is experienced.</p>"
  },
  {
    "fnNumber": "27",
    "fnHTML": "<p>For ‘the underlying tendency to the view and conceit “I am” (<span lang='pi'>asmī</span> <span lang='pi'>ti</span> <span lang='pi'>diṭṭhimānānusayaṁ</span>)’, see MN 9.</p>"
  },
  {
    "fnNumber": "28",
    "fnHTML": "<p>This statement seems to be absolute. No allowance is made for a ‘stopped’ consciousness.</p>"
  },
  {
    "fnNumber": "29",
    "fnHTML": "<p>In other words, at the very least feeling together with some sort of perception, no matter how subtle, would be the object of consciousness. Usually the situation would be much more complex, but feeling and perception would always be present with consciousness. I will discuss passages that may seem to refer to an ‘objectless consciousness’ in the section below on ‘unestablished consciousness’ and in the last part of this paper.</p>"
  },
  {
    "fnNumber": "30",
    "fnHTML": "<p><span lang='pi'>Nibbāna</span> is specifically said to be <span lang='pi'>dhuva</span> at SN 43.20, in direct contrast to how <span lang='pi'>viññāṇa</span> is described here. this seems to rule out any link between final <span lang='pi'>Nibbāna</span> and consciousness.</p>"
  },
  {
    "fnNumber": "31",
    "fnHTML": "<p>It is hard to imagine a statement more explicit and clear than this one that a permanent consciousness does not exist. ‘There is no consciousness that is … stable (<span lang='pi'>dhuva</span>)’ is again in direct contrast to the description of <span lang='pi'>Nibbāna</span> at SN 43.20</p>"
  },
  {
    "fnNumber": "32",
    "fnHTML": "<p>Again, pace Harvey, <span lang='pi'>nirodha</span> means ‘ceased’ in the <span lang='pi'>Nikāyas</span>. There is no place where it unambiguously refers to a (stopped) ‘state’.</p>"
  },
  {
    "fnNumber": "33",
    "fnHTML": "<p><span class='sesame biblioref'>Johansson 1969</span>, p.77 suggests ‘gone to rest’ and ‘gone home’ as translations of <span lang='pi'>attham</span> <span lang='pi'>agamā</span>. But the only meaning in the <span lang='pi'>Nikāyas</span> of <span lang='pi'>attha</span>-<span lang='pi'>gam</span> and its cognate forms is ‘come to an end’. See in particular <span class='sesame biblioref'>CPD</span> which lists ‘disappear’, ‘cease’, ‘destroyed’, ‘gone out of existence’ and ‘annihilated’ and <span class='sesame biblioref'>DP</span> which adds ‘end’. (Though <span lang='pi'>attha</span>-<span lang='pi'>gam</span> is also used for the setting of the sun, the sun doesn’t ‘go home’ or ‘go to rest’; but it certainly ‘disappears’, at least temporarily. If there were any other clear cases where such metaphors were used of the sun, then perhaps ‘go home’ could be accepted as a rendering.)</p>"
  },
  {
    "fnNumber": "34",
    "fnHTML": "<p>This passage describes the final <span lang='pi'>Nibbāna</span> of the <span lang='pi'>arahant</span> Dabba Mallaputta.</p>"
  },
  {
    "fnNumber": "35",
    "fnHTML": "<p>See references below.</p>"
  },
  {
    "fnNumber": "36",
    "fnHTML": "<p>For example in <span class='sesame' data-sesame-key='zotref:'>Harvey 1995</span>, pp.199-201; <span class='sesame biblioref'>Ñāṇamoli 2001</span>, p.1249; <span class='sesame biblioref'>Johansson 1969</span>, p.76.</p><p>Harvey’s translation, ‘non-manifestive’, by which he means that nothing can ‘appear on or in’ this consciousness (<span class='sesame' data-sesame-key='zotref:'>Harvey 1995</span>, p. 206), in my opinion stretches the meaning of <span lang='pi'>ani&shy;das&shy;sana</span> beyond what is reasonable. At the very least such a meaning would require a causative construction and probably something more involved (e.g. ‘the consciousness with which nothing else manifests’), not just the simple adjective. The straightforward meaning of <span lang='pi'>ani&shy;das&shy;sana</span> <span lang='pi'>viññāṇa</span> is that the consciousness itself is non-manifest.</p><p>Harvey supports his understanding by referring to a passage at MN 21:14.8–14.9 where <span lang='pi'>ani&shy;das&shy;sana</span>, together with <span lang='pi'>arūpī</span>, is used to describe space: no picture can be drawn ‘on’ space (<span lang='pi'>ākāsa</span>) since it is <span lang='pi'>ani&shy;das&shy;sana</span> and <span lang='pi'>arūpī</span>. But one cannot deduce the exact meaning of <span lang='pi'>ani&shy;das&shy;sana</span> simply by giving it the meaning best suited to the simile. If this were possible then <span lang='pi'>arūpī</span> would also mean ‘non-manifestive’ (in Harvey’s sense of the word), which it clearly does not. It also seems worth noting that this consciousness must be ‘non-manifest’ with reference to something; that is, it is a relative non-manifestation, not an absolute one. At the very least it is not non-manifest for the person who experiences it.</p>"
  },
  {
    "fnNumber": "37",
    "fnHTML": "<p>Intentionally left blank</p>"
  }
]