[
  {
    "fnNumber": "1",
    "fnHTML": "<p> I have benefited from the kindness of Ven. Bhikkhu Bodhi and Prof. Peter Harvey who both offered their careful comments and invaluable suggestions on a draft version of the present paper. Despite our disagreement on certain issues, the paper is considerably improved as a result of their generosity. My thanks are also due to a number of monks at Bodhinyana Monastery for their proofreading.</p>"
  },
  {
    "fnNumber": "2",
    "fnHTML": "<p> I will provide references for these interpretations during the course of the paper.</p>"
  },
  {
    "fnNumber": "3",
    "fnHTML": "<p> Most of the quotes found in this paper are taken from existing translations (see the bibliography at the end of this paper). Occasionally, where existing translations did not seem satisfactory, I have supplied my own. I have indicated all such instances. I have sometimes supplied Pali words and phrases for clarification.</p>"
  },
  {
    "fnNumber": "4",
    "fnHTML": "<p> With the exception of most of the <span class='sesame'>Khuddaka-Nikāya</span>. I use the terms suttas and Nikāyas throughout this paper to refer to the four main Nikāyas of the Pali Canon, the <span class='sesame'>Vinaya-Piṭaka</span> and some of the works of the <span class='sesame'>Khuddaka-Nikāya</span>, specifically the <span class='sesame'>Udāna</span>, the <span class='sesame'>Itivuttaka</span>, the <span class='sesame'>Dhammapada</span> and the <span class='sesame'>Theragāthā</span>. I have also occasionally consulted parallel passages in the Chinese Buddhist Canon.</p>"
  },
  {
    "fnNumber": "5",
    "fnHTML": "<p> See in particular <span class='sclinktext'>SN&#8239;38.1<span class='scsegments'>:2.3–2.4</span></span> and <span class='sclinktext'>SN&#8239;39.1-15<span class='scsegments'>:2.3–2.4</span></span>, but cf. also <span class='sclinktext'>SN&#8239;43.12</span> / <span class='sclinktext'>SN&#8239;43.13</span> / <span class='sclinktext'>SN&#8239;43.14-43</span>, <span class='sclinktext'>SN&#8239;45.6</span>, <span class='sclinktext'>SN&#8239;45.36</span> and <span class='sclinktext'>AN&#8239;3.53</span> / <span class='sclinktext'>AN&#8239;3.54</span>.</p>"
  },
  {
    "fnNumber": "6",
    "fnHTML": "<p> This would thus include the actual event of becoming an <span lang='pi'>arahant</span>. As pointed out by <span class='sesame' data-sesame-key='zotref:Harvey 2012a'>Harvey 1995</span>, p.183, at <span class='sclinktext'>SN&#8239;38.1<span class='scsegments'>:2.3–2.4</span></span> <span lang='pi'>arahant</span>-ship is explicitly defined as the destruction of lust, hatred and delusion. This shows the close relationship between Nibbāna and <span lang='pi'>arahant</span>-ship in general. Harvey tries to show at some length that Nibbāna here refers to the event of attaining <span lang='pi'>arahant</span>-ship, not an aspect of the general state of <span lang='pi'>arahant</span>-ship. His first argument is that the Pali terminology points to an event rather than an ongoing reality. Without going into detail, it seems to me that the terminology is open to either interpretation, but most likely it refers to both. His second and main argument is based on the fact that Nibbāna is the end of <span lang='pi'>dukkha</span> whereas the <span lang='pi'>arahant</span> still has some <span lang='pi'>dukkha</span> remaining and thus the general state of <span lang='pi'>arahant</span>-ship cannot be called Nibbāna. But Nibbāna at <span lang='pi'>arahant</span>-ship is called Nibbāna ‘with residue remaining’ Iti 44:3.1–3.5, the residue being the experience of ‘what is agreeable and disagreeable … pleasure and pain (<span lang='pi'>dukkha</span>)’. It seems clear enough, therefore, that the presence of a residue of suffering does not bar the absence of lust, hatred and delusion in an <span lang='pi'>arahant</span> from being called Nibbāna.</p>"
  },
  {
    "fnNumber": "7",
    "fnHTML": "<p> The literal meaning of Nibbāna is ‘extinguishment’. (Alternatively, Nibbāna could perhaps be translated as ‘extinction’. However, ‘extinction’ has such negative connotations in English—connotations that obviously do not pertain to Nibbāna—that ‘extinguishment’ seems more appropriate). Nibbāna as the destruction of lust, hatred and delusion is therefore simply the permanent extinguishing of these three defilements. In fact, Nibbāna is a relative term in the suttas, its precise connotation depending on what is being extinguished. At <span class='sclinktext'>AN&#8239;9.47</span>, <span class='sclinktext'>AN&#8239;9.48</span>, <span class='sclinktext'>AN&#8239;9.49</span>, <span class='sclinktext'>AN&#8239;9.50</span> and <span class='sclinktext'>AN&#8239;9.51</span> each jhāna and each immaterial attainment is said to be ‘provisional Nibbāna (<span lang='pi'>nibbānaṁ … pariyāyena</span>)’. ‘Non-provisional Nibbāna’ is reached at <span lang='pi'>arahant</span>-ship, and ‘final Nibbāna’ at the death of the <span lang='pi'>arahant</span> (see below). In each case something is extinguished (either temporarily or permanently): in first jhāna the five hindrances and the five senses are temporarily extinguished, in the second jhāna <span lang='pi'>vitakka</span>-<span lang='pi'>vicāra</span> etc.. At final Nibbāna all five aggregates are permanently extinguished.</p>"
  },
  {
    "fnNumber": "8",
    "fnHTML": "<p> The <span lang='pi'>arahant’s</span> destruction of lust, hatred and delusion is unconditioned, since it is permanent. For this reason Nibbāna is also known as <span lang='pi'>asaṅkhata</span>, ‘not conditioned’.</p>"
  },
  {
    "fnNumber": "9",
    "fnHTML": "<p> Note that my emphasis in this paper is not on final Nibbāna as the event of the death of the <span lang='pi'>arahant</span> but on that which happens beyond the <span lang='pi'>arahant’s</span> death.</p>"
  },
  {
    "fnNumber": "10",
    "fnHTML": "<p> In fact, it seems difficult to find any unambiguous references apart from the one quoted here.</p>"
  },
  {
    "fnNumber": "11",
    "fnHTML": "<p> That it is attainable by all <span lang='pi'>ariyas</span> is the commentarial interpretation. In contrast to this, a verse at <span class='sclinktext'>AN&#8239;3.32</span> seems to say that this <span lang='pi'>samādhi</span>—the perception in this <span lang='pi'>samādhi</span> is given as ‘This is peaceful, this is sublime, that is … Nibbāna’, but it seems to be equivalent to the one quoted above—is attainable only by <span lang='pi'>ara&shy;hants</span>, i.e. one who ‘has crossed over birth and old age’, <span lang='pi'>atāri</span> <span lang='pi'>so</span> <span lang='pi'>jātijaran</span> <span lang='pi'>ti</span>. Whatever the correct interpretation, the broader argument remains unaffected.</p>"
  },
  {
    "fnNumber": "12",
    "fnHTML": "<p> For instance in the <span lang='pi'>Paramatthadīpanī-ṭīkā: ‘evaṁ suññatādināmaṁ nibbānaṁ ārammaṇaṁ katvā pavattāni maggaphalānipi ārammaṇavasenapi suññatādināmaṁ labhati</span>’, ‘Thus having made Nibbāna, which is called “emptiness” etc., the object, the resulting path and fruit obtain the name “emptiness” etc. on account of the object’. It is noteworthy that this statement is found in a modern (19th century) commentarial work. In his translation and explanation of the <span class='sesame'>Abhidhammattha Saṅgaha</span>, in which he refers extensively to the above mentioned <span lang='pi'>ṭīkā</span>, <span class='sesame' data-sesame-key='zotref:Bodhi 2007a'>Bodhi 1993</span>, p.363 states that: ‘the attainment of fruition (<span lang='pi'>phalasamāpatti</span>) is a meditative attainment by which a noble disciple enters into supramundane absorption with Nibbāna as object’.</p><p>It is difficult to ascertain with any precision when the idea of Nibbāna as an object of consciousness first appears in Pali literature. It might be claimed that it appears already in the Canonical <span class='sesame'>Abhidhamma</span> where the <span lang='pi'>asaṅkhatadhātu</span> is included in the <span lang='pi'>dhammāyatana</span> (<a href='https://suttacentral.net/vb2/en/thittila?reference=main/pts&amp;highlight=false#pts-vp-pli72' class='extlink'>Vibh 72</a>). However, the <span lang='pi'>asaṅkhatadhātu</span> is then defined in exactly the same way as in the suttas, namely, as the destruction of lust, hatred and delusion (<a href='https://suttacentral.net/vb2/en/thittila?reference=main/pts&amp;highlight=false#pts-vp-pli73' class='extlink'>Vibh 73</a>). There is no indication that Nibbāna is an ‘existing entity’ which is taken as a direct object of consciousness. Exactly how the commentaries understand Nibbāna is also a moot point. I am not able to discuss this here, since it would be a major study in itself to trace the historical development of how Nibbāna is understood in Pali literature.</p>"
  },
  {
    "fnNumber": "13",
    "fnHTML": "<p> Nibbāna cannot simply be classified as a mind object—with the corresponding consciousness being mind-consciousness—since all mind objects and their corresponding objects are said to be impermanent and suffering; see e.g. <span class='sclinktext'>SN&#8239;35.32</span>. Indeed, the <span class='sesame'>Salāyatana-Saṁyutta</span> contains a large number of suttas that directly state that mental phenomena (dhammas) are suffering. These statements often have an almost equational quality. And there is no clear statement anywhere in the suttas that there are any exceptions to this. In fact the six senses together with their six objects are called ‘the all’ (<span class='sclinktext'>SN&#8239;35.23</span>), clearly indicating that there are no further senses or sense objects apart from these. These statements taken together make it impossible, to my mind, to accept the idea of Nibbāna as a mind object cognised by mind-consciousness. (The post-canonical literature, however, sometimes seems to take a different position, see e.g. the <span data-sesame-key='super-blurbs:mil' class='sesame'>Milindapañha</span>, <a href='https://suttacentral.net/mil6.2.5/en/tw_rhysdavids' class='extlink tipref'>Mil 6.2.5</a>).</p>"
  },
  {
    "fnNumber": "14",
    "fnHTML": "<p> Deep states of <span lang='pi'>samādhi</span>, in particular the jhānas, consist of completely stable and uninterrupted perceptions, until one emerges.</p>"
  },
  {
    "fnNumber": "15",
    "fnHTML": "<p> This interpretation hinges on understanding <span lang='pi'>bhavanirodho nibbānaṁ</span> to be an equational sentence: ‘the cessation of existence is Nibbāna’. On this reading, the expression is clearly an idea about Nibbāna, not a direct reference to it. If instead one were to translate this phrase as two words in apposition, ‘the cessation of existence, Nibbāna’, then this would be a direct reference to Nibbāna and one would have to conclude that the phrase concerns a direct perception of Nibbāna. There are other suttas (<span class='sclinktext'>AN&#8239;3.32</span>, <span class='sclinktext'>AN&#8239;10.6</span>, <span class='sclinktext'>AN&#8239;11.7</span>, and <span class='sclinktext'>AN&#8239;11.8</span>), however, that speak of the same sort of <span lang='pi'>samādhi</span> but whose interpretation is unambiguous. In these suttas the relevant perception is given as ‘this is peaceful, this is sublime, that is … Nibbāna (<span lang='pi'>etaṁ santaṁ, etaṁ paṇītaṁ, yad idaṁ … nibbānan ti</span>)’. Here the wording is such—i.e. the verb ‘to be’ is required—that there can be no doubt that we are dealing with a sentence not just words in apposition. It seems quite clear, therefore, that this concerns a perception of an idea, an idea about Nibbāna—i.e. ‘this is peaceful, this is sublime’—not a direct experience of Nibbāna. From this it is necessary to conclude that the expression <span lang='pi'>bhavanirodho nibbānaṁ</span> should also be understood as a sentence, not just two words in apposition.</p>"
  },
  {
    "fnNumber": "16",
    "fnHTML": "<p> This is equivalent to what the commentaries call <span lang='pi'>phalasamāpatti</span>/<span lang='pi'>phalasamāpatti-samādhi</span>; see <span class='sesame'>Manorathapūranī</span>—Mp V 2, 23 and Mp V 80, 14.</p>"
  },
  {
    "fnNumber": "17",
    "fnHTML": "<p> ‘Extinguishment’ being the literal meaning of Nibbāna (see <span class='internalLink' data-target='#footnote7'>footnote 7</span> above).</p>"
  },
  {
    "fnNumber": "18",
    "fnHTML": "<p> See <span class='sesame' data-sesame-key='zotref:Harvey 2012a'>Harvey 1995</span>, pp.17–19 for a short survey of such attempts, followed by a critique of them. Other than Harvey’s references, there has also been the suggestion that the <span lang='pi'>anattā</span> doctrine is a strategy of spiritual development that is not meant as a metaphysical position on the existence of an <span lang='pi'>attā</span> (<span class='sesame' data-sesame-key='zotref:Ṭhānissaro 1993a'>Ṭhānissaro 1993a</span>).</p>"
  },
  {
    "fnNumber": "19",
    "fnHTML": "<p> The translation is based on <a href='https://suttacentral.net/sn12.20/en/bodhi' class='extlink'>Ven. Bhikkhu Bodhi’s translation</a> of a similar passage at <span class='sclinktext'>SN&#8239;12.20</span>.</p>"
  },
  {
    "fnNumber": "20",
    "fnHTML": "<p> See also <span class='sesame' data-sesame-key='zotref:NormanKR 1981a'>Norman 1981</span>, p.207 (p.5 in pdf).</p>"
  },
  {
    "fnNumber": "21",
    "fnHTML": "<p> This does not mean that one may cling to Nibbāna. The <span lang='pi'>pu&shy;thuj&shy;jana</span> by definition knows nothing but the five <span lang='pi'>khan&shy;dhas</span>. Since he does not know what Nibbāna is he cannot possibly cling to it. (He could perhaps cling to some idea of Nibbāna, but such an idea would still be included within the five <span lang='pi'>khan&shy;dhas</span>.) Once one becomes a stream-enterer, i.e. once one understands the Dhamma, one knows that the nature of Nibbāna is such that it cannot be clung to (see the last section of this paper).</p>"
  },
  {
    "fnNumber": "22",
    "fnHTML": "<p> There is no reason to see the denial here of ‘individual existence’ as implying the existence of a universal self or any other non-individual permanent entity.</p>"
  },
  {
    "fnNumber": "23",
    "fnHTML": "<p> See in particular <span class='sesame' data-sesame-key='zotref:Harvey 2012a'>Harvey 1995</span>, pp.198–214 and <span class='sesame' data-sesame-key='zotref:Johansson 1969a'>Johansson 1969</span>, p.111. Harvey does not in fact use the words ‘permanent consciousness’ in describing final Nibbāna. Instead, he says final Nibbāna is a ‘stopped discernment’ (<span class='sesame' data-sesame-key='zotref:Harvey 2012a'>Harvey 1995</span>, p.201; ‘discernment’ being Harvey’s translation of <span lang='pi'>viññāṇa</span>) or ‘consciousness beyond time’ (p.208). (He also argues that this ‘timeless’ Nibbāna can be periodically experienced by the <span lang='pi'>arahant</span> during life, p.208). But the idea that <span lang='pi'>nirodha</span> can be understood as a ‘stopped state’ rather than just ‘cessation’ is not supported by the use of <span lang='pi'>nirodha</span> in the Nikāyas. Wherever its meaning is unambiguous it means ‘ending’, ‘cessation’; there is never any sense that it refers to a ‘state’. To make his point Harvey also employs the double meaning in English of the word ‘stopped’. For him a ‘stopped discernment’ is thus a consciousness that stands still, continuing without change, not a consciousness that has ended. In Pali, however, <span lang='pi'>nirodha</span>/<span lang='pi'>niruddha</span> has no such double meaning, it only means ‘stopped’ as in ‘ceased’ or ‘ended’.</p><p>As for Harvey’s use of the phrase ‘consciousness beyond time’, as opposed to ‘permanent consciousness’, it is difficult to see that it makes any difference. As a general tool of interpretation, it seems clear that the Nikāyas cannot possibly refute every single formulation that constitutes a contradiction to their outlook. In many cases, such as the present one, one has to make reasonable assumptions as to the implications of the suttas’ statements. As far as I can see, a consciousness beyond time would for all practical purposes be the same as a permanent consciousness, since it is change that gives rise to a perception of time. Moreover, since Nibbāna is specifically said to be <span lang='pi'>dhuva</span>, ‘stable’ (<span class='sclinktext'>SN&#8239;43.20</span>), which in the suttas is used as a synonym for <span lang='pi'>nicca</span>, ‘permanent’, the idea of ‘consciousness beyond time’ as opposed to ‘permanent consciousness’ seems to be a red herring.</p>"
  },
  {
    "fnNumber": "24",
    "fnHTML": "<p> See in particular the <span class='sesame'>Pañca Sutta</span> (which is identical to the <span class='sesame'>Anattalakkhaṇa Sutta</span>) at <span class='sclinktext'>SN&#8239;22.59</span>. This does not mean that Nibbāna is a permanent self, since Nibbāna is not a ‘phenomenon’. See the last section of this paper for why this is so.</p>"
  },
  {
    "fnNumber": "25",
    "fnHTML": "<p> Again, since Nibbāna is entirely different from consciousness (or any of the five khandhas), this does not mean that Nibbāna is not <span lang='pi'>anattā</span>.</p>"
  },
  {
    "fnNumber": "26",
    "fnHTML": "<p> Deep states of <span lang='pi'>samādhi</span> will be particularly attractive to grasp as a self because of their qualities of peace, stability, contentment, bliss, etc. If one has not heard or properly understood the Buddha’s teachings, it seems there will be an almost irresistible pull towards seeing these states as one’s true <span lang='pi'>attā</span>.</p><p>An interesting passage in this context is found at <span class='sclinktext'>DN&#8239;15<span class='scsegments'>:27.1–32.11</span></span>. Here the Buddha asks the following semi-rhetorical question: ‘Where nothing at all is felt, could there be any sense of “I am” with reference to that (<span lang='pi'>tattha</span>)?’ (DN 15:30.3). From the subsequent conversation it is clear that the correct answer is ‘no’ and therefore that such a ‘state’ cannot be regarded as a self.</p><p><span class='sesame' data-sesame-key='zotref:Harvey 2012a'>Harvey 1995</span>, p.31 seems to interpret this to mean that if there is no experience of ‘I am’ at the time one abides in a particular state, i.e. that there is no self-awareness in that state, then that is sufficient to show that that state cannot be regarded as a permanent self. If this were correct, then any deep state of <span lang='pi'>samādhi</span>, during which there is no perception ‘I am’, could also not be taken as a self. Yet, as I have argued above, it is perfectly possible to regard such states as an <span lang='pi'>attā</span> once one emerges from them.</p><p>But the passage at <span class='sclinktext'>DN&#8239;15<span class='scsegments'>:27.1–32.11</span></span> does not have to be interpreted as Harvey does. Its interpretation hinges on the import of the word <span lang='pi'>tattha</span>, which Harvey translates as ‘there’. But, as is implied in my translation above, <span lang='pi'>tattha</span> frequently has a ‘locative’ sense, meaning ‘in this case’, ‘about this’, ‘with reference to this’. If this is the intended meaning also in the present case, then the passage means there can be no sense of ‘I am’ with reference to that state. In other words, one is incapable of taking that state as a permanent self even after one emerges from it, which is precisely what one would expect of a ‘state’ where nothing at all is felt, where nothing at all is experienced.</p>"
  },
  {
    "fnNumber": "27",
    "fnHTML": "<p> For ‘the underlying tendency to the view and conceit “I am” (<span lang='pi'>asmī ti diṭṭhimānānusayaṁ</span>)’, see <span class='sclinktext'>MN&#8239;9</span>.</p>"
  },
  {
    "fnNumber": "28",
    "fnHTML": "<p> This statement seems to be absolute. No allowance is made for a ‘stopped’ consciousness.</p>"
  },
  {
    "fnNumber": "29",
    "fnHTML": "<p> In other words, at the very least feeling together with some sort of perception, no matter how subtle, would be the object of consciousness. Usually the situation would be much more complex, but feeling and perception would always be present with consciousness. I will discuss passages that may seem to refer to an ‘objectless consciousness’ in the section below on ‘unestablished consciousness’ and in the last part of this paper.</p>"
  },
  {
    "fnNumber": "30",
    "fnHTML": "<p> Nibbāna is specifically said to be <span lang='pi'>dhuva</span> at <span class='sclinktext'>SN&#8239;43.20</span>, in direct contrast to how <span lang='pi'>viññāṇa</span> is described here. this seems to rule out any link between final Nibbāna and consciousness.</p>"
  },
  {
    "fnNumber": "31",
    "fnHTML": "<p> It is hard to imagine a statement more explicit and clear than this one that a permanent consciousness does not exist. ‘There is no consciousness that is … stable (<span lang='pi'>dhuva</span>)’ is again in direct contrast to the description of Nibbāna at <span class='sclinktext'>SN&#8239;43.20</span></p>"
  },
  {
    "fnNumber": "32",
    "fnHTML": "<p> Again, pace Harvey, <span lang='pi'>nirodha</span> means ‘ceased’ in the Nikāyas. There is no place where it unambiguously refers to a (stopped) ‘state’.</p>"
  },
  {
    "fnNumber": "33",
    "fnHTML": "<p> <span class='sesame' data-sesame-key='zotref:Johansson 1969a'>Johansson 1969</span>, p.77 suggests ‘gone to rest’ and ‘gone home’ as translations of <span lang='pi'>attham agamā</span>. But the only meaning in the Nikāyas of <span lang='pi'>attha-gam</span> and its cognate forms is ‘come to an end’. See in particular <span class='sesame' data-sesame-key='zotref:Dict-CPD'>CPD</span> which lists ‘disappear’, ‘cease’, ‘destroyed’, ‘gone out of existence’ and ‘annihilated’ and <span class='sesame' data-sesame-key='zotref:Dict-DOP'>DP</span> which adds ‘end’. (Though <span lang='pi'>attha</span>-<span lang='pi'>gam</span> is also used for the setting of the sun, the sun doesn’t ‘go home’ or ‘go to rest’; but it certainly ‘disappears’, at least temporarily. If there were any other clear cases where such metaphors were used of the sun, then perhaps ‘go home’ could be accepted as a rendering.)</p>"
  },
  {
    "fnNumber": "34",
    "fnHTML": "<p> This passage describes the final Nibbāna of the <span lang='pi'>arahant</span> Dabba Mallaputta.</p>"
  },
  {
    "fnNumber": "35",
    "fnHTML": "<p> See references below.</p>"
  },
  {
    "fnNumber": "36",
    "fnHTML": "<p> For example in <span class='sesame' data-sesame-key='zotref:Harvey 2012a'>Harvey 1995</span>, pp.199-201; <span class='sesame' data-sesame-key='zotref:Bodhi 1995a'>Ñāṇamoli 2001</span>, p.1249; <span class='sesame' data-sesame-key='zotref:Johansson 1969a'>Johansson 1969</span>, p.76.</p><p>Harvey’s translation, ‘non-manifestive’, by which he means that nothing can ‘appear on or in’ this consciousness (<span class='sesame' data-sesame-key='zotref:Harvey 2012a'>Harvey 1995</span>, p. 206), in my opinion stretches the meaning of <span lang='pi'>ani&shy;das&shy;sana</span> beyond what is reasonable. At the very least such a meaning would require a causative construction and probably something more involved (e.g. ‘the consciousness with which nothing else manifests’), not just the simple adjective. The straightforward meaning of <span lang='pi'>anidassana viññāṇa</span> is that the consciousness itself is non-manifest.</p><p>Harvey supports his understanding by referring to a passage at MN 21:14.8–14.9 where <span lang='pi'>ani&shy;das&shy;sana</span>, together with <span lang='pi'>arūpī</span>, is used to describe space: no picture can be drawn ‘on’ space (<span lang='pi'>ākāsa</span>) since it is <span lang='pi'>ani&shy;das&shy;sana</span> and <span lang='pi'>arūpī</span>. But one cannot deduce the exact meaning of <span lang='pi'>ani&shy;das&shy;sana</span> simply by giving it the meaning best suited to the simile. If this were possible then <span lang='pi'>arūpī</span> would also mean ‘non-manifestive’ (in Harvey’s sense of the word), which it clearly does not. It also seems worth noting that this consciousness must be ‘non-manifest’ with reference to something; that is, it is a relative non-manifestation, not an absolute one. At the very least it is not non-manifest for the person who experiences it.</p>"
  },
  {
    "fnNumber": "37",
    "fnHTML": "<p> Intentionally left blank</p>"
  },
  {
    "fnNumber": "38",
    "fnHTML": "<p> Although the PTS version at DN 11:85.11–85.27 has the reading <span lang='pi'>pahaṁ</span>, I understand the correct reading here to be <span lang='pi'>pabhaṁ</span>. The reading <span lang='pi'>pahaṁ</span> seems to be unique to the Sinhalese tradition and is explained by <span class='sesame' data-sesame-key='zotref:NormanKR 1992b'>Norman 1992</span>, p.189 as likely ‘to be an error in the Sinhalese scribal tradition, where <span lang='pi'>ha</span> and <span lang='pi'>bha</span> are very similar and easily confused’. Moreover, the reading <span lang='pi'>pabhaṁ</span> also seems to be the basis for the Chinese version of this sutta, which has a reading meaning ‘shining’ (T I 102c17).</p>"
  },
  {
    "fnNumber": "39",
    "fnHTML": "<p> <span lang='pi'>Kattha āpo ca paṭhavī tejo vāyo na gādhati<br>Kattha dīghañ ca rassañ ca aṇuṁ thūlaṁ subhāsubhaṁ,<br>Kattha nāmañ ca rūpañ ca asesaṁ uparujjhatī ti<br>Tatra veyyākaraṇaṁ bhavati:<br>Viññāṇaṁ anidassanaṁ anantaṁ sabbato pabhaṁ<br>Ettha āpo ca paṭhavī tejo vāyo na gādhati,<br>Ettha dīghañ ca rassañ ca aṇuṁ thūlaṁ subhāsubhaṁ<br>Ettha nāmañ ca rūpañ ca asesaṁ uparujjhati,<br>Viññāṇassa nirodhena etth’etaṁ uparujjhatī ti.<em><br></em></span> <em>(transl. Brahmāli, based on Walshe 1995).</em></p>"
  },
  {
    "fnNumber": "40",
    "fnHTML": "<p> Again, Harvey calls it a consciousness ‘beyond time’. However, as I have explained above, I cannot see how this in practice is distinguishable from a permanent consciousness. Moreover, Nibbāna is itself called <span lang='pi'>dhuva</span>, ‘permanent’. Harvey also argues that this consciousness can be attained by the <span lang='pi'>arahant</span> while he is still alive.</p>"
  },
  {
    "fnNumber": "41",
    "fnHTML": "<p> Only two seemingly identical occurrences in the entire Pali Canon makes <span lang='pi'>anidassana viññāṇa</span> a marginal concept. This in itself is a sufficient argument to set this expression aside and not allow it to affect our understanding of the relationship between <span lang='pi'>viññāṇa</span> and final Nibbāna.</p><p>Apart from its use with <span lang='pi'>viññāṇa</span>, <span lang='pi'>ani&shy;das&shy;sana</span> is also found on its own, specifically at <span class='sclinktext'>MN&#8239;21<span class='scsegments'>:14.8</span></span>, <span class='sclinktext'>DN&#8239;33<span class='scsegments'>:1.10.76</span></span> and <span class='sclinktext'>SN&#8239;43.22</span>. In the last of these three, <span lang='pi'>ani&shy;das&shy;sana</span> is used as a description of Nibbāna. But this does not mean that the word <span lang='pi'>ani&shy;das&shy;sana</span> is equivalent to Nibbāna. Of the altogether 32 synonyms for Nibbāna found at <span class='sclinktext'>SN&#8239;43.12</span>, <span class='sclinktext'>SN&#8239;43.13</span> &amp; <span class='sclinktext'>SN&#8239;43.14-43</span>, a large number are ordinary everyday words which are much more frequently encountered in contexts other than that of Nibbāna. In other words, just because <span lang='pi'>ani&shy;das&shy;sana</span> is used as a synonym for Nibbāna at <span class='sclinktext'>SN&#8239;43.22</span> does not in any way mean that it is not used with very different connotations elsewhere.</p>"
  },
  {
    "fnNumber": "42",
    "fnHTML": "<p> See <span class='sesame' data-sesame-key='zotref:Warder 1991a'>Warder 1991</span>, p.viii and <span class='sesame' data-sesame-key='zotref:Bodhi 2000a'>Bodhi 2000</span>, p.13. The following passage in <span class='sesame' data-sesame-key='zotref:NormanKR 1996b'>Norman 1996</span>, p.157 commenting on the difficulty in translating Pali verse, is particularly instructive: ‘When John Brough, one of the greatest British Sanskrit scholars of the 20th century, had just spent several years producing his study of the Gāndhārī Dharmapada, and had the whole of the Dhammapada-related literature at his fingertips, he was asked if he would produce a translation of the Dhammapada for the Pali Text Society. He replied: “I cannot. It is too difficult”’.</p><p>It is not immediately clear whether the second passage quoted above, <span class='sclinktext'>MN&#8239;49<span class='scsegments'>:25.1</span></span>, is verse or prose: Ñāṇamoli 2001 treats it as verse but most Pali versions of the same passage seem to treat it as part of the prose. However, Ven. Bhikkhu Bodhi informs me (private communication) that the passage at <span class='sclinktext'>MN&#8239;49<span class='scsegments'>:25.1</span></span> is in meter and therefore clearly verse.</p>"
  },
  {
    "fnNumber": "43",
    "fnHTML": "<p> Moreover, both of the above passages are spoken to non-monastics (the householder Kevaddha and Baka the Brahmā), neither of whom seems particularly well-versed in the Buddha’s teachings. Generally, at the time of the Buddha it was the monks and nuns who were the experts on the Buddhist doctrine. Most suttas spoken to lay Buddhists are simple and straightforward practical instructions. It seems quite possible, therefore, that the usage here of <span lang='pi'>ani&shy;das&shy;sana</span> is simply evocative, not a precise reference to a specific state.</p>"
  },
  {
    "fnNumber": "44",
    "fnHTML": "<p> i.e. ‘<span lang='pi'>viññāṇaṁ anidassanaṁ</span>’ in the present case.</p>"
  },
  {
    "fnNumber": "45",
    "fnHTML": "<p> The first two immaterial attainments are known respectively as <span lang='pi'>ākāsānañcāyatana</span>, ‘the base of unlimited (<span lang='pi'>ananta</span>) space’, and <span lang='pi'>viññāṇañcāyatana</span>, ‘the base of unlimited (<span lang='pi'>ananta</span>) consciousness’ (e.g. at <span class='sclinktext'>MN&#8239;64<span class='scsegments'>:13.1, 14.1, 15.1</span></span>).</p><p>Moreover, it seems that <span lang='pi'>ananta</span> is never used with mind or consciousness apart from describing states of <span lang='pi'>samādhi</span>. It never seems to be used to describe the ‘normal’ consciousness of the <span lang='pi'>arahant</span>, for example.</p>"
  },
  {
    "fnNumber": "46",
    "fnHTML": "<p> This semantic closeness becomes particularly important with verse. Due to metrical constraints, words which may have slightly different import in prose often become interchangeable in verse.</p>"
  },
  {
    "fnNumber": "47",
    "fnHTML": "<p> E.g. with <span lang='pi'>kasiṇa</span> meditation at <span class='sclinktext'>MN&#8239;77<span class='scsegments'>:23.5, 23.11, 24.2, 24.11</span></span>, and with <span lang='pi'>samādhi</span> more generally at <span class='sclinktext'>AN&#8239;5.45<span class='scsegments'>:2.2–4.1</span></span>.</p>"
  },
  {
    "fnNumber": "48",
    "fnHTML": "<p> Of course, the mind without hindrances could also be a reference to the mind of the <span lang='pi'>arahant</span>, but <span lang='pi'>pab&shy;has&shy;sara</span> does not seem to be used in this sense. See for example <span class='sclinktext'>SN&#8239;46.33</span> and <span class='sclinktext'>AN&#8239;5.23</span>.</p>"
  },
  {
    "fnNumber": "49",
    "fnHTML": "<p> Of the three lines of the first verse, the first and the third line end with present tense indicative verbs. Thus we seem to have two separate sentences, each being a question. Moreover, while the Pali is ambiguous as to whether the response gives one or two answers, the parallel passage in the Chinese Canon (see below) seems to give two.</p><p>It might be objected that the lead-up to the verses at <span class='sclinktext'>DN&#8239;11<span class='scsegments'>:85.11–85.27</span></span> only contains one question. Why would the Buddha reformulate a single question into two? According to <span class='sclinktext'>AN&#8239;4.42<span class='scsegments'>:1.1–1.7</span></span> there are four ways of answering a question, one of which is using analysis. In the present case, the original question clearly has more than one answer (as will become clear below), and thus the Buddha’s reformulation may simply be a response to this fact.</p>"
  },
  {
    "fnNumber": "50",
    "fnHTML": "<p> Note the ‘this’, <span lang='pi'>etaṁ</span>, in the last line of the answer verse. This would seem to refer back to <span lang='pi'>nāmañ ca rūpañ ca</span> of the previous line; that is, these lines are connected. Thus the last line cannot simply be regarded as an ‘add-on’ which does not refer to any of the questions in the question verse.</p>"
  },
  {
    "fnNumber": "51",
    "fnHTML": "<p> Taking this verse in isolation, the most obvious candidate for this would be the immaterial attainments. But the use elsewhere of the phrase ‘where earth, water, fire and air find no footing’ (see in particular <span class='sclinktext'>Ud&#8239;1.10<span class='scsegments'>:14.1–15.4</span></span> and <span class='sclinktext'>SN&#8239;1.27</span>) indicates that it refers to something more profound than the immaterial attainments. It is perhaps a poetic way of expressing a full escape from <span lang='pi'>saṁsāra</span>. See also the discussion below.</p>"
  },
  {
    "fnNumber": "52",
    "fnHTML": "<p> I take ‘long and short, small and great, fair and foul’ to be poetic examples of ‘name-and-form’ and thus to be included within name-and-form. In the suttas name-and-form is usually understood to encompass all phenomena apart from consciousness.</p><p>It is significant that the Chinese version of these verses (at T I 102c, 14–19) supports the above analysis. The question verse of the Chinese is virtually identical with the question verse of the Pali. (In both versions, this verse is the Buddha’s reformulation of the original single question into two questions.) The answer verse is as follows: ‘one should answer (應答): “Consciousness without form (識無形); infinite, self-illuminating (無量自有光); when this ceases then the four great [elements] cease (此滅四大滅); gross, subtle, beautiful, ugly cease (麤細好醜滅滅); therefore name-and-form cease (於此名色滅); consciousness ceases, remainder also ceases (識滅餘亦滅)”‘. Here it is quite clear that we have two answers. The first one is ‘consciousness without form, infinite, self-illuminating’. This would then be the answer to the first question about where the four elements cease or find no footing. Since the second line begins ‘when this ceases …’, ‘this’ presumably referring back to the consciousness without form of the previous line (it is difficult to see what else it might refer to), this must be a second answer. This answer would correspond to the second question, concerning where name and form wholly cease. (Admittedly, the Chinese is a bit confusing here, since it starts the second answer with ‘then the four great elements cease’. I take this mention of the four great elements as simply an elaboration on some of the aspects of name-and-form.) Moreover, it is clear in the Chinese that the ‘consciousness without form’ cannot be a reference to Nibbāna since it ceases together with all other phenomena.</p>"
  },
  {
    "fnNumber": "53",
    "fnHTML": "<p> If, on the other hand, ‘all’ is not to be regarded as equivalent to <span lang='pi'>saṁsāra</span> in its entirety, then <span lang='pi'>anidassana viññāṇa</span> potentially becomes correspondingly broader. For example, if ‘all’ here instead only refers to everything within Baka the Brahmā’s knowledge (Baka the Brahmā being the Buddha’s interlocutor in the passage at MN 49:25.1), then anidassana viññāṇa could be a reference to the immaterial attainments.</p>"
  },
  {
    "fnNumber": "54",
    "fnHTML": "<p> This does not require this consciousness to exist ‘outside’ of <span lang='pi'>saṁsāra</span>. rather, it is a type of consciousness which is based on the full understanding of the Dhamma.</p>"
  },
  {
    "fnNumber": "55",
    "fnHTML": "<p> There are, in fact, good reasons for questioning whether this passage should be included in our analysis at all, since the reading in the above <span class='sclinktext'>MN&#8239;49<span class='scsegments'>:25.1</span></span> quote is very uncertain. According to the Burmese version of this verse, it is the Buddha who speaks it, referring to his own special understanding. However, according to the Sri Lankan, the Thai, and the PTS versions of this verse, it is spoken by Baka the Brahmā, referring to his special understanding (see <span class='sesame'>Anālayo 2011</span>, footnote 162 to <span class='sclinktext'>MN&#8239;49</span>). This is obviously highly significant, because if this refers to Baka the Brahmā’s knowledge, then <span lang='pi'>anidassana viññāṇa</span> must refer to a state of consciousness that he can access, i.e. most likely a jhāna state. This interpretation is further reinforced by the Chinese version of this sutta, also according to which it was Brahmā who spoke, see T I 548b, 11. (It is also significant that in the Chinese there is no equivalent of <span lang='pi'>ani&shy;das&shy;sana</span>.) Given this uncertainty in the reading, it would be quite reasonable, maybe even preferable, to leave the passage at <span class='sclinktext'>MN&#8239;49<span class='scsegments'>:25.1</span></span> out of the present discussion. In spite of this, I have decided to incorporate the passage in my argument.</p>"
  },
  {
    "fnNumber": "56",
    "fnHTML": "<p> This may also explain the usage of the term <span lang='pi'>ani&shy;das&shy;sana</span>. According to our analysis, being accessible only to <span lang='pi'>ariyas</span>, <span lang='pi'>anidassana viññāṇa</span> is ‘non-manifest’ (i.e. inaccessible) to all <span lang='pi'>pu&shy;thuj&shy;janas</span>, including the devas of the very highest realms.</p>"
  },
  {
    "fnNumber": "57",
    "fnHTML": "<p> This is the <span lang='pi'>samādhi</span> referred to at <span class='sclinktext'>AN&#8239;3.32</span>, <span class='sclinktext'>AN&#8239;10.6</span>, <span class='sclinktext'>AN&#8239;11.7</span>, and <span class='sclinktext'>AN&#8239;11.8</span>.</p><p>As mentioned in the introduction, and contrary to the view of some, I do not regard this consciousness as taking Nibbāna as its object. Rather, I see this as a <span lang='pi'>samādhi</span> gained through a particular perception that is based on the knowledge of what Nibbāna is.</p>"
  },
  {
    "fnNumber": "58",
    "fnHTML": "<p> Nor would it refer to an <span lang='pi'>ariya’s</span> direct experience of Nibbāna during life: see my discussion of <span lang='pi'>ariya-samādhi</span> in the introduction.</p>"
  },
  {
    "fnNumber": "59",
    "fnHTML": "<p> Harvey also sees this state of consciousness as experienceable by <span lang='pi'>ara&shy;hants</span> during life, but different from their ordinary consciousness (<span class='sesame' data-sesame-key='zotref:Harvey 2012a'>Harvey 1995</span>, 201–203). Here, however, I will focus on the aspect of final Nibbāna.</p>"
  },
  {
    "fnNumber": "60",
    "fnHTML": "<p> I understand this passage to be another way of saying that consciousness is not attached to anything; it does not grasp at anything or take anything up. Because of being unestablished in this way, it does not get established in, i.e. commence, a new existence. That is, the passage concerns the cessation of the source of consciousness. Upon the attainment of <span lang='pi'>arahant</span>-ship, consciousness becomes devoid of the kind of desire that would otherwise have caused the future establishment of consciousness in a new rebirth. for the <span lang='pi'>arahant</span>, the source of consciousness has ceased, but consciousness itself only ceases when he dies.</p>"
  },
  {
    "fnNumber": "61",
    "fnHTML": "<p> See the general discussion on consciousness above.</p>"
  },
  {
    "fnNumber": "62",
    "fnHTML": "<p> The spelling <span lang='pi'>apatiṭṭhitaṁ</span> seems to be an error for <span lang='pi'>appatiṭṭhitaṁ</span>.</p>"
  },
  {
    "fnNumber": "63",
    "fnHTML": "<p> The expression ‘being unagitated, he personally attains Nibbāna’, is a common way in the suttas to describe Nibbāna in this life, i.e. the attainment of <span lang='pi'>arahant</span>-ship as opposed to final Nibbāna. See for instance <span class='sclinktext'>MN&#8239;140<span class='scsegments'>:22.12</span></span>, where Nibbāna is described in similar terms, but final Nibbāna clearly happens later. Also note that in this case consciousness in fact becomes unestablished immediately prior to the attainment of <span lang='pi'>arahant</span>-ship. This strengthens the argument further.</p><p><span lang='pi'>Appatiṭṭhita</span> also recurs at <span class='sclinktext'>Ud&#8239;8.1<span class='scsegments'>:3.1–3.4</span></span> where it seems to qualify a particular ‘state’ (of <span lang='pi'>samādhi</span>, perhaps) of the living <span lang='pi'>arahant</span>. Since it concerns an <span lang='pi'>arahant</span>, his consciousness is by definition <span lang='pi'>appatiṭṭhita</span>, ‘unestablished’, as discussed above. For further discussion of <span class='sclinktext'>Ud&#8239;8.1<span class='scsegments'>:3.1–3.4</span></span> see <span class='internalLink' data-target='#chapter10'>Chapter 10 on Final Nibbāna</span>.</p>"
  },
  {
    "fnNumber": "64",
    "fnHTML": "<p> <span class='sesame' data-sesame-key='zotref:Johansson 1969a'>Johansson 1969</span>, p.131 states that ‘The new, transformed state of <span lang='pi'>citta</span> is Nibbāna …’ He then claims that this <span lang='pi'>citta</span> continues after the death of the <span lang='pi'>arahant</span>: ‘But when an Arahant dies … the “stillness” and “emptiness” of the citta makes it survive, free and anonymous …’ (p.133). Johansson evidently takes a particular state of citta as <span lang='pi'>equivalent</span> to final Nibbāna.</p><p>A similar position seems to be taken in <span class='sesame' data-sesame-key='zotref:Mahã Boowa 1980a'>Mahā Boowa 1980</span>, p.23: ‘the <span lang='pi'>citta</span> by its very nature is <span lang='pi'>amataṁ</span> - Undying …’; ‘Once <span lang='pi'>paññā</span> has totally shattered and cleared the <span lang='pi'>kilesas</span> away, the <span lang='pi'>citta</span> will be transformed into the state of purity … How can it vanish? … this one is the genuine <span lang='pi'>amataṁ</span> (the Undying). Immortal by way of purity … This is the real and true substance or essence which is in the midst of our <span lang='pi'>khandha</span>’ (45); ‘The <span lang='pi'>kilesas</span> can’t destroy the <span lang='pi'>citta</span> … This nature is unassailable, absolute and permanent. It cannot be annihilated’ (76). It must be kept in mind, however, that the teachings given by Thai meditation teachers are often difficult to interpret. There are several reasons for this. Firstly, the idiom of Thai meditation teachers, particularly those associated with the Thai forest tradition, is notoriously idiosyncratic. They rarely use the expressions and words found in the Nikāyas, and if they do, they sometimes give these expressions new meanings. Secondly, the language they use is often not very precise, at least compared with that of the suttas, and thus there are significant problems of interpretation. Thus it is possible that Ven. Ajahn Mahā Boowa may be referring to something other than the English translation appears to show. Still, the translation as it stands is hard to square with the descriptions of Nibbāna and <span lang='pi'>citta</span> in the suttas.</p>"
  },
  {
    "fnNumber": "65",
    "fnHTML": "<p> In the Vinaya-Piṭaka the Buddha typically asks a monk who thinks he may have committed an offence, <span lang='pi'>kiṁcitto</span>, ‘what (was your) intention?’, e.g. at <a href='https://suttacentral.net/pli-tv-bu-vb-pj2/en/brahmali#7.6.8' class='extlink tipref'>Bu Pj 2<span class='scsegments'>:7.6.8</span></a>. <span lang='pi'>Citta</span> seems to mean ‘thought’ in the standard description of thought-reading, e.g. at <span class='sclinktext'>DN&#8239;11<span class='scsegments'>:6.0–7.8</span></span>. For a further sense of the wide use of the term <span lang='pi'>citta</span> see <span class='sesame' data-sesame-key='zotref:Dict-PED'>PED</span>.</p>"
  },
  {
    "fnNumber": "66",
    "fnHTML": "<p> cf. <span class='sesame' data-sesame-key='zotref:Bodhi 2000a'>Bodhi 2000</span>, p.769, n.154.</p>"
  },
  {
    "fnNumber": "67",
    "fnHTML": "<p> The use of <span lang='pi'>citta</span> here, in place of <span lang='pi'>viññāṇa</span>, could perhaps be under the influence of the <span class='sesame'>Abhidhamma</span>. See Ven. Anālayo’s study of the <span class='sesame'>Anupada Sutta</span>, <span class='sclinktext'>MN&#8239;111</span>, in <span class='sesame' data-sesame-key='zotref:Analayo 2011a'>Anālayo 2011</span>.</p>"
  },
  {
    "fnNumber": "68",
    "fnHTML": "<p> ‘<span lang='pi'>Citta</span>’ which is usually translated as ‘mind’ is here translated as ‘thought’ because ‘mind’ does not really fit the context. Perhaps ‘mental state’ would be a better translation.</p>"
  },
  {
    "fnNumber": "69",
    "fnHTML": "<p> It seems clear that <span lang='pi'>citta</span> is often regarded as including other mental factors apart from <span lang='pi'>viññāṇa</span>. See discussion above.</p>"
  },
  {
    "fnNumber": "70",
    "fnHTML": "<p> In both this quote and the one below the singular ‘<span lang='pi'>yaṁ ca kho etaṁ/idaṁ</span>’, ‘and that/this which’, is used. Thus ‘<span lang='pi'>citta</span>’, ‘<span lang='pi'>mano</span>’, and ‘<span lang='pi'>viññāṇa</span>’ refer to the same entity. Also note that Ven. Bhikkhu Bodhi here has translated ‘<span lang='pi'>itipi</span>’ with ‘and’, a translation normally used for ‘<span lang='pi'>ca</span>’. A more literal translation of ‘<span lang='pi'>itipi</span>’ might be ‘also’ or ‘too’: ‘But, bhikkhus, as to that which is called mind, also mentality, also consciousness’. It is significant that this phrase is also found in the Chinese and the Buddhist Hybrid Sanskrit versions of this sutta, cf. respectively T II 81c, 7 and <span class='sesame' data-sesame-key='zotref:TripāṭhīC 1962a'>Tripāṭhī 1962</span>, folio 5 V3.</p>"
  },
  {
    "fnNumber": "71",
    "fnHTML": "<p> Apparently the Tibetan counterpart to this sutta has the equivalent phrase; cf. <span class='sesame' data-sesame-key='zotref:WellerF 1934a'>Weller 1934</span> p.26.</p><p><span class='sclinktext'>MN&#8239;138</span> provides another striking example of <span lang='pi'>viññāṇa</span> and <span lang='pi'>citta</span> being used interchangeably. In the summary at the beginning of the sutta, at MN 138:3.1, <span lang='pi'>viññāṇa</span> is used. Later on in the same sutta, in the section explaining this <span lang='pi'>viññāṇa</span>, <span lang='pi'>citta</span> is used in its place; see <span class='sclinktext'>MN&#8239;138<span class='scsegments'>:12.3, 13.2, 14.2, 15.2, 16.3, 17.2, 18.2, 19.2</span></span>. Further, in the explanation itself, <span lang='pi'>viññāṇa</span> and <span lang='pi'>citta</span> are used together.</p><p>For further references to the interchangeability of <span lang='pi'>viññāṇa</span> and <span lang='pi'>citta</span> in non-Pali Buddhist texts (i.e. primarily Chinese and Sanskrit sources), see <span class='sesame' data-sesame-key='zotref:Analayo 2011a'>Anālayo 2011</span>, footnote 168 to <span class='sclinktext'>MN&#8239;138</span>.</p>"
  },
  {
    "fnNumber": "72",
    "fnHTML": "<p> This passage refers to a wrong view.</p>"
  },
  {
    "fnNumber": "73",
    "fnHTML": "<p> Although I have argued in the above section concerning <span lang='pi'>anidassana viññāṇa</span> that the interpretation of verse is often difficult, this becomes particularly relevant if a verse is interpreted in a way that is contrary to what can be established from canonical prose passages alone. In the present case, the verses merely reinforce what can be established elsewhere.</p>"
  },
  {
    "fnNumber": "74",
    "fnHTML": "<p> The translation is based on the alternative reading ‘<span lang='pi'>vimariyādikataṁ</span>’ in the last line.</p><p>Norman’s translation of ‘<span lang='pi'>vidhamissati</span>’, ‘will blow away’, can probably be improved upon. other possible translations include: ‘will be demolished’ (cf. <span class='sesame' data-sesame-key='zotref:Bodhi 2000a'>Bodhi 2000</span>, p.985), ‘will be ruined’, ‘will fall away’, and ‘will be destroyed’.</p>"
  },
  {
    "fnNumber": "75",
    "fnHTML": "<p> See also <span class='sesame' data-sesame-key='zotref:Analayo 2003a'>Anālayo 2003</span>, p.191, n.39.</p><p>My understanding is that the radiance is always available, it is only matter of overcoming the hindrances. But when the defilements are present the mind is not radiant: otherwise we would be able to observe that radiance, since the mind can only be known through direct experience.</p>"
  },
  {
    "fnNumber": "76",
    "fnHTML": "<p> Whether the other <span lang='pi'>ariyas</span> would know of such a <span lang='pi'>citta</span> seems unclear. See my discussion of <span lang='pi'>ariya-samādhi</span> in the introduction.</p>"
  },
  {
    "fnNumber": "77",
    "fnHTML": "<p> Following Harvey’s approach, one might alternatively call this a ‘timeless (mode of) mind’. I have already discussed why the idea of ‘timelessness’, in my opinion, does not add anything new. See discussion of <span lang='pi'>viññāṇa</span> above.</p>"
  },
  {
    "fnNumber": "78",
    "fnHTML": "<p> Moreover, consciousness (<span lang='pi'>viññāṇa</span>) is also occasionally said to be ‘freed’; see in particular <span class='sclinktext'>SN&#8239;22.53<span class='scsegments'>:3.8–3.9</span></span> &amp; <span class='sclinktext'>SN&#8239;22.54<span class='scsegments'>:4.8–4.9</span></span>, above. If ‘mind’ has a distinct meaning in the phrase ‘the mind is liberated’, then the same would have to be true for <span lang='pi'>viññāṇa</span> in this parallel construction. But we have already seen that the Buddha rejects the idea of <span lang='pi'>viññāṇa</span> as a permanent entity.</p>"
  },
  {
    "fnNumber": "79",
    "fnHTML": "<p> See for example the <span class='sesame'>Asaṅkhata Saṁyutta</span> (<span class='sclinktext'>SN&#8239;43.12</span> / <span class='sclinktext'>SN&#8239;43.13</span> / <span class='sclinktext'>SN&#8239;43.14-43</span>) where there are 32 synonyms for Nibbāna, none of which is <span lang='pi'>citta</span> or any particular state of <span lang='pi'>citta</span>.</p>"
  },
  {
    "fnNumber": "80",
    "fnHTML": "<p> As with <span lang='pi'>viññāṇa</span> and <span lang='pi'>citta</span>, <span lang='pi'>mano</span> and <span lang='pi'>citta</span> have their own more or less distinct spheres of usage in the suttas. Sometimes in the analysis of mental processes the Buddha uses <span lang='pi'>mano</span> to describe the mind in relation to mind-consciousness but not in relation to the other five types of consciousness. In this analysis, <span lang='pi'>mano</span> is the sense through which mind-consciousness arises. <span lang='pi'>Citta</span>, on the other hand, apparently encompasses all six types of consciousness. outside such technical usage, however, <span lang='pi'>mano</span> and <span lang='pi'>citta</span> seem to be used synonymously.</p>"
  },
  {
    "fnNumber": "81",
    "fnHTML": "<p> This passage concerns mind reading.</p>"
  },
  {
    "fnNumber": "82",
    "fnHTML": "<p> Both <span lang='pi'>mano</span> and <span lang='pi'>citta</span> are usually translated as ‘mind’. When the words are used together in the suttas, translators often seem to struggle to find a second English word that also means ‘mind’ (cf. <span class='sesame' data-sesame-key='zotref:Bodhi 2000a'>Bodhi 2000</span>, p.769, n.154).</p><p>The following two examples are also instructive of the close relationship between <span lang='pi'>citta</span> and <span lang='pi'>mano</span>:</p><blockquote>‘A mind of ill-will (<span lang='pi'>byā­panna­citto</span>), mental intention of hate (<span lang='pi'>paduṭ­ṭhamana­saṅkappo</span>)’.</blockquote><p class='tight-right-cite'><em>(transl. Brahmāli)<br></em><span class='sclinktext'>SN&#8239;22.80<span class='scsegments'>:7.2</span></span></p><blockquote>‘An undaunted mind (<span lang='pi'>appatiṭṭhitacitto</span>), a non-dejected mind (<span lang='pi'>adīnamānaso</span>), a mind without ill-will (<span lang='pi'>abyāpannacetaso</span>)’</blockquote><p class='tight-right-cite'><em>(transl. Brahmāli)<br></em><span class='sclinktext'>SN&#8239;46.6<span class='scsegments'>:3.4, 4.7</span></span><br>(cf. <span class='sesame' data-sesame-key='zotref:Bodhi 2000a'>Bodhi 2000</span>, 1904, n.69)</p><p>In the above <span lang='pi'>mano</span> and <span lang='pi'>citta</span>, as well as <span lang='pi'>ceto</span>, seem to be used as synonyms.</p><p>Yet another example of this close relationship is the use of <span lang='pi'>kāya</span> (body), <span lang='pi'>vācā</span> (speech), and <span lang='pi'>mano</span> (mind) to denote the three doors of wholesome and unwholesome actions; occasionally the three doors are denoted as <span lang='pi'>kāya</span>, <span lang='pi'>vācā</span>, and <span lang='pi'>citta</span>; cf. <span class='sclinktext'>SN&#8239;17.9<span class='scsegments'>:1.6</span></span>, <span class='sclinktext'>SN&#8239;20.10<span class='scsegments'>:3.1, 3.9</span></span> and <span class='sclinktext'>SN&#8239;35.127<span class='scsegments'>:5.4, 5.5</span></span>. See also <span class='sclinktext'>Dhp&#8239;348</span> where one finds <span lang='pi'>vimuttamānaso</span> in place of the standard <span lang='pi'>cetovimutti</span>.</p>"
  },
  {
    "fnNumber": "83",
    "fnHTML": "<p> That is, the cessation of the five aggregates. This does not imply anything except the cessation of an entirely impersonal process. This is very different from the annihilation of a permanent entity. See discussion below.</p>"
  },
  {
    "fnNumber": "84",
    "fnHTML": "<p> I use quotes here and below to emphasise that such a ‘state’, or ‘existing entity’, would be completely different from anything that can normally be experienced by human beings. Thus the word ‘state’ is only used for lack of suitable terminology.</p>"
  },
  {
    "fnNumber": "85",
    "fnHTML": "<p> <span class='sesame' data-sesame-key='zotref:Ṭhānissaro 1993a'>Ṭhānissaro 1993b</span> also seems to support the idea that final Nibbāna is more than mere cessation: ‘As for the question of how nibbana is experienced after death, the Buddha says that there is no limit in that experience by which it could be described’. Note in particular the words ‘that experience’, referring to Nibbāna after the death of the <span lang='pi'>arahant</span>.</p>"
  },
  {
    "fnNumber": "86",
    "fnHTML": "<p> Or it may be called <span lang='pi'>asaṅkhatadhātu</span>, <span class='sclinktext'>MN&#8239;115<span class='scsegments'>:9.4</span></span>, or <span lang='pi'>amatadhātu</span>, see <span class='sclinktext'>AN&#8239;6.46<span class='scsegments'>:6.5</span></span>.</p>"
  },
  {
    "fnNumber": "87",
    "fnHTML": "<p> It also ignores the distinction between Nibbāna and final Nibbāna. From the definition of Nibbāna-<span lang='pi'>dhātu</span> at <span class='sclinktext'>SN&#8239;45.7<span class='scsegments'>:2.1–2.6</span></span>, see below, it seems clear that it refers to the state of <span lang='pi'>arahant</span>-ship, not final Nibbāna.</p>"
  },
  {
    "fnNumber": "88",
    "fnHTML": "<p> That is, property in the sense of quality.</p>"
  },
  {
    "fnNumber": "89",
    "fnHTML": "<p> The point of these expressions is presumably simply to point out that there are such things as cessation and renunciation.</p>"
  },
  {
    "fnNumber": "90",
    "fnHTML": "<p> That is, the extinguishment of the defilements of lust, hatred and delusion.</p><p>Moreover, <span lang='pi'>dhātu</span> is used for <span lang='pi'>saññāvedayitanirodha</span>, the cessation of perception and feeling (<span class='sclinktext'>SN&#8239;14.11<span class='scsegments'>:1.4</span></span>). In this case it can clearly not refer to an element as something existing. Rather, it seems to refer to the existence of the possibility of the cessation of the mental <span lang='pi'>khan&shy;dhas</span>.</p><p>The word <span lang='pi'>pada</span>, lit. ‘foot’, has a similarly broad application. For example, the expression <span lang='pi'>amataṁ padaṁ</span> (e.g. at <span class='sclinktext'>AN&#8239;4.48<span class='scsegments'>:4.4</span></span>), which is used as a synonym for Nibbāna, might perhaps be rendered ‘the characteristic of freedom from death’; see <span class='sesame' data-sesame-key='zotref:Dict-PED'>PED</span>. (See discussion of <span class='sclinktext'>Ud&#8239;8.3</span> below for why <span lang='pi'>amataṁ</span> is better rendered as ‘freedom from death’ than ‘the deathless’. See also <span class='sesame' data-sesame-key='zotref:Dict-CPD'>CPD</span>.)</p>"
  },
  {
    "fnNumber": "91",
    "fnHTML": "<p> My translation, based on <span class='sesame' data-sesame-key='zotref:Bodhi 2005a'>Bodhi 2005</span>.</p>"
  },
  {
    "fnNumber": "92",
    "fnHTML": "<p> See introduction. This <span lang='pi'>samādhi</span> is described at <span class='sclinktext'>AN&#8239;10.6</span>, <span class='sclinktext'>AN&#8239;10.7</span> and <span class='sclinktext'>AN&#8239;11.7</span>, <span class='sclinktext'>AN&#8239;11.8</span>. (<span class='sclinktext'>AN&#8239;3.32</span> is also closely related.) The only difference is the absence of ‘neither sun nor moon’ in the AN passages. The sun and moon seem to have been regarded as belonging to ‘another world’ in ancient India (see <span class='sclinktext'>DN&#8239;23<span class='scsegments'>:5.10–5.11</span></span>), and thus the inclusion of this expression does not seem to add anything new. I would regard its addition to <span class='sclinktext'>Ud&#8239;8.1</span> simply as poetic flourish.</p>"
  },
  {
    "fnNumber": "93",
    "fnHTML": "<p> E.g. the immaterial attainments are all called <span lang='pi'>āyatana</span>.</p>"
  },
  {
    "fnNumber": "94",
    "fnHTML": "<p> But note that the <span class='sclinktext'>Ud&#8239;8.1<span class='scsegments'>:3.2</span></span> verse includes the word <span lang='pi'>ṭhitiṁ</span> which is not found in the parallel passages. It seems likely that this refers to the ‘remaining’ in a particular existence, between one’s arising there and one’s subsequent passing away.</p>"
  },
  {
    "fnNumber": "95",
    "fnHTML": "<p> Or an equivalent formulation such as <span lang='pi'>ārammaṇe asati</span>, e.g. at <span class='sclinktext'>SN&#8239;12.38<span class='scsegments'>:3.2</span></span>.</p><p><span class='sesame' data-sesame-key='zotref:Harvey 2012a'>Harvey 1995</span>, p.203 translates <span lang='pi'>anārammaṇa</span> as ‘without object’. However, in relation to <span class='sclinktext'>SN&#8239;12.38</span>, <span class='sclinktext'>SN&#8239;12.39</span> &amp; <span class='sclinktext'>SN&#8239;12.40</span> the commentary glosses the term with <span lang='pi'>paccaya</span>, ‘condition’ or ‘basis’. I cannot see any reason why the commentarial explanation should be rejected. (In the <span class='sesame'>Abhidhamma</span>, however, <span lang='pi'>ārammaṇa-paccaya</span>, seems to have the sense of object-condition.)</p>"
  },
  {
    "fnNumber": "96",
    "fnHTML": "<p> Alternatively, or additionally, it might refer to <span lang='pi'>saññāvedayitanirodha</span> or perhaps even <span lang='pi'>ariya-samādhi</span> itself. This being verse, the ambiguity could be deliberate.</p>"
  },
  {
    "fnNumber": "97",
    "fnHTML": "<p> It is usually further assumed that this positively existing something is final Nibbāna.</p>"
  },
  {
    "fnNumber": "98",
    "fnHTML": "<p> Moreover, by interpreting the Buddha’s reflection to refer to an ‘unborn state’ one is adding a precondition to the Buddha’s search that reduces the sphere of potential solutions. It seems unlikely that the Buddha-to-be would add a stipulation which might stop him from reaching his goal.</p>"
  },
  {
    "fnNumber": "99",
    "fnHTML": "<p> The same argument would hold true of <span lang='pi'>amataṁ</span>, which occurs in the same context at <span class='sclinktext'>MN&#8239;26<span class='scsegments'>:18.1</span></span>, and which therefore should be translated as ‘freedom from death’.</p>"
  },
  {
    "fnNumber": "100",
    "fnHTML": "<p> Either in the sense of attaining <span lang='pi'>arahant</span>-ship or in the sense of final Nibbāna.</p>"
  },
  {
    "fnNumber": "101",
    "fnHTML": "<p> The broader passage reads as follows: ‘If, monks, there were no freedom from what is born … no freedom from what is produced, no escape would be discerned from what is born … from what is produced’. In other words, if there were no such thing as the cessation of the <span lang='pi'>khan&shy;dhas</span>, then no escape from suffering would be possible. See discussion below.</p>"
  },
  {
    "fnNumber": "102",
    "fnHTML": "<p> See discussion in <span class='internalLink' data-target='#footnote7'>footnote 7</span> above.</p>"
  },
  {
    "fnNumber": "103",
    "fnHTML": "<p> In this context it is significant that in the suttas one of the most common synonyms for Nibbāna is <span lang='pi'>nirodha</span>, ‘cessation’.</p>"
  },
  {
    "fnNumber": "104",
    "fnHTML": "<p> <span class='sesame' data-sesame-key='zotref:Harvey 2012a'>Harvey 1995</span>, pp.201–203 also discusses a number of passages in the <span data-sesame-key='super-blurbs:sn' class='sesame'>Saṁyutta Nikāya</span> in support of his interpretation of final Nibbāna (as well as Nibbāna in life, but here the discussion concerns final Nibbāna). All of these suttas revolve around the idea of unestablished consciousness, <span lang='pi'>appatiṭṭhita viññāṇa</span>, which I have already discussed above. Again, the idea of unestablished consciousness quite clearly refers to the living <span lang='pi'>arahant</span> and there seems to be no reason to take it as referring to final Nibbāna.</p>"
  },
  {
    "fnNumber": "105",
    "fnHTML": "<p> Or that it can be experienced by any <span lang='pi'>ariyan</span>. See for instance <span class='sesame' data-sesame-key='zotref:Bodhi 2005a'>Bodhi 2005</span>, p.318 and <span class='sesame' data-sesame-key='zotref:Harvey 2012a'>Harvey 1995</span>, p.210.</p>"
  },
  {
    "fnNumber": "106",
    "fnHTML": "<p> See for instance <span class='sesame' data-sesame-key='zotref:Bodhi 2005a'>Bodhi 2005</span>, p.379: ‘… his mind … focuses upon the deathless element, Nibbāna’. See also <span class='internalLink' data-target='#footnote12'>footnote 12</span> above.</p>"
  },
  {
    "fnNumber": "107",
    "fnHTML": "<p> In the Nikāyas, on a large number of occasions, the six senses, their objects, and the six corresponding classes of consciousness are all said to be impermanent and suffering (e.g. at <span class='sclinktext'>SN&#8239;35.32</span>). No exception is ever explicitly mentioned. clearly Nibbāna cannot be part of this scheme.</p>"
  },
  {
    "fnNumber": "108",
    "fnHTML": "<p> The Concise Oxford Dictionary of Current English, 1995, ninth edition.</p>"
  },
  {
    "fnNumber": "109",
    "fnHTML": "<p> Such as a ‘timeless’ consciousness or a seventh class of consciousness.</p>"
  },
  {
    "fnNumber": "110",
    "fnHTML": "<p> It might be objected that Occam’s razor is primarily applicable to scientific explanations. But scientific explanations are explanations of real and observable phenomena, and from a Buddhist point of view the extinguishment that happens at final Nibbāna is also a real and (in some ways) observable phenomenon.</p>"
  },
  {
    "fnNumber": "111",
    "fnHTML": "<p> And if, as suggested above, such a ‘state’ of final Nibbāna cannot be experienced even by <span lang='pi'>ara&shy;hants</span>, the same would be true of all <span lang='pi'>ariyas</span>.</p>"
  },
  {
    "fnNumber": "112",
    "fnHTML": "<p> Could such a view of final Nibbāna lead to <span lang='pi'>vi&shy;bha&shy;va&shy;taṇ&shy;hā</span>, a craving for annihilation? Possibly it could. But it seems to me that it is far more common for people to hold an eternalist view than an annihilationist view. Moreover, the Buddha himself considered the annihilationist view superior; see my discussion immediately below. In other words, although ideally one should realise that the Buddha taught neither eternalism nor annihilationism (see next section), it is preferable to err on the side of annihilationism.</p>"
  },
  {
    "fnNumber": "113",
    "fnHTML": "<p> Since the idea that final Nibbāna is an ‘existing entity’ would seem to be closer to eternalism than annihilationism.</p>"
  },
  {
    "fnNumber": "114",
    "fnHTML": "<p> Because annihilationism is ‘the view of outsiders’.</p>"
  },
  {
    "fnNumber": "115",
    "fnHTML": "<p> The words <span lang='pi'>arahant</span> and <span lang='pi'>Tat&shy;hā&shy;gata</span> appear to be used synonymously in this sutta.</p>"
  },
  {
    "fnNumber": "116",
    "fnHTML": "<p> That is, after he has fully penetrated it with insight. He seems to have attained stream-entry while Sāriputta was teaching him.</p>"
  },
  {
    "fnNumber": "117",
    "fnHTML": "<p> See for instance <span class='sclinktext'>SN&#8239;22.33</span>, ‘form … feeling … perception … volitional formations … consciousness is not yours: abandon it. When you have abandoned it that will lead to your welfare and happiness’. The sutta then gives the well-known simile of the grass, sticks and leaves in the Jetavana: just as the monks do not identify with those things, so too they should not identify with the five <span lang='pi'>khan&shy;dhas</span>.</p>"
  },
  {
    "fnNumber": "118",
    "fnHTML": "<p> That is, nothing is annihilated from the <span lang='pi'>arahant’s</span> point of view. once <span lang='pi'>sakkāya-diṭṭhi</span> (seeing a permanent self in the <span lang='pi'>khan&shy;dhas</span>) is abandoned, the perception that an <span lang='pi'>arahant</span> can be annihilated is also abandoned. The death of an <span lang='pi'>arahant</span> is just the end of suffering. This is the point of the <span class='sesame'>Yamaka Sutta</span>, see above.</p>"
  },
  {
    "fnNumber": "119",
    "fnHTML": "<p> <span class='sesame'>Harvey 1995</span>, p.240 states that ‘as … only <span lang='pi'>dukkha</span> ends at the death of an Arahat, the total non-existence of a <span lang='pi'>Tat&shy;hā&shy;gata</span> beyond death seems to be ruled out’. But the point of the <span class='sesame'>Yamaka Sutta</span>, and indeed the suttas taken more broadly, is that there is nothing but <span lang='pi'>dukkha</span> even prior to the death of the <span lang='pi'>arahant</span>. This is how the bhikkhunī Vajirā expresses this:</p><p>This is a heap of sheer formations:</p><blockquote>Here no being is found.<br>…<br>It’s only suffering that comes to be,<br>Suffering that stands and falls away.<br>Nothing but suffering comes to be,<br>Nothing but suffering ceases.</blockquote><p class='tight-right-cite'><span class='sclinktext'>SN&#8239;5.10<span class='scsegments'>:4.3–4.4, 6.1–6.4</span></span><br>(see also: <span class='sclinktext'>SN&#8239;12.15<span class='scsegments'>:2.6</span></span>)</p><p>If everything experienced by an <span lang='pi'>arahant</span>, and indeed all beings, is ultimately <span lang='pi'>dukkha</span>, and all <span lang='pi'>dukkha</span> ceases when an <span lang='pi'>arahant</span> dies, then—even without any further sutta evidence—any view of final Nibbāna existing in some sense is at the very least superfluous, but more likely misleading.</p>"
  },
  {
    "fnNumber": "120",
    "fnHTML": "<p> Since this is the culmination of a long list of pleasures, each in turn superior to the preceding one, the implication is that this is the highest.</p>"
  },
  {
    "fnNumber": "121",
    "fnHTML": "<p> How the cessation of all feelings can be considered the highest ‘pleasure’ is explained at <span class='sclinktext'>AN&#8239;9.34</span> and elsewhere.</p>"
  },
  {
    "fnNumber": "122",
    "fnHTML": "<p> This is implied by the suttas, since it is <span lang='pi'>sakkāya-diṭthi</span> that is responsible for the sense of permanence.</p>"
  },
  {
    "fnNumber": "123",
    "fnHTML": "<p> It is not clear whether Mahā-Koṭṭhita himself is caught up in <span lang='pi'>sakkāya-diṭṭhi</span>, whether he is testing Sāriputta or whether he is asking the questions for the benefit of others who are present. (According to the commentary the last of these is the correct explanation).</p><p>Concern about the nature of final Nibbāna is essentially the same as speculation about the nature of the Tathāgata after death. In the following quote it is said that such speculation is a result of <span lang='pi'>sakkāya-diṭṭhi</span>, the view of personal identity, and that with the abandonment of <span lang='pi'>sakkāya-diṭṭhi</span> such speculation is also abandoned:</p><blockquote>‘What, Master Gotama, is the cause and reason why, when wanderers of other sects are asked such questions, they give such answers as: … “the <span lang='pi'>Tat&shy;hā&shy;gata</span> exists after death” or “the <span lang='pi'>Tat&shy;hā&shy;gata</span> does not exists after death” … And what is the cause and reason why, when Master Gotama is asked such questions, he does not give such answers?’</blockquote><blockquote>‘Vaccha, wanderers of other sects regard form as self, or self as possessing form, or form as in self, or self as in form. They regard feeling as self … perception as self … volitional formations as self … consciousness as self, or self as possessing consciousness, or consciousness as in self, or self as in consciousness. Therefore, when the wanderers of other sects are asked such questions, they give such answers as: … “the <span lang='pi'>Tat&shy;hā&shy;gata</span> exists after death” or “the <span lang='pi'>Tat&shy;hā&shy;gata</span> does not exists after death” … But, Vaccha, the <span lang='pi'>Tat&shy;hā&shy;gata</span>, the <span lang='pi'>arahant</span>, the Perfectly enlightened one, does not regard form as self … self as in consciousness. therefore, when the <span lang='pi'>Tat&shy;hā&shy;gata</span> is asked such questions, he does not give such answers.’.</blockquote><p class='tight-right-cite'><span class='sclinktext'>SN&#8239;44.8<span class='scsegments'>:2.1–3.16</span></span></p><p>The above taking of a self in relation to the five aggregates is the definition of <span lang='pi'>sakkāya-diṭṭhi</span>; see <span class='sclinktext'>MN&#8239;44<span class='scsegments'>:7.1–7.8</span></span>.</p>"
  },
  {
    "fnNumber": "124",
    "fnHTML": "<p> This does not mean that one may not have a legitimate discussion on the nature of final Nibbāna, only that one has to be very careful not to be ‘taken in’ by <span lang='pi'>sakkāya-diṭṭhi</span>. Indeed, one should keep in mind that no matter how hard one tries, there will always be a minimum degree of distortion of reality until <span lang='pi'>sakkāya-diṭṭhi</span> is abandoned.</p>"
  },
  {
    "fnNumber": "125",
    "fnHTML": "<p> The view of personal identity will tend to give rise either to an eternalist outlook or to an annihilationist one, since these are the two most obvious destinies of a permanent self. In fact, the commentary relates the above questions to eternalism and annihilationism (Mp III 150, 15).</p>"
  },
  {
    "fnNumber": "126",
    "fnHTML": "<p> When the illusion is seen for what it is, not only does one abandon the idea of a solid core, one also sees that the idea of ownership is an illusion. In this way the entire <span lang='pi'>saṁsāra</span> has lost whatever value it may previously have had.</p>"
  },
  {
    "fnNumber": "127",
    "fnHTML": "<p> They are beside the point only in so far as it is cessation that is the true goal. A debate about final Nibbāna is still useful to the extent that it makes this clear. And, given the discussion so far, it is useful for pointing out that postulating anything additional to mere cessation does not make good sense and for showing that seeing final Nibbāna as a ‘state’ may prove obstructive to achieving one’s goal. The concern over ‘is there not anything else?’ relates to annihilationism (again, see Mp III 150, 15), and I have argued that cessation is different from the annihilation of a permanent self.</p>"
  },
  {
    "fnNumber": "128",
    "fnHTML": "<p> This passage is almost as explicit as can be that there is nothing apart from <span lang='pi'>dukkha</span> and its cessation.</p><p>It is sometimes argued that the Buddha never speaks of final Nibbāna as just cessation <span class='sesame' data-sesame-key='zotref:Bodhi 2005a'>Bodhi 2005</span>, p.319. (Ven. Bodhi in fact uses the word ‘nonexistence’ rather than cessation. Although the term nonexistence is unfortunate since it implies something as existing prior to final Nibbāna—see <span class='sclinktext'>SN&#8239;12.15<span class='scsegments'>:2.1–2.3</span></span> where the ideas of existence and nonexistence, <span lang='pi'>atthitañ</span> and <span lang='pi'>natthitañ</span>, are presented as false—it seems to me that Ven. Bodhi actually means nonexistence in the sense of (mere) cessation.) But on a number of occasions the Buddha uses terminology that it seems should be understood in just this way, for instance at <span class='sclinktext'>MN&#8239;140<span class='scsegments'>:24.5</span></span>: ‘on the dissolution of the body, with the ending of life, all that is felt, not being delighted in, will become cool right here’. At the same time it is hardly surprising that the Buddha should not spend too much time proclaiming that the nature of final Nibbāna is just cessation. Such statements are bound to be misunderstood by the vast majority of people because of their sense of a permanent self (the Buddha is in fact disparaged as an annihilationist in the suttas on a number of occasions, for instance at <span class='sclinktext'>AN&#8239;8.11<span class='scsegments'>:6.1</span></span> and <span class='sclinktext'>MN&#8239;22<span class='scsegments'>:37.2</span></span>), and thus it would be counterproductive to teach the Dhamma in this way. It seems that the relative paucity of statements on the nature of final Nibbāna is simply a result of the Buddha being pragmatic as to what teachings would inspire the majority of people who are not <span lang='pi'>ariyas</span>, whether monastic or lay.</p>"
  }
]