[
  {
    "suttaRef": "abhidhamma",
    "rootTitle": "Abhidhammapiṭaka",
    "transTitle": "Basket of Systematic Treatises ",
    "blurb": "Abhidhamma texts are systematic summaries and analyses of the teachings drawn from the earlier discourses. The Abhidhamma (spelled abhidharma in Sanskrit) is intended for advanced students who have mastered the teachings of the discourses.",
    "type": "root"
  },
  {
    "suttaRef": "an",
    "rootTitle": "Aṅguttaranikāya",
    "transTitle": "Numbered Discourses Collection ",
    "blurb": "The “Numbered” or “Numerical” Discourses are usually known as Aṅguttara Nikāya in Pali, abbreviated AN. However, the Pali tradition also knows the form Ekottara (“one-up” or “incremental”), and this is the form usually found in the northern collections. These collections organize texts in numbered sets, from one to eleven. Compared to the other <i lang='pi' translate='no'>nikāyas</i>, they are more oriented to the lay community. The Ekottarikāgama (EA) in Chinese is a highly unusual text, which features a range of variations within itself when it comes even to basic doctrines. It shares considerably less in common with the Pali Aṅguttara than the other collections do with their counterparts. In addition, there is a partial Ekottarikāgama in Chinese, as well as a variety of individual discourses and fragments in Chinese and Sanskrit.",
    "type": "branch"
  },
  {
    "suttaRef": "an3.23",
    "rootTitle": "Saṅkhārasutta",
    "transTitle": "Choices ",
    "blurb": "Hurtful or pleasing choices lead to hurtful or pleasing experiences in future lives.",
    "type": "leaf"
  },
  {
    "suttaRef": "an3.76",
    "rootTitle": "Paṭhamabhavasutta",
    "transTitle": "Continued Existence (1st) ",
    "blurb": "How consciousness, karma, and craving create and sustain future lives.",
    "type": "leaf"
  },
  {
    "suttaRef": "an4.195",
    "rootTitle": "Vappasutta",
    "transTitle": "With Vappa ",
    "blurb": "A discussion with a Jain on whether someone with purified understanding can experience the results of bad karma in the next life.",
    "type": "leaf"
  },
  {
    "suttaRef": "an5.23",
    "rootTitle": "Upakkilesasutta",
    "transTitle": "Corruptions ",
    "blurb": "The hindrances are like the corruptions in gold.",
    "type": "leaf"
  },
  {
    "suttaRef": "an7.66",
    "rootTitle": "Sattasūriyasutta",
    "transTitle": "The Seven Suns ",
    "blurb": "A rare discourse on cosmic evolution. The Buddha describes the successive appearance of seven suns and how even the earth will be burned up.",
    "type": "leaf"
  },
  {
    "suttaRef": "an9.34",
    "rootTitle": "Nibbānasukhasutta",
    "transTitle": "Extinguishment is Bliss ",
    "blurb": "Sāriputta declares that extinguishment is bliss, precisely because nothing is felt there. He explains this apparent paradox with reference to the nine progressive meditations.",
    "type": "leaf"
  },
  {
    "suttaRef": "cnd",
    "rootTitle": "Cūḷaniddesa",
    "transTitle": "Shorter Exposition ",
    "blurb": "The Cūḷaniddesa or “Shorter Exposition” is really one half of a book together with the Mahāniddesa or “Great Exposition”. They offer commentaries on certain portions of the Sutta Nipāta, and lack counterparts in the northern canons. The Cūḷaniddesa comments on the “Way to the Beyond” and the “Rhinoceros Horn Sutta”.",
    "type": "branch"
  },
  {
    "suttaRef": "da",
    "rootTitle": "Dīrghāgama",
    "transTitle": "Long Discourses Compilation ",
    "blurb": "The version of the Long Discourses found in the Chinese canon is known as the Dīrghāgama (Chang ahan jing, 長阿含經), and is believed to stem from the Dharmaguptaka school. It consists of 22 fascicles that were translated by Buddhayaśas (佛陀耶舍) and Zhu Fonian (竺佛念) in CE 412–13. Its four chapters focus respectively on the life of the Buddha, teaching and practice, refutation of non-Buddhists, and cosmology. It contains 30 sūtras in contrast to the 34 suttas of the Theravādin Dīgha Nikāya. In the Taishō edition of the Chinese canon, it is the very first text, located at T vol. 1, 1a.",
    "type": "branch"
  },
  {
    "suttaRef": "dhp",
    "rootTitle": "Dhammapada",
    "transTitle": "Sayings of the Dhamma ",
    "blurb": "The Pali version of this famous text, consisting of 423 verses organized into memorable themes. It is the most widely read of the early texts, and has been translated many times into many languages. Versions of this text are found in Chinese, Tibetan, and several Indic languages, attesting to its timeless, universal appeal.",
    "type": "branch"
  },
  {
    "suttaRef": "divy",
    "rootTitle": "Divyāvadāna",
    "transTitle": "Divine Legend ",
    "blurb": "The Divyāvadāna or “Divine Tales” is a Sanskrit anthology of 38 tales, many originating in the Mūlasarvāstivāda Vinaya. Typically the stories illustrate how the consequences of actions in past lives affect the present, with a special emphasis on the merit of making offerings to the Buddha and his disciples. It includes the famous Aśokāvadāna, one of the primary sources for the life of King Ashoka. The text probably dates from around the third century CE, but includes a few parallels to early texts. Modern editions are based on a number of Nepalese manuscripts, mostly quite modern. It was first edited and published in the west by Cowell and Neil in 1884. The digital text on SuttaCentral is from GRETIL, based on the edition by Vaidya (1959), with input by Kensuke Okamoto.",
    "type": "branch"
  },
  {
    "suttaRef": "dn",
    "rootTitle": "Dīghanikāya",
    "transTitle": "Long Discourses Collection ",
    "blurb": "A fabulous courtesan, a guilty king, a know-it-all teen, learned sages and earnest fools, a silent meditation in a thunderstorm. The Long Discourses reveal a Buddha in vital engagement with his times, an ideal of humanity in whom the extraordinary comes alive. These thirty-four discourses are set in an age of wonder, when prophecy was fulfilled and the deep truth of humanity was spoken, laid bare with sparkling clarity and relentless insight. In these tales set in the slow paths, chaotic cities, and deep forests of northern India, in the shadowy past or even among the gods themselves, we see the humble monk Gotama, wise and compassionate teacher of mindfulness and morality, begin his long and storied transformation into the Buddha of legend. ",
    "type": "branch"
  },
  {
    "suttaRef": "dn-silakkhandhavagga",
    "rootTitle": "Sīlakkhandhavagga",
    "transTitle": "The Chapter on the Entire Spectrum of Ethics ",
    "blurb": "The Chapter Containing the Section on Ethics (Sīlakkhandhavagga) is a chapter of 13 discourses. Each of these contains a long passage on the Gradual Training in ethics, meditation, and wisdom. The chapter is named after the first of these sections. The two other known versions of the Dīrghāgama (in Chinese and Sanskrit) also contain a similar chapter. Despite the monastic nature of the central teaching, most of these discourses are presented in dialog with lay people, with a strong emphasis on the relation between the Buddha’s teachings and other contemporary movements.",
    "type": "branch"
  },
  {
    "suttaRef": "dn1",
    "rootTitle": "Brahmajālasutta",
    "transTitle": "The Divine Net ",
    "blurb": "While others may praise or criticize the Buddha, they tend to focus on trivial details. The Buddha presents an analysis of 62 kinds of wrong view, seeing through which one becomes detached from meaningless speculations.",
    "type": "leaf"
  },
  {
    "suttaRef": "dn11",
    "rootTitle": "Kevaṭṭasutta",
    "transTitle": "With Kevaddha ",
    "blurb": "The Buddha refuses to perform miracles, explaining that this is not the right way to inspire faith. He goes on to tell the story of a monk whose misguided quest for answers led him as far as Brahmā.",
    "type": "leaf"
  },
  {
    "suttaRef": "dn14",
    "rootTitle": "Mahāpadānasutta",
    "transTitle": "The Great Discourse on Traces Left Behind ",
    "blurb": "The Buddha teaches about the six Buddhas of the past, and tells a lengthy account of one of those, Vipassī.",
    "type": "leaf"
  },
  {
    "suttaRef": "dn15",
    "rootTitle": "Mahānidānasutta",
    "transTitle": "The Great Discourse on Causation ",
    "blurb": "Rejecting Venerable Ānanda’s claim to easily understand dependent origination, the Buddha presents a complex and demanding analysis, revealing hidden nuances and implications of this central teaching.",
    "type": "leaf"
  },
  {
    "suttaRef": "dn16",
    "rootTitle": "Mahāparinibbānasutta",
    "transTitle": "The Great Discourse on the Buddha’s Extinguishment ",
    "blurb": "The longest of all discourses, this extended narrative tells of the events surrounding the Buddha’s death. Full of vivid and moving details, it is an ideal entry point into knowing the Buddha as a person, and understanding how the Buddhist community coped with his passing.",
    "type": "leaf"
  },
  {
    "suttaRef": "dn2",
    "rootTitle": "Sāmaññaphalasutta",
    "transTitle": "The Fruits of the Ascetic Life ",
    "blurb": "The newly crowned King Ajātasattu is disturbed by the violent means by which he achieved the crown. He visits the Buddha to find peace of mind, and asks him about the benefits of spiritual practice. This is one of the greatest literary and spiritual texts of early Buddhism.",
    "type": "leaf"
  },
  {
    "suttaRef": "dn22",
    "rootTitle": "Mahāsatipaṭṭhānasutta",
    "transTitle": "The Longer Discourse on Mindfulness Meditation ",
    "blurb": "The Buddha details the seventh factor of the noble eightfold path, mindfulness meditation. This discourse is essentially identical to MN 10, with the addition of an extended section on the four noble truths derived from MN 141.",
    "type": "leaf"
  },
  {
    "suttaRef": "dn28",
    "rootTitle": "Sampasādanīyasutta",
    "transTitle": "Inspiring Confidence ",
    "blurb": "Shortly before he passes away, Venerable Sāriputta visits the Buddha and utters a moving eulogy of his great teacher.",
    "type": "leaf"
  },
  {
    "suttaRef": "dn29",
    "rootTitle": "Pāsādikasutta",
    "transTitle": "An Impressive Discourse ",
    "blurb": "Following the death of Nigaṇṭha Nātaputta, the leader of the Jains, the Buddha emphasizes the stability and maturity of his own community. He encourages the community to come together after his death and recite the teachings in harmony.",
    "type": "leaf"
  },
  {
    "suttaRef": "dn30",
    "rootTitle": "Lakkhaṇasutta",
    "transTitle": "The Marks of a Great Man ",
    "blurb": "This presents the brahmanical prophecy of the Great Man, and explains the 32 marks in detail. This discourse contains some of the latest and most complex verse forms in the canon.",
    "type": "leaf"
  },
  {
    "suttaRef": "dn31",
    "rootTitle": "Siṅgālasutta",
    "transTitle": "Advice to Sigālaka ",
    "blurb": "The Buddha encounters a young man who honors his dead father by performing rituals. The Buddha recasts the meaningless rites in terms of virtuous conduct. This is the most detailed discourse on ethics for lay people.",
    "type": "leaf"
  },
  {
    "suttaRef": "dn33",
    "rootTitle": "Saṅgītisutta",
    "transTitle": "Reciting in Concert ",
    "blurb": "The Buddha encourages Venerable Sāriputta to teach the mendicants, and he offers an extended listing of Buddhist doctrines arranged in numerical sequence.",
    "type": "leaf"
  },
  {
    "suttaRef": "dn8",
    "rootTitle": "Mahāsīhanādasutta",
    "transTitle": "The Longer Discourse on the Lion’s Roar ",
    "blurb": "The Buddha is challenged by a naked ascetic on the topic of spiritual austerities. He points out that it is quite possible to perform all kinds of austere practices without having any inner purity of mind.",
    "type": "leaf"
  },
  {
    "suttaRef": "ds",
    "rootTitle": "Dhammasaṅgaṇī",
    "transTitle": "Compendium of Phenomena ",
    "blurb": "The Dhammasaṅgaṇī (Compendium of Phenomena) is built on the idea of a <i lang='pi' translate='no'>mātikā</i>, a lists of contents or matrix. A <i lang='pi' translate='no'>mātikā</i> acts as a simple instance of a template that is applied and transformed in ever more complex forms throughout the work. The Dhammasaṅgaṇī <i lang='pi' translate='no'>mātikās</i> list sets of phenomena (<i lang='pi' translate='no'>dhammas</i>). Most of these are doctrinal terms familiar from the suttas, although some are specialized Abhidhamma terms. The Dhammasaṅgaṇī starts with three <i lang='pi' translate='no'>mātikās</i>. The first classifies <i lang='pi' translate='no'>dhammas</i> into 22 sets of three (<i lang='pi' translate='no'>tika</i>), and the next two use sets of two (<i lang='pi' translate='no'>duka</i>), 100 pairs for Abhidhamma terms, and 42 for Sutta terms. The first of the triple sets is the momentous group: wholesome, unwholesome, and undetermined. This serves as a framework for classifying all the various phenomena. While it seems simple enough, even this detail was controversial, as some schools rejected the existence of the undetermined, or morally neutral, category.",
    "type": "branch"
  },
  {
    "suttaRef": "ea",
    "rootTitle": "Ekottarikāgama (1st)",
    "transTitle": "Numbered Discourses Compilation (1st) ",
    "blurb": "The main version of the Numbered or Incremental Discourses found in the Chinese canon is known as the Ekottarikāgama (Zengyi ahan jing, 增一阿含經), and has been tentatively ascribed to the Mahāsaṅghika school. It was translated by Gautama Saṅghadeva (瞿曇僧伽提婆), who also translated the Madhyamāgama, in CE 397. Consisting of 51 fascicles, it is organized into 52 chapters, containing a total of 451 sutras. Like the Pali Aṅguttara, it is arranged by numbered sets from one to eleven. However, despite the structural similarity, the contents diverge widely from the Pali. It contains relatively fewer parallels than the other āgama collections. In the Taishō edition of the Chinese canon, it is text number 125, located at T vol. 2, 549a.",
    "type": "branch"
  },
  {
    "suttaRef": "iti",
    "rootTitle": "Itivuttaka",
    "transTitle": "So It Was Said ",
    "blurb": "112 short discourses in mixed prose and verse, arranged in the Aṅguttara style of ascending numbered sets, from one to four. Alone among Buddhist texts, its survival is attributed not to the Saṅgha, but to a laywoman named Khujjuttarā. According to the Pali commentaries, she was a maid to the Queen of Kosambi, and memorized these teachings from the Buddha, earning her the title of the most learned of the laywomen disciples.",
    "type": "branch"
  },
  {
    "suttaRef": "iti51",
    "rootTitle": "Dhātusutta",
    "transTitle": "Elements ",
    "blurb": "Three properties: form, formlessness, cessation.",
    "type": "leaf"
  },
  {
    "suttaRef": "ja",
    "rootTitle": "Jātaka",
    "transTitle": "Past Life Stories of the Buddha ",
    "blurb": "A collection of 547 sets of verses telling stories of the Buddha’s past lives. The canonical Pali collection consists of verses arranged in numbered sets in the Aṅguttara fashion. The shorter sets illustrate a high point of a story, while the longer sets tell a complete story. These verses would have been passed down from the beginning with prose narrative to flesh out the story, which in the Pali is now found in the commentary. It is in the commentary that we find the explicit connection between the stories of the past and the present day, identifying the hero of the tale with the <i lang='pi' translate='no'>bodhisattva</i> and the major protagonists with the Buddha’s contemporaries. This collection is the main source of Jātakas, but there are many similar stories found elsewhere in the Pali canon (a few in the four <i lang='pi' translate='no'>nikāyas</i>, others in the Cariyapiṭaka) and throughout the Chinese, Tibetan, and Sanskrit texts. Most of the Jātakas began life as folk tales or myths, drops from the vast ocean of story in oral culture. Several Jātakas record versions of famous Hindu myths, while others share a common basis with European folk tales. The verse forms in the Jātakas are mostly of the earlier kinds, and the social and political reflect historical realities in the centuries before the Buddha, where, for example, Varanasi was an independent kingdom. The Jātakas are the oldest, largest, and best-preserved collection of ancient stories found anywhere in the world. One of the central themes is renunciation, with multiple stories depicting the hero going-forth from the home, each time from a different perspective. Jātakas generally illustrate moral messages, but since the hero is supposed to be imperfect, it is not unusual for him to be portrayed as making dubious choices, even breaking precepts. Taken as a whole, the Jātaka literature is a vast tapestry of story illustrating the twisting and uncertain path to Awakening. The Jātaka genre proved a popular and effective framework for incorporating popular tales into a Buddhist context. They feature prominently in Buddhist art both ancient and modern, and are a primary means of introducing Buddhism to children in modern Theravāda.",
    "type": "branch"
  },
  {
    "suttaRef": "ja12",
    "rootTitle": "Nigrodhamigajātaka",
    "transTitle": "The Banyan Deer ",
    "blurb": "“Keep only with the Banyan Deer.”—This story was told by the Master while at Jetavana about the mother of the Elder named Prince Kassapa. The daughter, we learn, of a wealthy merchant of Rajagaha was deeply rooted in goodness and scorned all temporal things; she had reached her final existence, and within her breast, like a lamp in a pitcher, glowed her sure hope of winning Arahatship. As soon as she reached knowledge of herself, she took no joy in a worldly life but yearned to renounce the world. With this aim, she said to her mother and father, “My dear parents, my heart takes no joy in a worldly life; fain would I embrace the saving doctrine of the Buddha. Suffer me to take the vows.”",
    "type": "leaf"
  },
  {
    "suttaRef": "kn",
    "rootTitle": "Khuddakanikāya",
    "transTitle": "Minor Collection ",
    "blurb": "The word <i lang='pi' translate='no'>khuddaka</i> means “lesser” or “minor”, and it seems that this category originally served to collect certain short collections, mostly verse, that were not conveniently assigned to one of the main <i lang='pi' translate='no'>nikāyas</i>. Over time, however, the collection grew, so that the Khuddaka in the Pali canon today is the largest of the <i lang='pi' translate='no'>nikāyas</i>. It includes some of the most popular texts in Theravāda Buddhism, such as the Dhammapada, the Sutta Nipāta, and the Jātakas. There is no closely parallel collection in the other canons, but many of the early texts have parallels in various places.",
    "type": "branch"
  },
  {
    "suttaRef": "kp6",
    "rootTitle": "Ratanasutta",
    "transTitle": "Gems ",
    "blurb": "The many treasures to be found in the Triple Gem.",
    "type": "leaf"
  },
  {
    "suttaRef": "ma",
    "rootTitle": "Madhyamāgama",
    "transTitle": "Middle Discourses Compilation ",
    "blurb": "The version of the Middle Discourses found in the Chinese canon is known as the Madhyamāgama (Zhong ahan jing, 中阿含經), and is believed to stem from the Sarvāstivāda school. The original text is believed to have been in a form of Prākrit, probably Gandhārī, with some Sanskrit influence. It was translated in 60 fascicles by Gautama Saṅghadeva (瞿曇僧伽提婆) of the Eastern Jin Dynasty (東晋) at Dongting Monastery (東亭寺) in CE 397–398. It consists of 222 sutras, organized into five <i lang='pi' translate='no'>adhyāyas</i> and eighteen <i lang='pi' translate='no'>vargas</i>. The contents are similar to the Pali Majjhima Nikāya, though the collections are far from identical. In the Taishō edition of the Chinese canon, it is text number 26, located at T vol. 1, 421a.",
    "type": "branch"
  },
  {
    "suttaRef": "mil",
    "rootTitle": "Milindapañha",
    "transTitle": "Questions of King Milinda ",
    "blurb": "The Milindapañha or “Questions of King Milinda” records a series of discussions on points of Dhamma between the monk Nāgasena and the Greek king known as in Pali as Milinda. He is usually identified with Menander I Soter, who ruled an Indo-Greek kingdom from his capital of Sagala around BCE 165–130. While the encounter between Greek and Indian culture is fascinating, the dialogs concern only interpretation of Buddhist ideas, with which the king was evidently very familiar, and does not mention Greek philosophy. The text is lively and dynamic, with the King constantly testing Nāgasena with abstruse questions, to which he responds with ingenious arguments and analogies. The text has a shorter Chinese counterpart in the Nāgasena Bhikṣu Sūtra. The text is not Theravādin in origin, but began among one of the schools in the north-west, perhaps the Sarvāstivādins. Most of the content, however, is not sectarian in nature. The Pali text has been extended over the years, and in addition, portions appear to be missing. It is not universally accepted as canonical; SuttaCentral’s Pali texts, however, stem from the Mahāsaṅgīti edition, which as a Burmese text does include it.",
    "type": "branch"
  },
  {
    "suttaRef": "mn",
    "rootTitle": "Majjhimanikāya",
    "transTitle": "Middle Discourses Collection ",
    "blurb": "The Middle Discourses (Majjhima Nikāya, abbreviated MN) is a collection of 152 discourses in the Pali canon (Tipiṭaka) of the Theravada school of Buddhism. The word “middle” refers to the length of the individual discourses. This is perhaps the most popular collection of early discourses. It contains a wide variety of teachings, many of them presented as narratives between the Buddha and a diverse range of his contemporaries. The collection parallels the Madhyamāgama (MA) of the Sarvāstivāda school, which survives as a translation in the Chinese canon.",
    "type": "branch"
  },
  {
    "suttaRef": "mn1",
    "rootTitle": "Mūlapariyāyasutta",
    "transTitle": "The Root of All Things ",
    "blurb": "The Buddha examines how the notion of a permanent self emerges from the process of perception. A wide range of phenomena are considered, embracing both naturalistic and cosmological dimensions. An unawakened person interprets experience in terms of a self, while those more advanced have the same experiences without attachment.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn10",
    "rootTitle": "Mahāsatipaṭṭhānasutta",
    "transTitle": "The Discourse on Mindfulness Meditation ",
    "blurb": "Here the Buddha details the seventh factor of the noble eightfold path, mindfulness meditation. This collects many of the meditation teachings found throughout the canon, especially the foundational practices focusing on the body, and is regarded as one of the most important meditation discourses.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn101",
    "rootTitle": "Devadahasutta",
    "transTitle": "At Devadaha ",
    "blurb": "The Buddha tackles a group of Jain ascetics, pressing them on their claim to be practicing to end all suffering by self-mortification. He points out a series of fallacies in their logic, and explains his own middle way.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn102",
    "rootTitle": "Pañcattayasutta",
    "transTitle": "The Five and Three ",
    "blurb": "A middle length version of the more famous Brahmajāla Sutta (DN1), this surveys a range of speculative views and dismisses them all.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn106",
    "rootTitle": "Āneñjasappāyasutta",
    "transTitle": "Conducive to the Imperturbable ",
    "blurb": "Beginning with profound meditation absorption, the Buddha goes on to deeper and deeper levels, showing how insight on this basis leads to the detaching of consciousness from any form of rebirth.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn111",
    "rootTitle": "Anupadasutta",
    "transTitle": "One by One ",
    "blurb": "The Buddha describes in technical detail the process of insight of Venerable Sāriputta. Many ideas and terms in this text anticipate the Abhidhamma.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn113",
    "rootTitle": "Sappurisasutta",
    "transTitle": "A True Person ",
    "blurb": "The Buddha explains that a truly good person does not disparage others or feel superior because of their attainment.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn118",
    "rootTitle": "Ānāpānassatisutta",
    "transTitle": "Mindfulness of Breathing ",
    "blurb": "Surrounded by many well-practiced mendicants, the Buddha teaches mindfulness of breathing in detail, showing how it relates to the four kinds of mindfulness meditation.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn12",
    "rootTitle": "Mahāsīhanādasutta",
    "transTitle": "The Longer Discourse on the Lion’s Roar ",
    "blurb": "A disrobed monk, Sunakkhatta, attacks the Buddha’s teaching because it merely leads to the end of suffering. The Buddha counters that this is, in fact, praise, and goes on to enumerate his many profound and powerful achievements.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn120",
    "rootTitle": "Saṅkhārupapattisutta",
    "transTitle": "Rebirth by Choice ",
    "blurb": "The Buddha explains how one can make a wish to be reborn in different realms.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn129",
    "rootTitle": "Bālapaṇḍitasutta",
    "transTitle": "The Foolish and the Astute ",
    "blurb": "A fool suffers both in this life and the next, while the astute benefits in both respects.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn13",
    "rootTitle": "Mahādukkhakkhandhasutta",
    "transTitle": "The Longer Discourse on the Mass of Suffering ",
    "blurb": "Challenged to show the difference between his teaching and that of other ascetics, the Buddha points out that they speak of letting go, but do not really understand why. He then explains in great detail the suffering that arises from attachment to sensual stimulation.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn135",
    "rootTitle": "Cūḷakammavibhaṅgasutta",
    "transTitle": "The Shorter Analysis of Deeds ",
    "blurb": "The Buddha explains to a brahmin how your deeds in past lives affect you in this life.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn140",
    "rootTitle": "Dhātuvibhaṅgasutta",
    "transTitle": "The Analysis of the Elements ",
    "blurb": "While staying overnight in a potter’s workshop, the Buddha has a chance encounter with a monk who does not recognize him. They have a long and profound discussion based on the four elements. This is one of the most insightful and moving discourses in the canon.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn141",
    "rootTitle": "Saccavibhaṅgasutta",
    "transTitle": "The Analysis of the Truths ",
    "blurb": "Expanding on the Buddha’s first sermon, Venerable Sāriputta gives a detailed explanation of the four noble truths.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn143",
    "rootTitle": "Anāthapiṇḍikovādasutta",
    "transTitle": "Advice to Anāthapiṇḍika ",
    "blurb": "As the great lay disciple Anāthapiṇḍika lies dying, Venerable Sāriputta visits him and gives a powerful teaching on non-attachment.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn2",
    "rootTitle": "Sabbāsavasutta",
    "transTitle": "All the Defilements ",
    "blurb": "The diverse problems of the spiritual journey demand a diverse range of responses. Rather than applying the same solution to every problem, the Buddha outlines seven methods of dealing with defilements, each of which works in certain cases.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn21",
    "rootTitle": "Kakacūpamasutta",
    "transTitle": "The Simile of the Saw ",
    "blurb": "A discourse full of vibrant and memorable similes, on the importance of patience and love even when faced with abuse and criticism. The Buddha finishes with the simile of the saw, one of the most memorable similes found in the discourses.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn22",
    "rootTitle": "Alagaddūpamasutta",
    "transTitle": "The Simile of the Snake ",
    "blurb": "One of the monks denies that prohibited conduct is really a problem. The monks and then the Buddha subject him to an impressive dressing down. The Buddha compares someone who understands only the letter of the teachings to someone who grabs a snake by the tail, and also invokes the famous simile of the raft.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn28",
    "rootTitle": "Mahāhatthipadopamasutta",
    "transTitle": "The Longer Simile of the Elephant’s Footprint ",
    "blurb": "Sāriputta gives an elaborate demonstration of how, just as any footprint can fit inside an elephant’s, all the Buddha’s teaching can fit inside the four noble truths. This offers an overall template for organizing the Buddha’s teachings.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn38",
    "rootTitle": "Mahātaṇhāsaṅkhayasutta",
    "transTitle": "The Longer Discourse on the Ending of Craving ",
    "blurb": "To counter the wrong view that a self-identical consciousness transmigrates from one life to the next, the Buddha teaches dependent origination, showing that consciousness invariably arises dependent on conditions.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn41",
    "rootTitle": "Sāleyyakasutta",
    "transTitle": "The People of Sālā ",
    "blurb": "The Buddha explains to a group of brahmins the conduct leading to rebirth in higher or lower states, including detailed explanations of the ten core practices which lay people should undertake, and which also form the basis for liberation.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn43",
    "rootTitle": "Mahāvedallasutta",
    "transTitle": "The Great Classification ",
    "blurb": "A series of questions and answers between Sāriputta and Mahākoṭṭhita, examining various subtle and abstruse aspects of the teachings.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn44",
    "rootTitle": "Cūḷavedallasutta",
    "transTitle": "The Shorter Classification ",
    "blurb": "The layman Visākha asks the nun Dhammadinnā about various difficult matters, including some of the highest meditation attainments. The Buddha fully endorses her answers.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn49",
    "rootTitle": "Brahmanimantanikasutta",
    "transTitle": "On the Invitation of Divinity ",
    "blurb": "The Buddha ascends to a high heavenly realm where he engages in a cosmic contest with a powerful divinity, who had fallen into the delusion that he was eternal and all-powerful.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn57",
    "rootTitle": "Kukkuravatikasutta",
    "transTitle": "The Ascetic Who Behaved Like a Dog ",
    "blurb": "Some ascetics in ancient India undertook extreme practices, such as a vow to behave like an ox or a dog. The Buddha meets two such individuals, and is reluctantly pressed to reveal the kammic outcomes of such practice.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn62",
    "rootTitle": "Mahārāhulovādasutta",
    "transTitle": "The Longer Advice to Rāhula ",
    "blurb": "The Buddha tells Rāhula to meditate on not-self, which he immediately puts into practice. Seeing him, Venerable Sāriputta advises him to develop breath meditation, but the Buddha suggests a wide range of different practices first.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn66",
    "rootTitle": "Laṭukikopamasutta",
    "transTitle": "The Simile of the Quail ",
    "blurb": "Again raising the rule regarding eating, but this time as a reflection of gratitude for the Buddha in eliminating things that cause complexity and stress. The Buddha emphasizes how attachment even to little things can be dangerous.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn9",
    "rootTitle": "Sammādiṭṭhisutta",
    "transTitle": "Right View ",
    "blurb": "Venerable Sāriputta gives a detailed explanation of right view, the first factor of the noble eightfold path. At the prompting of the other mendicants, he approaches the topic from a wide range of perspectives.",
    "type": "leaf"
  },
  {
    "suttaRef": "mn93",
    "rootTitle": "Assalāyanasutta",
    "transTitle": "With Assalāyana ",
    "blurb": "A precocious brahmin student is encouraged against his wishes to challenge the Buddha on the question of caste. His reluctance turns out to be justified.",
    "type": "leaf"
  },
  {
    "suttaRef": "mnd",
    "rootTitle": "Mahāniddesa",
    "transTitle": "Longer Exposition ",
    "blurb": "The Mahāniddesa or “Great Exposition” is really one half of a book together with the Cūḷaniddesa, the “Shorter Exposition”. They offer commentaries on certain portions of the Sutta Nipāta, and lack counterparts in the northern canons. The Mahāniddesa comments on the sixteen poems of the fourth chapter, the “Chapter of the Eights” or Aṭṭhakavagga.",
    "type": "branch"
  },
  {
    "suttaRef": "ps",
    "rootTitle": "Paṭisambhidāmagga",
    "transTitle": "The Path of Discrimination ",
    "blurb": "The Paṭisambhidāmagga or “Path of Analytical Discernment” is an advanced critical treatise in thirty chapters on Buddhist practice, which the Pali commentaries attribute to the Buddha’s disciple Sāriputta. Departing from the popular or folksy style of most Khuddaka texts, it is more reminiscent of the Abhidhamma, and indeed, while not included in the Abhidhammapiṭaka, it deserves to be considered part of the Theravādin Abhidhamma system. However, it does not make use of the main Abhidhamma <i lang='pi' translate='no'>mātikās</i>. This text introduces a number of terms and ideas of great importance in later Buddhist philosophy. It does not have any counterparts in the northern canons, but articulates a dictinctly Theravādin perspective on the path.",
    "type": "branch"
  },
  {
    "suttaRef": "pv",
    "rootTitle": "Petavatthu",
    "transTitle": "Stories of Hungry Ghosts ",
    "blurb": "The Stories of Hungry Ghosts” contains fifty-one stories in verse that illustrate rebirth as a hungry ghost as a result of bad deeds. It is a counterpart to the Vimānavatthu. These are late devotional and moralistic texts with no direct counterparts in other collections.",
    "type": "branch"
  },
  {
    "suttaRef": "sa",
    "rootTitle": "Saṁyuktāgama (1st)",
    "transTitle": "Linked Discourses Compilation (1st) ",
    "blurb": "The main version of the Linked Discourses found in the Chinese canon is known as the Saṁyuktāgama (Za ahan jing, 雜阿含經), and is believed to stem from a branch of the Sarvāstivādin school. It was translated by Guṇabhadra (求那跋陀) and Baoyun (寶雲) in CE 435–436 at Waguan Monastery (瓦官寺,) Yangdu (楊都). Like the Pali Saṁyutta Nikāya, it contains over a thousand short suttas organized by topic. The texts, however, became disordered during the transmission in China, and an extraneous passage from a later life of Ashoka was mistakenly included. In the 20th century a series of scholars reconstructed the original sequence. The text as originally found is found in the Taishō edition of the Chinese canon as sutra number 99 at T vol. 2, 1a.",
    "type": "branch"
  },
  {
    "suttaRef": "sab",
    "rootTitle": "Śāripūtrābhidharma",
    "transTitle": "Sāriputta’s Systematic Treatise ",
    "blurb": "The Śāriputrābhidharmaśāstra (Shelifu Apitan Lun, 舍利弗阿毘曇論) is the only extant work of the Dharmaguptaka Abhidhamma, and was translated in thirty facsicles by Dharmayaśas and Dharmagupta in CE 408 at Ch'ang An (長安). It shares some content with the Vibhaṅga and Dharmaskandha, and other details with other texts. It seems this book may contain the entire Abhidhamma system of the Dharmaguptakas. In the Taishō edition of the Chinese canon, it is text number 1548, located at T vol. 28, 525a.",
    "type": "branch"
  },
  {
    "suttaRef": "san-lo-mvu",
    "rootTitle": "Mahāvastu",
    "transTitle": "The Great Story ",
    "blurb": "The Mahāvastu (“the great story”) is a biography of the Buddha that belongs to the Lokuttaravāda school. It is part of their Vinaya but also includes a large amount of Jātaka and Apadāna stories.",
    "type": "branch"
  },
  {
    "suttaRef": "sn",
    "rootTitle": "Saṁyuttanikāya",
    "transTitle": "Linked Discourses Collection ",
    "blurb": "The “Linked” or “Connected” Discourses (Saṁyutta Nikāya, abbreviated SN) is a collection of over a thousand short discourses in the Pali canon. The word “linked” refers to the fact that the texts are collected and organized by topic. In most cases the organizing principle is a particular theme of Dhamma, for example, the five aggregates, dependent origination, the noble eightfold path, mindfulness meditation, or the four noble truths. This collection contains the most extensive range of texts on these core themes. In other cases chapters are organized according to the person or kind of person who speaks. This collection has a full parallel in the Saṁyuktāgama (SA) of the Sarvāstivāda school in Chinese translation. In addition, there are two partial collections in Chinese (SA-2 and SA-3) as well as a number of miscellaneous or fragmentary texts in Chinese, Sanskrit, and Tibetan. Much of the organizational structure of SN is shared with SA, suggesting that this structure preceded the split between these two collections.",
    "type": "branch"
  },
  {
    "suttaRef": "sn-salayatanavaggasamyutta",
    "rootTitle": "Saḷāyatanavaggasaṁyutta",
    "transTitle": "The Group of Linked Discourses Beginning With the Six Sense Fields ",
    "blurb": "The “Book of the Six Sense Fields” is the fourth of the five books of the Linked Discourses. It is named after the first and longest <i lang='pi' translate='no'>saṁyutta</i>, which deals with the core Buddhist teaching of the six sense fields. The second <i lang='pi' translate='no'>saṁyutta</i> on Feelings also deals with a major doctrinal topic. The remaining eight <i lang='pi' translate='no'>saṁyuttas</i> deal with miscellaneous secondary themes, some organized by subject, others by person.",
    "type": "branch"
  },
  {
    "suttaRef": "sn12",
    "rootTitle": "Nidānasaṁyutta",
    "transTitle": "Linked Discourses on Causation ",
    "blurb": "The “Linked Discourses on Causation” is a major collection containing 93 discourses on the core Buddhist teaching of dependent origination. Dependent origination presents a series of conditional links laying bare how suffering originates and how it ends. As such, it is an extended treatment of the second and third noble truths. It integrates psychological and existential aspects of suffering, showing how when bound by attachment we make choices that bind us to transmigrating into future lives. One of the core purposes is to explain how rebirth takes place without having to invoke metaphysical concepts such as a “soul”. The collection begins by defining each of the terms in the standard 12-linked chain, definitions which are assumed to apply throughout. Remaining discourses iterate on this theme, introducing new perspectives and formulations. ",
    "type": "branch"
  },
  {
    "suttaRef": "sn12.15",
    "rootTitle": "Kaccānagottasutta",
    "transTitle": "Kaccānagotta ",
    "blurb": "Venerable Kaccānagotta asks the Buddha about right view, and the Buddha answers that right view arises when one sees the origin and cessation of the world and is free of attachments. This sutta, brief but profound and difficult, became renowned as the only canonical reference named in Nāgārjuna’s Mūlamadhyamakakārikā, perhaps the most famous philosophical treatise in all Buddhism.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn12.2",
    "rootTitle": "Vibhaṅgasutta",
    "transTitle": "Analysis ",
    "blurb": "The Buddha gives definitions for each of the twelve links. These are general definitions that apply wherever the twelve links are mentioned.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn12.23",
    "rootTitle": "Upanisasutta",
    "transTitle": "Vital Conditions ",
    "blurb": "The ending of defilements comes only when the truth is seen. But seeing the truth comes about due to a vital condition. In this way, twelve factors leading to freedom are united with the twelve factors leading to suffering.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn12.25",
    "rootTitle": "Bhūmijasutta",
    "transTitle": "With Bhūmija ",
    "blurb": "Sāriputta is asked by Venerable Bhūmija as to the origin of pleasure and pain. He replies that the Buddha teaches that pleasure and pain originate by conditions. Moreover, all those who offer opinions on this question are themselves part of the web of conditions, as they cannot state their views without contact. Ānanda reports the exchange to the Buddha, who praises Sāriputta’s answer.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn12.38",
    "rootTitle": "Cetanāsutta",
    "transTitle": "Intention ",
    "blurb": "Intentions or choices are the force that propels consciousness from one life to the next.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn12.39",
    "rootTitle": "Dutiyacetanāsutta",
    "transTitle": "Intention (2nd) ",
    "blurb": "Intentions or choices are the force that propels consciousness from one life to the next.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn12.40",
    "rootTitle": "Tatiyacetanāsutta",
    "transTitle": "Intention (3rd) ",
    "blurb": "Intentions or choices are the force that propels consciousness from one life to the next.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn12.63",
    "rootTitle": "Puttamaṁsasutta",
    "transTitle": "A Child’s Flesh ",
    "blurb": "The Buddha defines the four kinds of “food” or “nutriment”, which include edible food, contact, intention, and consciousness. He illustrates them with a series of powerful and horrifying similes.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn12.64",
    "rootTitle": "Atthirāgasutta",
    "transTitle": "If There Is Desire ",
    "blurb": "The Buddha defines the four kinds of “food” or “nutriment”, which include edible food, contact, intention, and consciousness, showing how they lead to suffering according to dependent origination. ",
    "type": "leaf"
  },
  {
    "suttaRef": "sn12.65",
    "rootTitle": "Nagarasutta",
    "transTitle": "The City ",
    "blurb": "The Buddha tells the story of how his awakening came about through investigation into dependent origination. He compares it to a man discovering and ancient city, lost and overgrown with weeds.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn15",
    "rootTitle": "Anamataggasaṁyutta",
    "transTitle": "Linked Discourses on the Unknowable Beginning ",
    "blurb": "The “Linked Discourses on the Unknowable Beginning” contains 20 discourses that speak of how the ultimate origin of the process of transmigration (<i lang='pi' translate='no'>saṁsāra</i>) is unknowable. This theme is a direct counter to the hubris of the creation myths found in most religions, which confidently recount events which are in fact permanently hidden from view. The Buddha emphasized that transmigration has been ongoing for a fathomless period of time, illustrating it with a series of powerful similes.",
    "type": "branch"
  },
  {
    "suttaRef": "sn22.100",
    "rootTitle": "Dutiyagaddulabaddhasutta",
    "transTitle": "A Leash (2nd) ",
    "blurb": "A dog leashed to a post will always remain close to that post. In the same way, beings remain close to aggregates in this endless cycle of transmigration. The Buddha refers to a well-known painting called “Conduct”, and says the mind is even more diverse than that; and indeed, the animal realm is the most diverse of them all, and it is produced by the mind.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn22.54",
    "rootTitle": "Bījasutta",
    "transTitle": "Seeds of Plants ",
    "blurb": "Consciousness is like a seed that is planted in the soil of the other four aggregates and watered with craving.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn22.59",
    "rootTitle": "Anattalakkhaṇasutta",
    "transTitle": "The Characteristic of Not-Self ",
    "blurb": "In the Deer Park at Varanasi the Buddha teaches the famous second discourse, on not-self with regard to the aggregates, to the group of five monks. At the conclusion, they become perfected ones.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn22.85",
    "rootTitle": "Yamakasutta",
    "transTitle": "With Yamaka ",
    "blurb": "Venerable Yamaka had the wrong view that one whose defilements have ended is annihilated at death. The monks ask Sāriputta to help, and he asks Yamaka whether a realized one in this very life may be identified as one of the aggregates, or apart from them. Convinced, Yamaka lets go of his view and sees the Dhamma.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn22.86",
    "rootTitle": "Anurādhasutta",
    "transTitle": "With Anurādha ",
    "blurb": "Venerable Anurādha is questioned by a number of ascetics, and ends up by saying that a realized one is described in terms other than “still existing after death” and so on. The wanderers say he’s a fool, so he checks with the Buddha, who says that a realized one is not even apprehended in this life, so how can he be described after death?",
    "type": "leaf"
  },
  {
    "suttaRef": "sn22.87",
    "rootTitle": "Vakkalisutta",
    "transTitle": "With Vakkali ",
    "blurb": "Venerable Vakkali is ill, and asks the Buddha to visit him. The Buddha does so, but says there is no point in seeing his physical body, as one who sees the Dhamma sees him. Later, Vakkali is taken to the Black Rock on Isigili, where he declares that he has no attachment to the aggregates, and takes his own life. The Buddha says that he had attained final extinguishment.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn22.99",
    "rootTitle": "Gaddulabaddhasutta",
    "transTitle": "A Leash ",
    "blurb": "Transmigration has no knowable beginning; even the oceans, mountains, and this great earth will perish. But like a dog on a leash running around a post, beings remain attached to the aggregates.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn35",
    "rootTitle": "Saḷāyatanasaṁyutta",
    "transTitle": "Linked Discourses on the Six Sense Fields ",
    "blurb": "The number of discourses in the “Linked Discourses on the Six Sense Fields” varies between editions, mainly due to the way repetitions are counted; SuttaCentral follows Bhikkhu Bodhi’s translation in counting 248 discourses. The six sense fields complement the five aggregates as the summary of the noble truth of suffering. Where the aggregates focus on the functional structure of experience as basis for views of self, the emphasis here is on how sense experience stimulates desire. Despite this difference in orientation, the two collections share much in common, and often the exact same template is applied in both cases. The six sense fields are the means through which the world is known, and so each of them has an “inner” and an “outer” aspect—the “eye” and “sights”, etc. Though common, it’s best to avoid thinking of the external sense field as the “object”, since in the suttas they are depicted in relation to the observing mind, and not as independently existing entities. This is straightforward until we come to the last sense, the “mind” and “thoughts” or “mental phenomena”. Just to clear up a possible confusion, this “sixth sense” is simply the mental faculty, and has nothing to do with psychic powers. The outer aspect is <i lang='pi' translate='no'>dhammā</i>, a term so ambiguous its translation is always difficult. Here it refers to anything that may be known directly by the mind, distinct from the five senses. The most technically correct translation is probably “mental phenomena”, but “thought’ may be used as a more colloquial rendering, so long as it includes ideas, imagination, and so on, not just verbalized cognition.",
    "type": "branch"
  },
  {
    "suttaRef": "sn35.28",
    "rootTitle": "Ādittasutta",
    "transTitle": "Burning ",
    "blurb": "The “all” consisting of the six interior and exterior sense fields is burning. This is the famous “third sermon” taught at Gayā’s Head to the followers of the three Kassapa brothers.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn36.21",
    "rootTitle": "Sīvakasutta",
    "transTitle": "With Sīvaka ",
    "blurb": "When the wanderer Moḷiyasīvaka asks if all feelings are caused by karma in past lives. The Buddha denies this, asserting that feelings have many different causes.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn36.6",
    "rootTitle": "Sallasutta",
    "transTitle": "An Arrow ",
    "blurb": "Both ordinary and awakened people experience the three feelings. The difference is that when an ordinary person is stricken with feeling, they react, creating more suffering, whereas an awakened person responds with equanimity.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn4.23",
    "rootTitle": "Godhikasutta",
    "transTitle": "With Godhika ",
    "blurb": "Venerable Godhika finds himself repeatedly falling away from his meditation attainments due to severe illness. Eventually he considers suicide, and Māra tries to get the Buddha to deter him. But the Buddha says Godhika has already attained awakening and has died blamelessly.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn43",
    "rootTitle": "Asaṅkhatasaṁyutta",
    "transTitle": "Linked Discourses on the Unconditioned ",
    "blurb": "The “Linked Discourses on the Unconditioned” contains 44 discourses on the theme of the unconditioned, i.e. <i lang='pi' translate='no'>nibbāna</i> or “extinguishment”. They focus on the various practices that lead to the unconditioned. This chapter includes an extensive range of terms and idioms describing the final goal of Buddhist practice.",
    "type": "branch"
  },
  {
    "suttaRef": "sn47",
    "rootTitle": "Satipaṭṭhānasaṁyutta",
    "transTitle": "Linked Discourses on Mindfulness Meditation ",
    "blurb": "The “Linked Discourses on Mindfulness Meditation” contains 104 discourses on the four kinds of mindfulness meditation (<i lang='pi' translate='no'>satipaṭṭhāna</i>, otherwise known as the “foundations of mindfulness” or “establishments of mindfulness”). These are the body, feelings, mind, and principles. The last of these is translated in various ways, but a close reading of the texts in this chapter shows that it originally referred to the “principles” of causality underlying the process of meditation itself. These discourses on this fundamental topic are much less known than the longer “Discourse on Mindfulness Meditation” found in versions in MN 10 and DN 22; however, they are historically earlier than that late compilation. Where MN 10 emphasizes insight meditation, in this collection we frequently find mindfulness closely connected to absorption, as it is the factor of the path that leads directly to “right immersion”. Insight is mentioned only rarely. The root meaning of the term mindfulness (<i lang='pi' translate='no'>sati</i>) is “memory”, and when used in meditation it refers to not “forgetting” one’s meditation, but keeping focus on the breath or other theme of meditation. This collection presents a range of perspectives on mindfulness meditation; one of its most memorable features is a series of similes or parables illustrating the practice. The partner of mindfulness (<i lang='pi' translate='no'>sati</i>) is “situational awareness” (<i lang='pi' translate='no'>sampajañña</i>, sometimes rendered as “clear comprehension”), which refers to keeping a broad awareness and understanding especially in daily activities.",
    "type": "branch"
  },
  {
    "suttaRef": "sn56.35",
    "rootTitle": "Sattisatasutta",
    "transTitle": "A Hundred Spears ",
    "blurb": "Even more than if you’re being tortured with spikes, you should make an effort to understand the four noble truths.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn56.42",
    "rootTitle": "Papātasutta",
    "transTitle": "A Cliff ",
    "blurb": "The Buddha takes the mendicants to a steep precipice, and points out that those who do not understand the four noble truths fall into a still deeper precipice.",
    "type": "leaf"
  },
  {
    "suttaRef": "sn6.4",
    "rootTitle": "Bakabrahmasutta",
    "transTitle": "With Baka the Divinity ",
    "blurb": "Baka the Brahmā conceives the wrong view that his status is permanent and imperishable. The Buddha goes to dissuade him, and they have an exchange in verse, with the Buddha telling Baka of his past lives. ",
    "type": "leaf"
  },
  {
    "suttaRef": "snp",
    "rootTitle": "Suttanipāta",
    "transTitle": "Anthology of Discourses ",
    "blurb": "The “Group of Discourses” contains 74 mostly short texts in verse or mixed prose and verse, arranged in five chapters. This contains some of the most beloved texts in popular Buddhism, such as the Ratana, Maṅgala, and Mettā Suttas, which are known to all Theravada Buddhists and recited as uplifting and protective chants at auspicious ceremonies. The collection as a whole is somewhat late; it is not found in northern scriptures, and some portions, such as the opening verses of the Nālaka Sutta, belong to the latest strata of the early texts. Nevertheless, certain sections—the “Rhinoceros Horn”, the “Chapter of the Eights”, and the “Way to the Beyond”—appear to have existed before being gathered into the collection, and are regarded as early. While the collection as a whole has no counterpart elsewhere, several portions have parallels in Chinese or Sanskrit.",
    "type": "branch"
  },
  {
    "suttaRef": "snp-parayanavagga",
    "rootTitle": "Pārāyanavagga",
    "transTitle": "The Chapter on the Way to the Beyond ",
    "blurb": "This is perhaps the most sophisticated and moving poetic composition in early Buddhism. It begins with a brahmin, suffering an unwanted curse, who sends his students to seek the Buddha. At the end of a long journey they ask questions, the nature of which indicate their subtle philosophy and deep meditation. It concludes with an emotional declaration of faith and determination.",
    "type": "branch"
  },
  {
    "suttaRef": "snp5.2",
    "rootTitle": "Ajitamāṇavapucchā",
    "transTitle": "The Questions of the Student Ajita ",
    "blurb": "A brahman questions the Buddha about mindfulness, discernment, and the cessation of name-and-form.",
    "type": "leaf"
  },
  {
    "suttaRef": "sutta",
    "rootTitle": "Suttapiṭaka",
    "transTitle": "Basket of Discourses ",
    "blurb": "The Buddha’s teachings on meditation, morality, the nature of the world, and the path to freedom. These scriptures are our primary sources for the historical Buddha’s life and practice. They depict the Buddha and his students in lively conversation with a diverse range of people.",
    "type": "root"
  },
  {
    "suttaRef": "thag",
    "rootTitle": "Theragāthā",
    "transTitle": "Verses of the Senior Monks ",
    "blurb": "The “Verses of the Senior Monks” is a collection of about 1288 verses attributed to 264 of the senior monks alive in the Buddha’s time, or in a few cases, a little later. It is a pair with the Therīgāthā, the “Verses of the Senior Nuns”. These verses celebrate the joy of freedom and the life of meditation in the forest. Together these collections constitute one of the oldest and largest collections of contemplative literature, preserving the unique voices of hundreds of early practitioners. Based on style and content, these collections belong to the early discourses. They are referred to on occasion in the northern canons, but no parallel collections have survived.",
    "type": "branch"
  },
  {
    "suttaRef": "thig",
    "rootTitle": "Therīgāthā",
    "transTitle": "Verses of the Senior Nuns ",
    "blurb": "The “Verses of the Senior Nuns” is a collection of about 524 verses attributed to 73 of the senior nuns alive in the Buddha’s time, or in a few cases, a little later. These verses celebrate the bliss of freedom and the life of meditation, full of proud and joyous proclamations of their spiritual attainments and their gratitude to other nuns as guides and teachers. The Therīgāthā is one of the oldest spiritual texts recording only women’s voices. It is a pair with the Theragāthā, the “Verses of the Senior Monks”. Together these collections constitute one of the oldest and largest collections of contemplative literature. Based on style and content, these collections belong to the early discourses. They are referred to on occasion in the northern canons, but no parallel collections have survived.",
    "type": "branch"
  },
  {
    "suttaRef": "ud",
    "rootTitle": "Udāna",
    "transTitle": "Heartfelt Sayings ",
    "blurb": "Eighty short discourses in mixed prose and verse. These take the form of a simple prose narrative, which serves to frame an inspired saying, usually in verse. The <i lang='pi' translate='no'>udāna</i> and <i lang='pi' translate='no'>dhammapada</i> literature appear to overlap, and can be considered as one genre. The Dhammapada verses also have associated narratives, but these are found in the commentary. There are some indications that some of the narratives in the Udāna may be a little later than most of the material in the four main <i lang='pi' translate='no'>nikāyas</i>.",
    "type": "branch"
  },
  {
    "suttaRef": "ud-pataligamiyavagga",
    "rootTitle": "Pāṭaligāmiyavagga",
    "transTitle": "The Chapter with the Pāṭali Villagers",
    "blurb": "The final chapter deals with the Buddha’s final passing away and the crisis of faith that this created. It begins with series of solemn declarations on Nibbana and ends with the spectacular passing of the monk Dabba. ",
    "type": "branch"
  },
  {
    "suttaRef": "ud8.1",
    "rootTitle": "Paṭhamanibbānapaṭisaṁyuttasutta",
    "transTitle": "About Extinguishment (1st) ",
    "blurb": "The nature of extinguishment.",
    "type": "leaf"
  },
  {
    "suttaRef": "uv",
    "rootTitle": "Udānavarga",
    "transTitle": "Handbook of Heartfelt Sayings ",
    "blurb": "The Udānavarga or “Collection of Inspired Sayings” is a Sarvāstivādin Dhammapada-style text. At 1044 verses, it is over twice as long as the Pali Dhammapada, and the longest of all the Dhammapadas. The manuscript was among the Sanskrit texts discovered at Turfan. The SuttaCentral text is sourced from the Titus edition prepared by Gippert and Kupfer, and based on the edition by Bernhard (1965). There are Chinese and Tibetan translations of this text.",
    "type": "branch"
  },
  {
    "suttaRef": "vinaya",
    "rootTitle": "Vinayapiṭaka",
    "transTitle": "Basket of Monastic Law ",
    "blurb": "The texts on Monastic Law (vinaya) detail the lifestyle, rules, and procedures for Buddhist monks and nuns. They provide the guidelines for Buddhist monastics to this day, and in addition, paint a detailed and vivid picture of everyday life in ancient India.",
    "type": "root"
  },
  {
    "suttaRef": "vv",
    "rootTitle": "Vimānavatthu",
    "transTitle": "Stories of Heavenly Mansions ",
    "blurb": "The “Stories of Celestial Mansions” contains eighty-five stories in verse that illustrate the heavenly rewards of virtuous deeds, especially making offerings to the Buddha or the Saṅgha. It is a counterpart to the Petavatthu. These are late devotional texts with no direct counterparts in other collections.",
    "type": "branch"
  }
]