{
	"Authors": "Bhante S. Dhammika",
	"BookTitle": "Like Milk and Water Mixed",
	"BookSubtitle": "Buddhist Reflections on Love",
	"ShortAbstract": "<p>Bhante Dhammika combines Buddhist insights with modern psychology to craft a cohesive definition of love. Drawing upon his many years study of Buddhist scriptures, he explores what the Buddha had to say about romantic love, parental love, love of animals, loving friendship and others. Included is an in-depth look at <span lang='pli'>mettā</span>, the highest love—what it is and why it is an essential part of the spiritual life.</p>",
	"Abstract": "<p>The Buddha’s teaching of universal love (<span lang='pli'>mettā</span>) is widely known, even to those outside the Buddhist community. What is less well-known is that the Buddha also had much to say about the many other expressions of love. In this book, the author combines Buddhist insights with modern psychology to craft a definition of love that cuts through the warm but often unrealistic ideas about love that prevent us from having a clearer and more realistic understanding of it. Then, drawing upon his many years study of the Tipitaka, the Buddhist scriptures, he explores what the Buddha had to say about romantic love, parental love, love of animals, loving friendship—nine types altogether. Included also is an in-depth look at <span lang='pli'>mettā</span>, the highest love—what it is, why it is an essential part of the spiritual life and how meditation can awaken and enhance it. Step-by-step instructions on how to practice this meditation are also given. The book finishes with a selection of over fifty quotations from the Tipitaka and later Buddhist literature about love, compassion, kindness and good-will. Anyone interested in getting a deeper insight into the Buddhist theory and practice will find this book a compelling read.</p>",
	"AddInfo": [],
	"Copyright": [
		"Shravasti Dhammika",
		"First Published in 2013.",
		"Second Edition 2016.",
		"This Wisdom &amp; Wonders online edition 2024.",
		"Also Published by Pariyatti Publishing in Paperback 2024 (without SuttaCentral references).",
		"pp. 183 (in pdf format)."
	],
	"CCLicense": "<div class='cclicense'><h3>Attribution-NonCommercial-NoDerivatives 4.0 International <span>(CC BY-NC-ND 4.0)</span></h3><div id = 'ccDetail'><p>You are free to:</p><ul><li><strong>Share</strong> — copy and redistribute the material in any medium or format</li></ul><p>Under the following terms:</p><ul><li><strong>Attribution</strong> — You must give appropriate credit, provide a link to the license, and indicate if changes were made. You may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.</li><li><strong>NonCommercial</strong> — You may not use the material for commercial purposes.</li><li><strong>NoDerivatives</strong> — If you remix, transform, or build upon the material, you may not distribute the modified material.</li><li><strong>No additional restrictions</strong> — You may not apply legal terms or technological measures that legally restrict others from doing anything the license permits.</li></ul><p><strong>Notices:</strong></p><p>You do not have to comply with the license for elements of the material in the public domain or where your use is permitted by an applicable exception or limitation.</p><p>No warranties are given. The license may not give you all of the permissions necessary for your intended use. For example, other rights such as publicity, privacy, or moral rights may limit how you use the material.</p></div></div>",
	"FrontCover": "../_resources/book-data/milk/FrontLarge.jpg",
	"BackCover": "",
	"BackMatter": [],
	"AuthorsData": [
		{
			"ShortName": "Bhante S. Dhammika",
			"InfoImage": "../_resources/author-data/sdhammika/info.jpg",
			"ShortBio": [
				"Bhante Shravasti Dhammika was born in Australia and took his lower ordination as a Theravada monk in India in 1976. ",
				"He has written over 25 books. ",
				"He lived and taught in Singapore where he was spiritual advisor to the Buddha Dhamma Mandala Society. ",
				"In 2017 he moved back to Australia and still continues to write about the Dhamma."
			]
		}
	]
}