[
  {"id":"BlackmoreS 1993a","abstract":"Near-death experiences hit the popular imagination in 1975, with Raymond Moody's book \"Life after Life\". The appeal was immediate and the idea was born that people could leave their bodies, experience wonderful encounters with a being of light and then pass onto other worlds and still come back to tell the tale. Since then, research has flourished, but a split has developed between those who think that NDEs are evidence for life after death and those who argue that they are just the product of a dying brain. This book attempts to bridge the scientific (reductionist) and spiritual (holistic) viewpoints, arguing that there is no soul and no hope for life after death, but that nonetheless a very special spiritual transformation occurs.","author":[{"family":"Blackmore","given":"Susan"}],"citation-key":"BlackmoreS 1993a","event-place":"London","file":"","ISBN":"978-0-586-09212-5","issued":{"date-parts":[["1993"]]},"language":"English","number-of-pages":"272","publisher":"HarperCollins","publisher-place":"London","source":"Amazon","title":"Dying to Live: Science and the Near-death Experience","type":"book","URL":"https://www.globepequot.com/9780879758707/dying-to-live/"},
  {"id":"BlavatskyHP 1889a","abstract":"This edition of H.P.B.’s “Key to Theosophy” is a reproduction of the 1889 first edition. The Key to Theosophy outlines the central ideas behind the modern theosophical movement and the Theosophical Society. It is written in a way to be accessible to anyone, from first-time to long-time students of theosophy.","author":[{"family":"Blavatsky","given":"H. P."}],"citation-key":"BlavatskyHP 1889a","event-place":"Middletown, DE","file":"Blavatsky-1889-the-key-to-theosophy.pdf","ISBN":"978-1-5368-4649-2","issued":{"date-parts":[["1889"]]},"language":"English","number-of-pages":"226","publisher":"CreateSpace Independent Publishing Platform","publisher-place":"Middletown, DE","title":"The Key to Theosophy","type":"book"},
  {"id":"BTTS 1a","accessed":{"date-parts":[["2025",7,28]]},"citation-key":"BTTS 1a","container-title":"City of Ten Thousand Buddhas","contributor":[{"literal":"Buddhist Text Translation Society"}],"file":"Buddhist Text Translation Society-the-buddha-speaks-the-sutra-on-cause-and-effect-in-the-three.pdf","title":"The Buddha Speaks The Sutra On Cause And Effect In The Three Periods Of Time","type":"webpage","URL":"https://www.cttbusa.org/cause_effect/cause_and_effect.htm"},
  {"id":"ChangG 1971a","abstract":"The Hwa Yen school of Mahāyāna Buddhism bloomed in China in the 7th and 8th centuries A.D. Today many scholars regard its doctrines of Emptiness, Totality, and Mind-Only as the crown of Buddhist thought and as a useful and unique philosophical system and explanation of man, world, and life as intuitively experienced in Zen practice.For the first time in any Western language Garma Chang explains and exemplifies these doctrines with references to both oriental masters and Western philosophers. The Buddha's mystical experience of infinity and totality provides the framework for this objective revelation of the three pervasive and interlocking concepts upon which any study of Mahāyāna philosophy must depend.Following an introductory section describing the essential differences between Judeo-Christian and Buddhist philosophy, Professor Chang provides an extensive, expertly developed section on the philosophical foundations of Hwa Yen Buddhism dealing with the core concept of True Voidness, the philosophy of Totality, and the doctrine of Mind-Only. A concluding section includes selections of Hwa Yen readings and biographies of the patriarchs, as well as a glossary and list of Chinese terms.","author":[{"family":"Chang","given":"Garma C. C."}],"citation-key":"ChangG 1971a","event-place":"Park, Penns. London","file":"Chang-1971-the-buddhist-teaching-of-totality-the-philosophy-of-hwa-yen.pdf","ISBN":"978-0-271-01179-0","issued":{"date-parts":[["1971"]]},"language":"English","number-of-pages":"300","publisher":"Pennsylvania State University Press","publisher-place":"Park, Penns. London","title":"The Buddhist Teaching of Totality: The Philosophy of Hwa Yen Buddhism","type":"book"},
  {"id":"CoomaraswamyA 1916a","author":[{"family":"Coomaraswamy","given":"Ananda K."}],"citation-key":"CoomaraswamyA 1916a","file":"Coomaraswamy-1916-buddha-and-the-gospel-of-buddhism.pdf","issued":{"date-parts":[["1916"]]},"language":"English","number-of-pages":"420","title":"Buddha And The Gospel Of Buddhism","type":"book"},
  {"id":"DawkinsR 2007a","abstract":"\"The God Delusion\" caused a sensation when it was published in 2006. Within weeks it became the most hotly debated topic, with Dawkins himself branded as either saint or sinner for presenting his hard-hitting, impassioned rebuttal of religion of all types. His argument could hardly be more topical. While Europe is becoming increasingly secularized, the rise of religious fundamentalism, whether in the Middle East or Middle America, is dramatically and dangerously dividing opinion around the world. In America, and elsewhere, a vigorous dispute between 'intelligent design' and Darwinism is seriously undermining and restricting the teaching of science. In many countries religious dogma from medieval times still serves to abuse basic human rights such as women's and gay rights. And all from a belief in a God whose existence lacks evidence of any kind. Dawkins attacks God in all his forms. He eviscerates the major arguments for religion and demonstrates the supreme improbability of a supreme being. He shows how religion fuels war, foments bigotry and abuses children. \"The God Delusion\" is a brilliantly argued, fascinating polemic that will be required reading for anyone interested in this most emotional and important subject.","author":[{"family":"Dawkins","given":"Richard"}],"citation-key":"DawkinsR 2007a","event-place":"London","file":"","ISBN":"978-0-552-77331-7","issued":{"date-parts":[["2007"]]},"language":"English","number-of-pages":"464","publisher":"Black Swan","publisher-place":"London","title":"The God Delusion","type":"book"},
  {"id":"deLaValleePoussinL 1988a","abstract":"This is the most important compendium of Indian Buddhist philosophy and psychology. The four volume masterwork begins with a history of Abhidharma literature and covers a vast array of subjects from a Buddhist viewpoint. Some of these subjects are Buddhist cosmology and the process of rebirth, karma and the Buddhist ethical theory, mental defilements, causes of suffering and the path to enlightenment, the supernatural powers of a Buddha, a taxonomy of meditative states and a refutation of the existence of soul.\"... one of the landmark achievements in the history of Buddhist Studies. \nUnder the influence of his teacher, Louis de la Valle Poussin, Prof. Lamotte published several works in French, which were primarily editions, translations and commentaries on Tibetan and Chinese Buddhist texts. The theories and concepts contained in this particular work are closely related to those of the Abhidharmakosa, and as such it makes a valuable companion to that larger work. Here Prof. Pruden has provided a masterful English translation of Prof. Lamotte’s work, and has added a brief biography of Prof. Lamotte and his scholarly accomplishments to familiarize the reader with this great scholar of Buddhism.","citation-key":"deLaValleePoussinL 1988a","contributor":[{"family":"La Vallee Poussin","given":"Louis","non-dropping-particle":"de"}],"file":"de La Vallee Poussin-1988-abhidharmakośabhāṣyam-of-vasubhandhu-1.pdf;de La Vallee Poussin-1988-abhidharmakośabhāṣyam-of-vasubhandhu-2.pdf;de La Vallee Poussin-1988-abhidharmakośabhāṣyam-of-vasubhandhu-3.pdf;de La Vallee Poussin-1988-abhidharmakośabhāṣyam-of-vasubhandhu-4.pdf","ISBN":"978-0-89581-908-6","issued":{"date-parts":[["1988"]]},"language":"en","note":"attachment-label:Vol 1;2;3;4","number-of-pages":"440","number-of-volumes":"4","publisher":"Asian Humanities Press","title":"Abhidharmakośabhāṣyam of Vasubhandhu","translator":[{"family":"Pruden","given":"Leo M"}],"type":"book","volume":"1–4"},
  {"id":"DucasseC 1961a","abstract":"This scarce antiquarian book is a facsimile reprint of the original. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions that are true to the original work.","author":[{"family":"Ducasse","given":"C. J."}],"citation-key":"DucasseC 1961a","event-place":"Illinois, USA","file":"Ducasse-1961-a-critical-examination-of-the-belief-in-a-life-after-death.pdf","issued":{"date-parts":[["1961"]]},"language":"English","number-of-pages":"340","publisher":"Charles C Thomas","publisher-place":"Illinois, USA","title":"A Critical Examination of The Belief In A Life After Death","type":"book"},
  {"id":"EdwardsP 1996a","abstract":"This is the first comprehensive and systematic evaluation of reincarnation and Karma in any language. Renowned philosopher Paul Edwards exposes the many flaws in the arguments supporting the belief in reincarnation and the so-called Law of Karma. He also covers the alleged evidence in support of reincarnation, including child prodigies, deja vu experiences, hypnotic regressions, and \"reincarnation memories.\" Finally, he discusses in some detail the claims of the leading figures in the recent immortality movement, in particular Elisabeth Kuebler-Ross, Raymond Moody, and Dr. Stanislov Grof. Edwards' wit and clarity make this a fascinating, accessible, and enjoyable work.","author":[{"family":"Edwards","given":"Paul"}],"citation-key":"EdwardsP 1996a","event-place":"Amherst, N.Y.","file":"","ISBN":"978-1-57392-921-9","issued":{"date-parts":[["1996"]]},"language":"English","number-of-pages":"315","publisher":"Prometheus","publisher-place":"Amherst, N.Y.","source":"Amazon","title":"Reincarnation: A Critical Examination","type":"book"},
  {"id":"ErwinT 2018a","abstract":"THE LIGHTWORKER’S GUIDE TO Everyday Karma is a spiritual law of physics that states categorically that for every action there is an equal and opposite reaction. Karma is a law of the universe that applies to all living things, to all heavenly bodies, all planets and ultimately, to all beings. Karma is the very nature of God’s consciousness. So how do you wrap your brain around the nature of God’s consciousness and making supper? Have you ever wondered: If karma is really negotiable? About past life karma – why me God? If winning the lottery is karma or dumb luck? If you pick your parents (must rethink choices next life)? If not washing your car has karmic consequences (yes it does!)? If having cancer is related to karma? It is bad karma to question God or is God expecting the question? If the DNA you arrive with is karmic humor? If forgiving someone erases the karma of their actions? About stress and karma – do they always have lunch together? About holidays and karma – is there a gift in this picture? Aren’t these fun questions? Wouldn’t you love to look at karma with a different eye, rather than the painful ‘eye for an eye’ concept? Relax! Enjoy a book that takes you on a journey of understanding the day-to-day karmic actions that we are all living. Gain a greater insight on a practical yet spiritual level. This helpful tool book will guide you on so many levels. Read one a week, one a day, however you like. Karma is life in action – your life. Look forward to enjoying life more by understanding how to appreciate the perfection of karma in all of our lives. Tina Erwin, CDR, USN, Ret, has studied the spiritual side of life for many years, gaining insight into the interpersonal relationships at the heart of everyday living. These intense studies were further enhanced by the experiences of a dynamic 20-year career in the Navy, working for the U.S. Submarine Force, retiring at the commander level. Erwin currently writes a weekly column on the philosophy of life, called Light Times.","author":[{"family":"Erwin","given":"Tina"}],"citation-key":"ErwinT 2018a","file":"","issued":{"date-parts":[["2018"]]},"title":"The Lightworker's Guide to Everyday Karma","type":"book"},
  {"id":"FGSIHB 1989a","abstract":"Fo Guang Dictionary of Buddhism Translation Project","accessed":{"date-parts":[["2025",7,25]]},"author":[{"literal":"The Fo Guang Shan Institute of Humanistic Buddhism"}],"citation-key":"FGSIHB 1989a","file":"","issued":{"date-parts":[["1989"]]},"language":"en-US","title":"Foguang Dictionary","type":"webpage","URL":"https://foguangdb.fgsihb.org/"},
  {"id":"HookhamS 2006a","abstract":"Drawing from the Tibetan Buddhist tradition of approaching and preparing for death, Lama Shenpen Hookham offers Westerners like herself practical descriptions of the attitudes, the practices, and the considerations that surround our own death, caring for those dying and also care-givers. Of great interest to those seeking a positive yet realistic coming to terms with death, its Buddhist context provides further teaching on the \"Tibetan Books of the Dead,\" one of the most well-known Tibetan texts.","author":[{"family":"Hookham","given":"Shenpen"}],"citation-key":"HookhamS 2006a","event-place":"Cambridge, UK","file":"","ISBN":"978-1-899579-68-6","issued":{"date-parts":[["2006"]]},"language":"English","number-of-pages":"176","publisher":"Windhorse Publications","publisher-place":"Cambridge, UK","title":"There's More to Dying Than Death: A Buddhist Perspective","type":"book"},
  {"id":"HorganJ 2011a","accessed":{"date-parts":[["2025",7,8]]},"author":[{"family":"Horgan","given":"John"}],"citation-key":"HorganJ 2011a","container-title":"Scientific American","file":"","issued":{"date-parts":[["2011"]]},"language":"en","title":"Why I Don't Dig Buddhism","type":"webpage","URL":"https://www.scientificamerican.com/blog/cross-check/why-i-dont-dig-buddhism/"},
  {"id":"HumphreysC 1978a","author":[{"family":"Humphreys","given":"Christmas"}],"citation-key":"HumphreysC 1978a","event-place":"London ; Boston","file":"","ISBN":"978-0-04-921023-3","issued":{"date-parts":[["1978"]]},"language":"English","number-of-pages":"296","publisher":"Allen & Unwin","publisher-place":"London ; Boston","title":"Both Sides of the Circle: Autobiography","title-short":"Both Sides of the Circle","type":"book"},
  {"id":"HumphreysC 1994a","abstract":"Karma, the law of cause and effect, of nature's retribution for lost harmony, and Rebirth, from which it is inseperable, have been described as the oldest doctrine in the world. In today's turmoil, an understanding of Karma is one of the foundations on wh","author":[{"family":"Humphreys","given":"Christmas"}],"citation-key":"HumphreysC 1994a","event-place":"Richmond, Surrey","file":"","ISBN":"978-0-7007-0163-6","issued":{"date-parts":[["1994"]]},"language":"English","number-of-pages":"112","publisher":"Routledge","publisher-place":"Richmond, Surrey","title":"Karma and Rebirth: The Karmic Law of Cause and Effect","title-short":"Karma and Rebirth","type":"book"},
  {"id":"JacksonP 2003a","abstract":"Buddhadasa Bhikkhu (1906–1993) is widely regarded as modern Thailand’s most influential Buddhist philosopher. His thought had a profound intellectual impact in Thailand in the second half of the twentieth century. His life mission was to undertake a complete reexamination of Theravada Buddhist teachings. By returning to the Buddha’s original teachings in the Suttapitaka and by drawing on aspects of Zen Buddhism, Buddhadasa crafted a vision of Thai Buddhism as a socially, politically, and intellectually progressive force. This vision of a modern Theravada Buddhism fit for a modern, democratic, and socially just Thailand continues to inspire large numbers of Thai people in the twenty-first century.In this book Peter Jackson examines Buddhadasa’s life work and thought, placing them in the context of the political, economic, and intellectual changes that transformed Thailand in the twentieth century. Combining biographical studies with critical philosophical and sociological analyses of Buddhadasa’s reforms of Thai Buddhist teachings, Peter Jackson emphasizes the path-breaking and often radical ideas of one of the greatest Buddhist thinkers of the last century. This book is a revised and expanded edition of Peter Jackson’s Buddhadasa: A Buddhist Thinker for the Modern World, published in 1988. It contains a new epilogue tracing the controversy surrounding Buddhadasa’s death in 1993 and reflecting on the philosopher-monk’s lasting legacy in Thailand.","author":[{"family":"Jackson","given":"Peter A."}],"citation-key":"JacksonP 2003a","event-place":"Chiang Mai","file":"","ISBN":"978-974-7551-91-4","issued":{"date-parts":[["2003"]]},"language":"English","note":"IACode: buddhadasatherav0000jack","number-of-pages":"392","publisher":"Silkworm Books","publisher-place":"Chiang Mai","title":"Buddhadasa: Theravada Buddhism and Modernist Reform in Thailand","type":"book"},
  {"id":"LadnerL 2000a","abstract":"The Wheel of Great Compassion is the first book to provide Western readers with a complete understanding of the prayer wheel--an ancient and mystical practice that has long been popular with Buddhists throughout Tibet and Mongolia for its ability to bless the environment, promote healing, increase compassion, and assist practitioners on their journeys to enlightenment. This book offers a clear description of prayer wheel practice, its meaning and benefits, and its role as an essential ritual and symbol of Tibetan Buddhism. It contains a general introduction to the prayer wheel, photographs and illustrations, six commentaries by Tibetan lamas (including Lama Zopa Rinpoche), and instructions for both prayer wheel construction and proper use.","citation-key":"LadnerL 2000a","contributor":[{"family":"Ladner","given":"Lorne"}],"event-place":"Boston, MA","file":"","ISBN":"978-0-86171-174-1","issued":{"date-parts":[["2000"]]},"language":"English","number-of-pages":"168","publisher":"Wisdom Publications","publisher-place":"Boston, MA","title":"Wheel of Great Compassion: The Practice of the Prayer Wheel in Tibetan Buddhism","type":"book"},
  {"id":"LamotteE 1998a","citation-key":"LamotteE 1998a","contributor":[{"family":"Lamotte","given":"Etienne"}],"event-place":"Delhi","file":"","ISBN":"978-81-208-1931-3","issued":{"date-parts":[["1998"]]},"language":"English","number-of-pages":"301","publisher":"Motilal Banarsidass Publications","publisher-place":"Delhi","title":"Suramgamasamadhisutra: The Concentration of Heroic Progress on the Path to Enlightement","type":"book"},
  {"id":"LowranceM 2011a","abstract":"Your Insurance Policy Against The Kind of Divorce Everybody Fears  Divorce does not need to become the defining moment of the rest of your life. Using her insight and expertise as a family-court judge and former divorce attorney, Judge Lowrance presents a revolutionary guide for people facing the turmoil of divorce. The Good Karma Divorce offers concrete and battle-tested advice, real-life examples, no-nonsense tools, and practical checklists. With Judge Lowrance's guidance we can avoid the black hole of litigation and create a good karma divorce, opening up a new world of hope and possibility.","author":[{"family":"Lowrance","given":"Michele"}],"citation-key":"LowranceM 2011a","event-place":"New York","file":"","ISBN":"978-0-06-184071-5","issued":{"date-parts":[["2011"]]},"language":"English","number-of-pages":"256","publisher":"HarperOne","publisher-place":"New York","title":"The Good Karma Divorce: Avoid Litigation, Turn Negative Emotions into Positive Actions, and Get On with the Rest of Your Life","title-short":"The Good Karma Divorce","type":"book"},
  {"id":"LoyD 2008a","abstract":"What's Wrong with Sex?How to Drive Your KarmaConsciousness CommodifiedThe Karma of FoodThe Three Poisons, InstitutionalizedWhy We Love War These are just some of the chapters in this brilliant book from David R. Loy. In little time, Loy has become one of the most powerful advocates of the Buddhist worldview, explaining like no one else its ability to transform the sociopolitical landscape of the modern world. In this, his most accessible work to date, he offers sharp and even shockingly clear presentations of oft-misunderstood Buddhist staples-the working of karma, the nature of self, the causes of trouble on both the individual and societal levels-and the real reasons behind our collective sense of \"never enough,\" whether it's time, money, sex, security... even war. Loy's \"Buddhist Revolution\" is nothing less than a radical change in the ways we can approach our lives, our planet, the collective delusions that pervade our language, culture, and even our spirituality.","author":[{"family":"Loy","given":"David R."}],"citation-key":"LoyD 2008a","event-place":"Somerville","file":"Loy-2008-money,-sex,-war,-karma-notes-for-a-buddhist-revolution.pdf","ISBN":"978-0-86171-558-9","issued":{"date-parts":[["2008"]]},"language":"English","number-of-pages":"160","publisher":"Wisdom Publications,U.S.","publisher-place":"Somerville","title":"Money, Sex, War, Karma: Notes for a Buddhist Revolution","title-short":"Money, Sex, War, Karma","type":"book"},
  {"id":"LukC 1966a","author":[{"family":"Luk","given":"Charles"}],"citation-key":"LukC 1966a","event-place":"London","file":"Luk-1966-surangama-sutra.pdf","ISBN":"978-0-09-075971-2","issued":{"date-parts":[["1966"]]},"language":"English","publisher":"Rider & Company","publisher-place":"London","title":"Surangama Sutra","type":"book"},
  {"id":"LutherM 1526a","author":[{"family":"Luther","given":"Martin"}],"citation-key":"LutherM 1526a","file":"Luther-1526-whether-soldiers,-too,-can-be-saved.pdf","issued":{"date-parts":[["1526"]]},"title":"Whether Soldiers, Too, Can Be Saved","type":"book"},
  {"id":"MahasiSayadaw 2013a","accessed":{"date-parts":[["2025",7,28]]},"author":[{"literal":"Mahasi Sayadaw"}],"citation-key":"MahasiSayadaw 2013a","container-title":"buddhanet.net: Buddhist Education and Information Network","file":"Mahasi Sayadaw-2013-the-theory-of-karma.pdf","issued":{"date-parts":[["2013"]]},"language":"en-US","title":"The Theory of Karma","type":"webpage","URL":"https://www.buddhanet.net/e-learning/karma/"},
  {"id":"McTaggartJ 1916a","author":[{"family":"McTaggart","given":"John"},{"family":"McTaggart","given":"Ellis"}],"citation-key":"McTaggartJ 1916a","event-place":"London","file":"McTaggart and McTaggart-1916-human-immortality-and-pre-existance.pdf","issued":{"date-parts":[["1916"]]},"language":"en","number-of-pages":"126","publisher":"Edward Arnold","publisher-place":"London","title":"Human Immortality and Pre-existance","type":"book"},
  {"id":"Ñāṇamoli 1996a","abstract":"2 Volumes in one book. x + 359 & iii 382 pages : 22 cm.","author":[{"family":"Ñāṇamoli","given":"Bhikkhu"}],"citation-key":"Ñāṇamoli 1996a","collection-number":"XL and XLI","collection-title":"Sacred Books of the Buddhists","event-place":"Bristol","file":"Ñāṇamoli-2018-the-dispeller-of-delusion-1.pdf;Ñāṇamoli-2018-the-dispeller-of-delusion-2.pdf;Sammohavinodanī-pts-pali.pdf","ISBN":"978-0-86013-517-3","issued":{"date-parts":[["1996"]]},"note":"attachment-label:Vol 1,Vol 2;Pali","number-of-volumes":"2","publisher":"Pali Text Society","publisher-place":"Bristol","title":"The Dispeller of Delusion (Sammohavinodani)","type":"book","URL":"https://palitextsociety.org/product/dispeller-of-delusion/","volume":"1 & 2"},
  {"id":"OFlahertyWD 1980a","abstract":"Karma is perhaps the most famous concept in Indian philosophy, but this is the first comprehensive study of its various meanings and philosophical implications. Karma and Rebirth in Classical Indian Traditions offers a harmony of approach and an underlying set of methodological assumptions: a corpus of definitions of karma, a dialectic between abstract theory and historical explanation, and an awareness of logical oppositions in theories of karma. No “solution” to the paradox of karma is offered, but the volume as a whole presents a consistent and encompassing approach to the many different, often conflicting, Indian statements of the problem.   Broad in scope and richly detailed, this book demonstrates the impossibility of speaking of “the theory of karma” and supplies the basis for further study. Exploring methodological issues arising in the study of a non-Western system of soteriology and rebirth, the contributors question the interaction of medical and philosophical models of the human body, the incorporation of philosophical theories into practical religions with which they are logically incompatible, and the problem of historical reconstruction of a complex theory of human life.   This title is part of UC Press’s Voices Revived program, which commemorates University of California Press’s mission to seek out and cultivate the brightest minds and give them voice, reach, and impact. Drawing on a backlist dating to 1893, Voices Revived makes high-quality, peer-reviewed scholarship accessible once again using print-on-demand technology. This title was originally published in 1980.","citation-key":"OFlahertyWD 1980a","editor":[{"family":"O'Flaherty","given":"Wendy Doniger"}],"event-place":"Berkeley Los Angeles London","file":"O'Flaherty-1980-karma-and-rebirth-in-classical-indian-traditions.pdf","ISBN":"978-0-520-30217-4","issued":{"date-parts":[["1980"]]},"language":"English","number-of-pages":"370","publisher":"University of California Press","publisher-place":"Berkeley Los Angeles London","title":"Karma and Rebirth in Classical Indian Traditions","type":"book"},
  {"id":"OlivelleP 1998a","abstract":"This is the full edition of the early Upanisads, the central scriptures of Hinduism. Featuring Patrick Olivelle's acclaimed new English translation (Oxford, 1996), it also includes the complete Sanskrit text, as well as variant readings, scholarly emendations, and explanations of Olivelle's choices of particular readings. The volume also contains a concordance of the two recensions of the Brhadaranyaka Upanisad, and an extensive bibliography.\n             \n             \n              \n            ,  \n             This is the full edition of the early Upanisads, the central scriptures of Hinduism. Featuring Patrick Olivelle's acclaimed new English translation (Oxford, 1996), it also includes the complete Sanskrit text, as well as variant readings, scholarly emendations, and explanations of Olivelle's choices of particular readings. The volume also contains a concordance of the two recensions of the Brhadaranyaka Upanisad, and an extensive bibliography.","citation-key":"OlivelleP 1998a","collection-title":"South Asia Research","contributor":[{"family":"Olivelle","given":"Patrick"}],"event-place":"Oxford, New York","file":"Olivelle_1998_The Early Upanisads.pdf","ISBN":"978-0-19-512435-4","issued":{"date-parts":[["1998"]]},"note":"IACode: TheEarlyUpanisads","number-of-pages":"700","publisher":"Oxford University Press","publisher-place":"Oxford, New York","source":"Oxford University Press","title":"The Early Upanisads: Annotated Text and Translation","title-short":"The Early Upanisads","type":"book","URL":"https://global.oup.com/academic/product/the-early-upanisads-9780195124354?cc=gb&lang=en&"},
  {"id":"OnkomS 1999a","author":[{"family":"Onkom","given":"Sudassa"}],"citation-key":"OnkomS 1999a","event-place":"Bangkok","file":"Onkom-1999-fruit-of-karma.pdf","ISBN":"978-974-8303-29-1","issued":{"date-parts":[["1999"]]},"language":"English","publisher":"Asia Book Corporation Of","publisher-place":"Bangkok","title":"Fruit of Karma","type":"book","volume":"1"},
  {"id":"PaAukTawyaSayadaw 2009a","author":[{"literal":"Pa-Auk Tawya Sayadaw"}],"citation-key":"PaAukTawyaSayadaw 2009a","file":"Sayadaw-2009-the-workings-of-kamma.pdf","issued":{"date-parts":[["2009"]]},"title":"The Workings of Kamma","type":"book","URL":"https://www.paauk.eu"},
  {"id":"PeMaungTin1920a","abstract":"Translation of Atthasālinī  Commentary on the Dhammasaṅgaṇī by Buddhaghosa. (5th century C.E.)  Tr. Pe Maung Tin  2 volumes, 1920, 1921, reprinted as one volume 1976","accessed":{"date-parts":[["2025",9,26]]},"author":[{"literal":"Pe Maung Tin"}],"citation-key":"PeMaungTin1920a","file":"Pe-Maung-Tin-1920-the-expositor-(atthasālīnī)-1.pdf;Pe Maung Tin-1920-the-expositor-(atthasālīnī)-2.pdf","issued":{"season":1,"date-parts":[[1920]]},"note":"attachment-label:Vol1;Vol2","title":"The Expositor (Atthasālīnī): Buddhagosa’s Commentary on the Dhammasaṅgaṇī; The First Book of the Abhidhamma Piṭaka","type":"book","URL":"https://palitextsociety.org/product/the-expositor/"},
  {"id":"Sīlācāra 1939a","abstract":"Mentioned in The Mahabodhi, Vol. 47, p.130, 1939.","author":[{"family":"Sīlācāra","given":"Bhikkhu"}],"citation-key":"Sīlācāra 1939a","event-place":"Calcutta","file":"","issued":{"date-parts":[["1939"]]},"publisher":"Maha-Bodhi Society of India","publisher-place":"Calcutta","title":"Kamma (Karma)","type":"book"},
  {"id":"ThubtenA 2020a","abstract":"Karma is not just the actions we take, but also the states of consciousness we choose.","accessed":{"date-parts":[["2025",7,25]]},"author":[{"family":"Thubten","given":"Anam"}],"citation-key":"ThubtenA 2020a","container-title":"Tricycle: The Buddhist Review","file":"","issued":{"date-parts":[["2020",3,23]]},"language":"en","title":"Karma: Not Just Action","type":"post-weblog","URL":"https://tricycle.org/trikedaily/collective-karma/"},
  {"id":"VisdyasagaraIC 1858a","citation-key":"VisdyasagaraIC 1858a","collection-title":"Bibilotheca Indica","editor":[{"family":"Visdyasagara","given":"Ishwar Chandra"}],"event-place":"Calcutta","file":"Visdyasagara-1858-sarvadarśanasaṁgraha-or-an-epitome-of-the-different-systems.pdf","issued":{"date-parts":[["1858"]]},"number-of-volumes":"142","publisher-place":"Calcutta","title":"Sarvadarśanasaṁgraha or an Epitome of the Different Systems of Indian Philosophy by Madhavacharya","type":"book","volume":"63"},
  {"id":"WilsonI 1981a","author":[{"family":"Wilson","given":"Ian"}],"citation-key":"WilsonI 1981a","file":"","issued":{"date-parts":[["1981"]]},"publisher":"Gollancz","title":"Mind Out of Time: Reincarnation Investigated","type":"book"},
  {"id":"WrightD 2004a","abstract":"In an effort to articulate a naturalized concept of karma for the purposes of contemporary ethical reflection, this article raises four critical questions about the Buddhist doctrine of karma. The article asks (1) about the advisability of linking the concept of karma to assurance of ultimate cosmic justice through the doctrine of rebirth; (2) about the effects of this link on the quest for human justice in the social, economic, and political spheres of culture; (3) about the kinds of rewards that the doctrine of karma attaches to virtuous action, whether they tend to be necessary or contingent consequences; and (4) about the extent to which karma is best conceived individually or collectively. The article ends with suggestions for how a non-metaphysical concept of karma might function and what role it might play in contemporary ethics.","author":[{"family":"Wright","given":"Dale S."}],"citation-key":"WrightD 2004a","container-title":"Journal of Buddhist Ethics","file":"Wright-2004-critical-questions-towards-a-naturalized-concept-of-karma.pdf","issued":{"date-parts":[["2004"]]},"page":"78–93","title":"Critical Questions Towards a Naturalized Concept of Karma in Buddhism","type":"article-journal","volume":"11"}
]
