{
			"Authors" : ["brahm"],
			"BookTitle" : "Opening Up to Kindfulness",
			"BookSubtitle" : "Buddhism: discovering the basics",
			"ShortAbstract" : "<p>Ajahn Brahm helps us to discover the basic elements of Buddhism. Showing how mindfulness must be infused with compassion and softness in the Buddhas teachings. He teaches the development of loving-kindness and how to adopt the best view in any circumstance. Taking us through three fundamental teachings of Buddhism: ‘Nothing Lasts’, ‘Suffering’ and ‘Nobody There’, he then explains the law of kamma, how to develop the ability to listen and finally how to dealing with addictions.</p>",
			"Abstract" : "<p>None</p>",
			"ItemType" : "book",
			"AddInfo"   : [],
			"Copyright" : ["This first edition published in 2021 by Wisdom &amp; Wonders Books.","Copyright © Ajahn Brahmavamso 2021.","Find more information on Ajahn Brahm at <a href='https://bswa.org/'><span data-custom-style='Hyperlink'>bswa.org</a>"],
			"CCLicense": "CC0 4.0",
			"FrontCover": "../_resources/book-data/outk/FrontLarge.jpg",
			"BackCover": "../_resources/book-data/outk/BackLarge.jpg",
			"BackMatter": ["<p><em>“Kindfulness goes across all faiths and cultures, creating peace and harmony, breaking barriers between people.”</em></p><p>Ajahn Brahm was born in London in 1951. At age sixteen, he began regarding himself as Buddhist and his interest in Buddhism flourished while studying theoretical physics at Cambridge University.</p><p>He was ordained as a monk at twenty-three and spent nine years training in the Thai forest meditation tradition under the renowned meditation master Venerable Ajahn Chah.</p><p>In 1983, Ajahn Brahm came to Australia to help establish a monastery near Perth. He is now the abbot of Bodhinyana Monastery and the spiritual director of the Buddhist Society of Western Australia and many others in Australia and overseas.</p><p>Ajahn Brahm serves not only people in Australia but international communities, giving talks and retreats around the world.</p><p>In 2004, he was awarded the John Curtin Medal for vision, leadership, and community services. In 2019, Ajahn Brahm was awarded the Order of Australia, General Division medal, for services to Buddhism and gender equality.</p>"],
			"DownloadsAvailable": "pdf=yes,epub=yes,azw3=yes",
			"DownloadHTML": ""
		}