{
    "Document" : "Reading the Buddha's Discourses in Pali: A Practical Guide to the Language of the Ancient Buddhist Canon",
    "Author" : "Bhikkhu Bodhi",
    "Section" : "6. The Unconditioned: The Goal",
    "SubSection" : "",
    "Title" : "Introduction",
    "Quote": "<p>THE THEME OF this chapter is the unconditioned (<em>asaṅkhata</em>), a word often used as a designation for nibbāna. Whereas the cessation aspect of dependent origination included in chapter 4 shows the goal of the Dhamma through a series of negations, the present chapter shows the goal more directly and explicitly under thirty-two epithets, including nibbāna. As is characteristic of the Nikāyas, the goal is still described largely in negative terms: as the unconditioned, uninclined, unaging, undisintegrating, and so forth. Even the definition of the unconditioned as “the destruction of lust, the destruction of hatred, the destruction of delusion” has a negative ring.</p> <p>When nibbāna is described as the destruction of lust, hatred, and delusion, this naturally gives rise to the question whether it is simply the eradication of defilements or some transcendent state or dimension. A sutta in the Itivuttaka (§44) speaks of two “elements of nibbāna.” The element of nibbāna with residue remaining (<em>saupādisesā nibbānadhātu</em>) is defined as the arahant’s destruction of lust, hatred, and delusion. And about the element of nibbāna without residue remaining (<em>anupādisesā nibbānadhātu</em>), the text merely says that for the arahant, “all feelings, not being delighted in, will become cool right here.”<sup>244</sup> These two nibbāna elements are considered to represent nibbāna during life and nibbāna attained with the passing away of the arahant, and in both cases their characterization here seems negative. But other suttas speak of nibbāna as a state that is unborn, unproduced, unbecome, and unconditioned, or as a base where none of the conditioned phenomena of the world are to be found.<sup>245</sup> Such descriptions, while cryptic and still expressed by way of negations, point to nibbāna as a transcendent, ever-existent state that makes possible liberation from the round of birth and death.</p> <p>In any case, in the suttas that constitute this chapter of the Saṃyutta Nikāya, the stress is not on a theoretical understanding of nibbāna but on the path that leads to the final goal. The path is shown by taking first the term “unconditioned” to represent the aim of practice and then highlighting the path from different angles. The opening sutta proclaims mindfulness of the body to constitute the path. This sutta is then expanded upon in two steps. At the first step, it is elaborated upon by taking ten other sets of factors collectively as the way to the unconditioned. The ten are: (1) serenity and insight; (2) three kinds of concentration — that associated with thought and examination, that partly dissociated from them, and that fully dissociated from them;<sup>246</sup> (3) the emptiness, signless, and wishless concentrations; (4) the four establishments of mindfulness; (5) the four right strivings; (6) the four bases for spiritual power; (7) the five spiritual faculties; (8) the five powers; (9) the seven factors of enlightenment; and (10) the noble eightfold path. Each set constitutes a separate sutta.</p> <p>Hence, including mindfulness directed to the body, we obtain eleven suttas, SN 43:1–11. The next sutta, SN 43:12, contains forty-five subdivisions. Here, serenity and insight are treated separately as the path to the unconditioned, and then each factor within the above-mentioned groups is treated as a distinct path to the unconditioned. Thus serenity and insight constitute two suttas, while the two sets of three concentrations give us six more. When we add these to the thirty-seven aids to enlightenment bundled into the seven groups, we obtain a total of forty-five suttas laying out the way to the unconditioned.</p> <p>This entire pattern is then applied to the goal described by thirty-one other epithets, from the uninclined (<em>anata</em>) down to the destination (<em>parāyaṇa</em>). Since the path leading to the destination begins with mindfulness directed to the body, this means that fifty-six versions of the path (the eleven of 45:1–11 plus the forty-five of 45:12) are to be conjoined with each of the following thirty-one epithets of nibbāna for a total of 1,736 suttas. All printed editions of this chapter severely compress the presentation of the material, but it is possible that in the era when oral recitation prevailed, reciters would recite each sutta in full.</p>",
    "ZotRef" : "Bodhi 2021a"
}