{
	"Authors": "Bhikkhu Sujato",
	"BookTitle": "A History of Mindfulness",
	"BookSubtitle": "How tranquillity worsted insight in the Satipaṭṭhāna Sutta",
	"AddInfo": [],
	"Copyright": [
		"Originally published by The Corporate Body of the Buddha Education Foundation, Taiwan, **2007**.",
		"The revised edition (pdf) published in **2012** by Santipada.",
		"Copyright © Bhikkhu Sujato 2012.<br>396pp (in pdf format).",
		"ISBN: 978-1-921842-13-9"
	],
	"CCLicense": "<div class='cclicense'><h3>Attribution-NonCommercial-NoDerivatives 4.0 International <span>(CC BY-NC-ND 4.0)</span></h3><div id = 'ccDetail'><p>You are free to:</p><ul><li><strong>Share</strong> — copy and redistribute the material in any medium or format</li></ul><p>Under the following terms:</p><ul><li><strong>Attribution</strong> — You must give appropriate credit, provide a link to the license, and indicate if changes were made. You may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.</li><li><strong>NonCommercial</strong> — You may not use the material for commercial purposes.</li><li><strong>NoDerivatives</strong> — If you remix, transform, or build upon the material, you may not distribute the modified material.</li><li><strong>No additional restrictions</strong> — You may not apply legal terms or technological measures that legally restrict others from doing anything the license permits.</li></ul><p><strong>Notices:</strong></p><p>You do not have to comply with the license for elements of the material in the public domain or where your use is permitted by an applicable exception or limitation.</p><p>No warranties are given. The license may not give you all of the permissions necessary for your intended use. For example, other rights such as publicity, privacy, or moral rights may limit how you use the material.</p></div></div>",
	"FrontCover": "../_resources/book-data/ahom/FrontLarge.jpg",
	"BackCover": "../_resources/book-data/ahom/BackLarge.jpg",
	"BackMatter": [
		"The Satipaṭṭhāna Sutta is the most influential scripture in Buddhist meditaion. It is the foundation text for the modern schools of ‘vipassanā’ or ‘insight’ meditation. The well-known Pali discourse is, however, only one of many early Buddhist texts that deal with mindfulness. This is the first full-scale study to encompass all extant versions of the Satipaṭṭhāna Sutta, taking into account the dynamic evolution of the Buddhist scriptures and the broader Indian meditative culture. A new vision emerges from this groundbreaking study: mindfulness is not a system of ‘dry insight’ but is the ‘way to convergence’ leading the mind to deep states of peace.",
		"Bhikkhu Sujato is a Buddhist monk. Since taking higher ordination in Thailand in 1994 he has lived in monasteries and hermitages devloping meditation and studying the Buddha’s teachings. In 2003 he established Santi Forest Monastery near Sydney, Australia."
	],
	"AuthorsData": [
		{
			"ShortName": "Bhikkhu Sujato",
			"InfoImage": "../_resources/author-data/sujato/info.jpg",
			"ShortBio": [
				"Bhante Sujato was born in Perth and raised in a liberal Catholic family. ",
				"After dropping out of University he became a musician. ",
				"In 1992 he travelled to Thailand in search of a new direction. ",
				"He entered an intensive meditation retreat at Wat Ram Poeng in Chieng Mai. ",
				"A year later, he ended up at Wat Nanachat, where he took novice ordination and, on May 5, 1994, full ordination as a bhikkhu in the forest lineage of Ajahn Chah. ",
				"In 2005, he co-founded the Buddhist website SuttaCentral along with Rod Bucknell and John Kelly, to provide access to early Buddhist texts in their original language and make translations available in modern languages"
			]
		}
	]
}