["<h3>Jambudīpa</h3><p>One of the four great continents (<em>mahādīpa</em>), which are included in the Cakkavāḷa and are ruled by a Cakkavatti. They are grouped round Mount Sineru. In Jambudīpa is Himavā with its eighty-four thousand peaks, its lakes, mountain ranges, etc. This continent derives its name from the rose-apple tree (Jambu, also called Naga) that grows there, its trunk fifteen leagues in girth, its outspreading branches fifty leagues in length, its shade one hundred leagues in extent and its height one hundred leagues.¹ On account of this tree, Jambudīpa is also known as Jambusanda.² The continent is ten thousand leagues³ in extent; of these ten thousand, four thousand are covered by the ocean, three thousand by the Himavā mountains, while three thousand are inhabited by men.⁴</p><p>Sometimes in Jambudīpa there are as many as eighty-four thousand cities; this number is sometimes reduced to sixty thousand, forty thousand, or even twenty thousand, but never to less.⁵ In the time of Asoka there were eighty-four thousand cities, in each of which he built a monastery.⁶ In the Aṅguttaranikāya⁷ it is said that, in Jambudīpa, trifling in number are the parks, groves, lakes, etc., more numerous the steep, precipitous places, unfordable rivers, inaccessible mountains, etc.</p><p>At the time of Metteyya Buddha’s appearance on earth Jambudīpa will be pervaded by mankind even as a jungle is by reeds and rushes. There will be eighty-four thousand cities with Ketumātī (Bārāṇasī) at the head.⁸</p><p>The Buddha once declared that the people of Jambudīpa excel those of both Uttarakuru and Tāvatiṃsa in three respects — courage, mindfulness and religious life.⁹ Buddhas (and Cakkavattis) are born only in Jambudīpa.¹⁰</p><p>There were four sounds heard throughout Jambudīpa:</p><ol><li>the shout uttered by Punnaka proclaiming his victory over Dhanañjaya Koravya in a game of dice;</li><li>the bark of Vissakamma when taken about in the guise of a dog by Sakka, threatening to devour all wicked beings after the decay of Kassapa’s sāsana;</li><li>the roar of Kusa, challenging to battle the seven kings who sought the hand of Pabhāvatī;</li><li>the yell of Āḷavaka, proclaiming his name from the top of mount Kelāsa, on hearing that the Buddha had visited his abode.¹¹</li></ol><p>When opposed to Sīhaladīpa or Tambapaṇṇidīpa, Jambudīpa indicates the continent of India.¹²</p><p>For the purposes of wandering on tour (cārikā), the monks divided their tours in Jambudīpa into three circuits or maṇḍalas — the Mahāmaṇḍala which extended over nine hundred leagues, the Majjhima which extended over six hundred, and the Antima over three hundred. Those who wish to tour the first, start after the mahāpavāraṇa and complete their journey in nine months, for the Majjhimamaṇḍala they start after the Pavāraṇa, on the full-moon day of Kattika, completing the tour in nine months, while for the Antimamaṇḍala they start on the first day of Phussa and return after seven months.¹³</p><p>In each Cakkavāḷa there is a Jambudīpa.¹⁴ Mention is made in the Kākavatī Jātaka¹⁵ of a Jambudīpa-samudda, beyond which was the river Kebuka.</p><br><h3>Footnotes</h3><p>¹ Vin.i.30; SNA.ii.443; Vism.i.205 f; Sp.i.119, etc.<br>² SN.vs.552; SNA.i.121.<br>³ A league (yojana) is a day’s journey, and is estimated to be between eight and twelve miles. Clearly, the continent of India is not 10,000 leagues, or about 100,000 miles in extent (ed).<br>⁴ SNA.ii.437; UdA.300.<br>⁵ SNA.i.59; J.iv.84 says sixty-three thousand; PvA.111.<br>⁶ Mhv.v.176; Vism.201.<br>⁷ A.i.35.<br>⁸ D.iii.75.<br>⁹ A.iv.396; Kvu.99.<br>¹⁰ BuA.48; MA.ii.917.<br>¹¹ SA.i.248, etc.<br>¹² E.g., Mhv.v.13; xiv.8; Cv.xxxvii.216, 246.<br>¹³ Sp.i.197.<br>¹⁴ A.i.227.<br>¹⁵ J.iii.91.</p>"]