{"Authors":"Ajahn Brahm","BookTitle":"Wisdom of Silence","BookSubtitle":"","AddInfo":[["Preface","This revised edition is produced not only in print but also in an electronic format in order that this valuable insight will be more readily available and accessible, reaching a wider audience.","*Bodhinyana Volunteer Team<br>Rains Retreat 2018*"]],"Copyright":["Revised edition originally published in **2018**","This edition published in **2022** by Wisdom & Wonders is based on the 2018 edition with typographic corrections and sutta reference links to SuttaCentral","54pp (in pdf format).","Copyright © Ajahn Brahmavamso 2018, 2022","Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International (CC BY-NC-SA 4.0)","You are free to:","**Share—** copy and redistribute the material in any medium or format","**Adapt—** remix, transform, and build upon the material","Under the following terms:","**Attribution—** You must give appropriate credit, provide a link to the license, and indicate if changes were made. You may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.","**NonCommercial—** You may not use the material for commercial purposes.","**ShareAlike—** If you remix, transform, or build upon the material, you must distribute your contributions under the same license as the original.","**No additional restrictions—** You may not apply legal terms or technological measures that legally restrict others from doing anything the license permits.","For enquiry about the book or Ajahn Brahm, please contact bswa.org"],"FrontCover":"../_resources/book-data/wosb/FrontLarge.jpg","BackCover":"","BackMatter":[],"AuthorsData":[{"ShortName":"Ajahn Brahm","InfoImage":"../_resources/author-data/brahm/info.jpg","ShortBio":["Ajahn Brahmavamso Mahathera was born in London in 1951. ","After graduating from Cambridge he taught in a school for one year before travelling to Thailand to train with Ajahn Chah. ","After practising for nine years as a monk in Thailand, he was sent to Perth, Australia by Ajahn Chah in 1983. ","He is Abbot of Bodhinyana monastery, Spiritual Director of the BSWA and a number of other Buddhist Societies and projects world-wide."]}]}