{
    "Document" : "Elucidator of the Supreme Meaning (Paramatthajotikā II)",
    "Author" : "Bhikkhu Bodhi <em>(tr.)</em>",
    "Section" : "i. The Chapter on the Serpent",
    "SubSection" : "12. The Muni (Muni Sutta)",
    "Title" : "#209",
    "Quote": "<p>In the third verse, <strong>having comprehended</strong>: having considered, having demarcated, having investigated, having known as it really is. The meaning is: “having fully understood by the full understanding of suffering.” The grounds: those things to which this world is so attached, the sites of the defilements analyzed into the aggregates, sense bases, and elements. <strong>Having crushed the seed</strong>:<sup>878</sup> having crushed, having damaged, having smashed the volitionally active consciousness, which is the seed of those grounds.<sup>879</sup> The meaning is: “having abandoned by abandoning through eradication.” <strong>He would not nurture it with moisture</strong>: When that seed is moistened with the moisture (affection)<sup>880</sup> of craving and views, it might produce, by way of future conception, the “crops” of the aforesaid bases. He would not nurture it with that moisture (affection). The meaning is: “by the development of the path opposed to it, he would not let that moisture (affection) enter it.”</p><p><strong>Truly, that muni, a seer of the final end of birth: </strong>By the realization of nibbāna, that Buddha-muni has seen nibbāna, the end of birth and death, and is therefore a seer of the final end of birth. <strong>Having abandoned thought, he cannot be reckoned</strong>: By this development of the four truths, having abandoned the nine classes of unwholesome thoughts,<sup>881</sup> having attained the nibbāna element with residue remaining, he goes about acting for the good of the world, until eventually, with the perish- ing of the final consciousness, he reaches the nibbāna element without residue remaining. Then he cannot be designated as “a deva or a human being.” Or else, whereas one who has not attained final nibbāna has not abandoned sensual thoughts and other such thoughts, and is therefore designated thus, “This person<sup>882</sup> is lustful” or “full of hate,” one who has abandoned such thoughts cannot be so designated. The meaninghere can also be seen in this way. [258]</p>"
}

