{
    "Document" : "Mindfulness, Bliss, and Beyond",
    "Author" : "Ajahm Brahm",
    "Section" : "Part I:  The Happiness of Meditation",
    "SubSection" : "8. The Four Focuses of Mindfulness",
    "Title" : "Mind Contemplation - The Nature of Citta",
    "Quote": "<p>When you sustain superpower mindfulness on the pure citta, the nature of all types of consciousness reveals itself. You see consciousness not as a smoothly flowing process but as a series of discrete, isolated events. Consciousness may be compared to a stretch of sand on a beach. Superficially the sand looks continuous over several hundred meters. But after you investigate it closely, you discover that it is made up of discrete, isolated particles of silicate. There are empty spaces between each particle of sand, with no essential sandiness flowing in the gap between any two particles. In the same way, that which we take to be the flow of consciousness is clearly seen to be a series of discrete events, with nothing flowing in between.</p><p>Another analogy is the fruit salad analogy. Suppose on a plate there is an apple. You clearly see this apple completely disappear and in its place appears a coconut. Then the coconut vanishes and in its place appears another apple. Then the second apple vanishes and another coconut is there. That vanishes and a banana appears, only to vanish when another coconut manifests on the plate, then another banana, coconut, apple, coconut, mango, coconut, lemon, coconut, and so on. As soon as one fruit vanishes, then a moment later a completely new fruit appears. They are all fruits but completely different varieties, with no two fruits the same. Moreover, no connecting fruit-essence flows from one fruit to the next. In this analogy, the apple stands for an event of eye consciousness, the banana for an incident of nose consciousness, the mango for taste consciousness, the lemon for body consciousness, and the coconut for mind consciousness. Each moment of consciousness is discrete, with nothing flowing from one moment to the next.</p><p>Mind consciousness, the “coconut,” appears after every other species of consciousness and thereby gives the illusion of sameness to every conscious experience. To the average person, there is a quality in seeing that is also found in hearing, smelling, tasting, and touching. We can call that quality “knowing.” However, with superpower mindfulness, you will discern that this knowing is not part of seeing, hearing, and so on, but arises a moment after each type of sense consciousness. Moreover, this knowing has vanished when, for example, eye consciousness is occurring. And eye consciousness has vanished when knowing (mind consciousness) is occurring. In the simile of the fruit salad, there can’t be an apple and a coconut on the plate at the same time.</p>",
    "ZotRef" : "Brahm 2006a"
}

