{
    "Document" : "Mindfulness, Bliss, and Beyond",
    "Author" : "Ajahm Brahm",
    "Section" : "Part II:  To Bliss and Beyond",
    "SubSection" : "14. Enlightenment: Entering the Stream",
    "Title" : "Making Something Out of Nothing",
    "Quote": "<p>As I’ve just noted, some people are so attached to existence that they see nibbāna as a kind of retirement home for the one who knows. Such people will assume “nowhere” to be a place name, “emptiness” to be a precious solid entity, and “cessation” to be the beginning of something wonderful. They try to make something out of nothing.</p><p>It is a problem with language that when we describe what a thing is not, what qualities are absent, then the negation or the absence can easily be misunderstood as a thing in itself. For example, in Lewis Carroll’s <em>Through the Looking Glass</em>,<sup>26</sup> the White King asks Alice whether she could see either of his messengers on the road. “I see nobody on the road,” said Alice. “I only wish I had such eyes,” the king remarked in a fretful tone, “To be able to see Nobody! And at that distance too! Why, it’s as much as I can do to see real people, by this light!” Then, after a messenger did arrive, the king asked him, “Who did you pass on the road?” “Nobody,” said the messenger. “Quite right,” said the king, “this young lady saw him too. So of course Nobody was slower than you.” “I do my best,” the messenger said in a sullen tone, “I’m sure nobody walks much faster than I do!” “He can’t do that,” said the king, “or else he’d have been here first.”</p><p>There is a similar story in Buddhism, regarding an early episode in the life of the great disciple of the Buddha, Anuruddha. As a result of a great act of good kamma in one of Anuruddha’s previous existences, in this life he would always receive the goods he wanted (Dhp-a 5:17). One day, the young Anuruddha was playing at marbles with his friends and gambling the contents of his lunch basket on the result. Unfortunately, he kept on losing until he had no lunch left. Being from a very wealthy family, he ordered his servant to take his lunch basket back home and bring back some more cakes. Soon after the servant returned, he lost these cakes too. So, for a second time the servant was sent back home for more food, and a second time Anuruddha lost the cakes gambling at marbles. He ordered the servant a third time to take the basket back to his house and ask his mother for some more cakes. However, by now his mother had run out of cakes. So she instructed the servant to return to her son with the empty lunch basket and tell Anuruddha, “<em>Natthi</em> cakes!” <em>Natthi</em> is the Pāli word for “there isn’t any.”</p><p>While the servant was taking the empty basket back to Anuruddha, the <em>devas</em> (heavenly beings) realized that if they didn’t intervene, Anuruddha would not receive something he wanted. Since this could not happen because of the good kamma Anuruddha had done in a previous life, the devas secretly inserted some heavenly cakes into the empty basket.</p><p>When the servant arrived, he handed the basket to his young master, saying, “Natthi cakes, sir!” But when Anuruddha opened the basket, the aroma of the heavenly cakes was so enticing that he couldn’t resist trying one. They were so delicious that he asked his mother to give him only natthi cakes from then on.</p><p>In truth, “natthi cakes,” when devas don’t get involved, means no cakes at all. Just as <em>ajātaṁ,</em> when wishful thinkers don’t get involved, means nothing born at all, <em>abhūtaṁ</em> means nothing come to be, <em>akataṁ</em> means the absence of anything made, and <em>asankhataṁ</em> means the absence of anything conditioned, which four Pāli terms are famous synonyms for nibbāna in the <em>Udāna</em> (Ud 8,3). Translators add an unwarranted spin when they render these negatives (indicated by the privative prefix <em>a</em>- in Pāli) as if there were something there, by translating them as “the unborn,” “the unoriginated,” “the uncreated,” “the unconditioned,” much as the White King takes “nobody” to be a person’s name.</p>",
    "ZotRef" : "Brahm 2006a"
}