{
    "Document" : "Mindfulness, Bliss, and Beyond",
    "Author" : "Ajahm Brahm",
    "Section" : "Part II:  To Bliss and Beyond",
    "SubSection" : "13. The Deep Insight That Liberates",
    "Title" : "Remembering Past Lives",
    "Quote": "<p>ACCORDING TO THE ACCEPTED ACCOUNT of the Buddha’s enlightenment under the Bodhi tree, having empowered his mind by entering the jhānas, the very first area of deep insight to which he applied his mind was the question of past lives. Thus, according to the “map” found in the suttas, this is a valid place to begin in order to gain deep insight.</p><p>Much discussion is heard in modern Buddhist circles regarding the validity of past lives. Unfortunately, many of these views are misinformed, mistaken, or devoid of any deep insight. An investigation into the earliest Buddhist suttas clearly shows that rebirth is not simply a “cultural addition,” as some would have us believe, but instead that rebirth forms a central pillar of the Buddha’s deep insight. For instance, the standard definition by the Buddha for one who has wrong view is one who does not believe in kamma and rebirth (MN 117,5). More emphatically, the Buddha said in the <em>Apaṇṇaka Sutta</em> (“The Incontrovertible Teaching”; MN 60,8), “Since there actually is another world [rebirth], one who holds the view ‘there is no rebirth’ has wrong view.”<sup>11</sup></p><p>Skeptics rightly demand to know how one can verify for oneself, here and now, that rebirth is a truth. I will explain how verification is done, that is, how one penetrates to one of the life-changing deep insights: that which sees one’s past lives.</p><p>One evening, while emerging from a very peaceful meditation, I gave a simple, clear instruction to my mind: What is my earliest memory? Then I returned to inner silence, not expecting a thing, alert to the content of the present moment.</p><p>A few moments later, a familiar smell came to my nose. I was not imagining the smell; I was reexperiencing it clearly in the present moment. Along with the smell came the eerie but certain recollection that this was the smell of my pram when I was a baby. Immediately it was as if I was back in my pram, reexperiencing the world of a newly born infant in all its details. I couldn’t help smiling at seeing with my inner eye one of my favorite toys of that time, a cute blue toy pig my mother called Porky, which rattled when she walked it for me. With extraordinary precision and ease, I was remembering details of the life of a newly born infant, while sitting in the body of a forty-plus-year-old monk. The whole event was accompanied by an extraordinary sense of certainty that there was not the slightest doubt that this baby was me over forty years ago. It totally surprised me and changed the way I understood memory. As a matter of interest, I later found out from a medical doctor that the first sense that develops in a newborn child is the sense of smell. A baby recognizes its mother and other familiar things, like its own pram, by their smell. I can confirm this from my own direct experience.</p><p>When one understands the method to access early memories, one can continue by suggesting clearly to one’s mind, “Earlier, please.” Then one returns to inner stillness with no expectations, quietly attending to the present moment. If the previous state of samādhi was deep enough, another memory will come. If it comes, it comes quickly, effortlessly, and if it is a genuine early memory, it is always accompanied by the extraordinary sense of certainty, that this was from an earlier time. If there is the slightest of doubt, the memory can’t be trusted and is probably wishful thinking.</p><p>Some of my students have reexperienced themselves within their mother’s womb, floating in the waters, warm and contained. Some reexperience even stranger memories, being a person much older than they are now, in another body at another place in a time long ago. The realization is shocking but unavoidable, that this was them in a previous life.</p><p>These recollections generated by jhāna are substantially clearer than what we normally call memory, and they are totally different from what we call fantasy. They occur only in states of heightened awareness, where one’s clarity of perception is greatly enhanced, both of which produce the unique feature of certain recognition of the identity involved.</p><p>Moreover, often these early memories are so disturbing that they cannot be the products of wishful thinking. One student, remembering her first weeks as a newborn infant, looked up at the woman who was lovingly cradling her and was alarmed to see the features of a woman so different from those of the person she knew as her mother. Had she been adopted? Was there something her mother hadn’t told her? At the first opportunity she confronted the person that she had called her mom for as long as she knew, and asked her bluntly if she really was her biological mother. Her mother, taken aback, first inquired why she was asking this question. When the mother was told of the meditation-induced memory, she asked my student to describe the woman that she had seen in her meditation. With ease, and in great detail, my student described that woman’s features. Her mother smiled as she recognized the description immediately. For that woman was the nanny that her mother had hired in the first weeks of her life. The mother was amazed that her daughter could remember this woman so accurately. And the daughter was relieved that her mom was her mom.</p><p>Some memories are even more disturbing, for they recall one’s own death in a past life. Some students have found this so unpleasant that they have recoiled from the memory after only a few seconds. It is to be noted that one’s previous death is the past-life event closest in time to our present existence, and the commonly intense experience leaves an indelible scar. It takes the fearlessness generated by samādhi to watch this harrowing event and then go beyond, back to earlier times. It takes a commitment to truth. Its unpleasantness proves beyond doubt that these are not wishful fantasies but accurate and shocking recollections of real events from one’s past life.</p><p>These recollections of past lives qualify as deep insight for four reasons. First, the Buddha called them the first of the “threefold knowledges” <em>(tevijjā)</em> (MN 91,33) leading to enlightenment. And in the <em>Sekha Sutta</em> (MN 5 3,20), the Buddha likened the recollection of one’s past lives to the first breaking out of a hen’s chicks from their eggs. Second, they arise only after an experience of jhāna, just as the seeing of things as they truly are <em>(yathā bhūta ñāṇadassana)</em> happens only after jhāna (AN VII,61). Third, the recollection of past lives is based on personal experience here and now, and not on beliefs, traditions, or inferences. Fourth, these recollections change one’s whole life. One experiences a great paradigm shift. For instance, the fear of one’s own death and grief over other people’s deaths are immensely diminished. The present life is now viewed from another perspective. One has the “big picture,” as they say, the whole jigsaw puzzle rather than one tiny piece called the years of this life. Most important, only now has one received the raw data from one’s own widened experience to truly appreciate what the Buddha means by <em>dukkha,</em> or suffering. One will understand why the Buddha’s wisest disciple, Sāriputta, said: “Getting reborn again is the meaning of dukkha, ending rebirth is the meaning of happiness!” (AN X,65).</p>",
    "ZotRef" : "Brahm 2006a"
}

