[
  {"id":"AgrawalaVS 1953a","author":[{"family":"Agrawala","given":"Vasudeva Sharan"}],"citation-key":"AgrawalaVS 1953a","file":"Agrawala-1953-india-as-known-to-panini.pdf","issued":{"date-parts":[["1953"]]},"language":"en","publisher":"University of Lucknow","title":"India as Known to Panini: A Study of Cultural Material in the Ashṭādbyāyi","title-short":"India as Known to Panini","type":"book"},
  {"id":"AliD 2004a","abstract":"Scholars have long studied classical Sanskrit culture in almost total isolation from its courtly context. This book focuses exclusively on the royal court as a social and cultural institution. Using both literary and inscriptional sources, it begins with the rise and spread of royal households and political hierarchies from the Gupta period (c.350–750), and traces the emergence of a coherent courtly worldview which would remain stable for almost a millennium to 1200. Later chapters examine key features of courtly life such as: manners, ethics, concepts of personal beauty, and theories of disposition. The book ends with a sustained examination of the theory and practice of erotic love in the context of the wider social dynamics and anxieties which faced the people of the court.","author":[{"family":"Ali","given":"Daud"}],"citation-key":"AliD 2004a","collection-number":"10","collection-title":"Cambridge Studies in Indian History and Society","edition":"Illustrated edition","event-place":"Cambridge","file":"","ISBN":"978-0-521-81627-4","issued":{"date-parts":[["2004"]]},"language":"English","note":"IACode: courtlyculturepo0000alid","number-of-pages":"318","publisher":"Cambridge University Press","publisher-place":"Cambridge","title":"Courtly Culture and Political Life in Early Medieval India","title-short":"Courtly Culture and Political Life in Early Medieval India","type":"book"},
  {"id":"AllenC 2008a","abstract":"This book offers a true account of the scandal that enveloped the discovery in 1898 of an inscribed cascet said to contain the ashes of the Buddha, set against the background of the high noon of the British Raj.In January 1898 a British landowner, William Claxton Peppe, excavated a large Buddhist brick stupa on his estate close to India's border with Nepal. At a depth of 24 feet he uncovered a huge stone coffer, within which were a number of reliquary vases together with a mass of jewels and gold offerings. The opening of the Piprahwa stupa followed on from the discovery nearby of the birthplace of the Buddha (Lumbini) and the legendary city (Kapilavastu) where he had grown into manhood as Prince Sidhartha, but what made this discovery so important was an inscription found on the top of one of the reliquary cascets - declaring it to contain ashes of the Buddha left there by members of his own Sakya clan.This news aroused world-wide interest, not least in the Buddhist world, since no other so well authenticated relics of the Buddha had ever been found. But almost immediately it became known that a German archaeologist, Dr Anton Fuhrer, working nearby at the same time had not only made bogus claims and faked his results but had also been associated with the dig. Fuhrer was quickly unmasked by a British magistrate who himself had a stake in the excavation.Renowned India expert Charles Allen tells the story, weaving in the results of a conference held at Harewood House in June 2006 on the validity of the Piprahwa dig and considering the results of recent carbon dating.","author":[{"family":"Allen","given":"Charles"}],"citation-key":"AllenC 2008a","edition":"UK First Edition","event-place":"London","file":"","ISBN":"978-1-905791-93-4","issued":{"date-parts":[["2008",10,29]]},"language":"English","number-of-pages":"300","publisher":"Haus Publishing Limited","publisher-place":"London","title":"The Buddha and Dr Fuhrer: An Archaeological Scandal","title-short":"The Buddha and Dr Fuhrer","type":"book"},
  {"id":"AlmondPC 1988a","abstract":"This book examines the British discovery of Buddhism during the Victorian period. It was only during the nineteenth century that Buddhism became, in the western mind, a religious tradition separate from Hinduism. As a result, Buddha emerged from a realm of myth and was addressed as a historical figure. Almond's exploration of British interpretations of Buddhism - of its founder, its doctrines, its ethics, its social practices, its truth and value - illuminates more than the various aspects of Buddhist culture: it sheds light on the Victorian society making these judgements.","author":[{"family":"Almond","given":"Philip C."}],"citation-key":"AlmondPC 1988a","event-place":"Cambridge ; New York","file":"Almond-1988-the-british-discovery-of-buddhism.pdf","ISBN":"978-0-521-35503-2","issued":{"date-parts":[["1988"]]},"language":"English","number-of-pages":"200","publisher":"Cambridge University Press","publisher-place":"Cambridge ; New York","title":"The British Discovery of Buddhism","type":"book"},
  {"id":"Altekar-Mishra 1959a","author":[{"family":"Altekar","given":"Anant Sadashiv"},{"family":"Mishra","given":"Vijayakanta"}],"citation-key":"Altekar-Mishra 1959a","file":"Altekar-Mishra-1959-report-on-kumrahar-excavations.pdf","issued":{"date-parts":[["1959"]]},"language":"en","number-of-pages":"350","publisher":"K. P. Jayaswal Research Institute","source":"Books","title":"Report on Kumrahar Excavations, 1951-1955","type":"book"},
  {"id":"Analayo 2011a","abstract":"A thorough examination of each discourse in the Majjhima-nikāya in the light of its parallels.\nIn this thousand-page tome, Bhikkhu Analayo goes systematically through the MN, one sutta at a time, and explains how the Pāli text differs (or not) from its parallels preserved in Sanskrit, Chinese and Tibetan. Perhaps surprisingly, they don’t differ all that much, though in some places the differences do shed light on the original teaching and shows what kinds of changes occurred to the texts during the process of transmission.\nThe book begins and ends with Bhikkhu Analayo’s reflections on the EBTs and the process of oral transmission, and while the book could certainly be read cover-to-cover, the primary way to use this book is as a reference work alongside the Majjhima Nikaya.","author":[{"family":"Anālayo","given":"Bhikkhu"}],"citation-key":"Analayo 2011a","file":"Anālayo_2011_A Comparative Study of the Majjhima-nikāya.pdf;Anālayo_2011_A Comparative Study of the Majjhima-nikāya2.pdf","issued":{"date-parts":[["2011"]]},"language":"en","note":"attachment-label:Vol1;Vol2","publisher":"Dharma Drum Publishing Corporation","title":"A Comparative Study of the Majjhima-nikāya","type":"document","URL":"https://www.chancenter.org/chanctr/ddp/ddp.html"},
  {"id":"Analayo 2014b","abstract":"With the present article I study the trajectory of the term therav?da from its earliest occurrence in the P?li canon to its present day usage as a designation of the form of Buddhism found in Sri Lanka and Southeast Asia. My presentation begins with the term therav?da in the P?li discourses, followed by turning to the P?li commentaries and chronicles. Next I examine the role of the P?li canon in the Therav?da tradition and the conception of Therav?da as a monastic lineage, after which I discuss current usage and survey alternative terms.","accessed":{"date-parts":[["2025",4,14]]},"author":[{"family":"Analayo","given":"Bhikkhu"}],"citation-key":"Analayo 2014b","container-title":"Buddhist Studies Review","container-title-short":"BSRV","DOI":"10.1558/bsrv.v30i2.215","file":"Analayo-2014-note-on-the-term-theravāda.pdf","ISSN":"1747-9681, 0265-2897","issue":"2","issued":{"date-parts":[["2014",1,1]]},"source":"DOI.org (Crossref)","title":"Note on the Term Theravāda","title-short":"Note on the Term Theravāda","type":"article-journal","URL":"https://journal.equinoxpub.com/BSR/article/view/13707","volume":"30"},
  {"id":"Analayo 2018b","abstract":"With the present paper I attempt an evaluation of the historical value of the Pāli discourses. My presentation covers the following topics: additions recorded in the Pāli commentaries, the question of later levelling, additions made in Sri Lanka, the relevance of the finalization of the Pāli commentaries, and the political and geographical setting of the Pāli discourses. I conclude that, as far as we are able to tell, it seems that the Pāli discourses were fairly closed, in doctrinal terms, by the time of the 1st century BCE.","accessed":{"date-parts":[["2025",4,14]]},"author":[{"family":"Analayo","given":"Bhikkhu"}],"citation-key":"Analayo 2018b","container-title":"K Sri Dhammananda, Essays in Honor of his Centenary","editor":[{"family":"Khin","given":"B.L.W."},{"family":"Samarawickrama","given":"V."},{"family":"Soon","given":"T.H."}],"file":"Analayo-2018-the-four-assemblies-in-pāli-buddhism.pdf","issued":{"date-parts":[["2018"]]},"language":"en","page":"9–18","title":"The Four Assemblies in Pāli Buddhism","type":"article-journal","volume":"2"},
  {"id":"Analyo 2012a","abstract":"With the present paper I attempt an evaluation of the historical value of the Pāli discourses. My presentation covers the following topics: additions recorded in the Pāli commentaries, the question of later levelling, additions made in Sri Lanka, the relevance of the finalization of the Pāli commentaries, and the political and geographical setting of the Pāli discourses. I conclude that, as far as we are able to tell, it seems that the Pāli discourses were fairly closed, in doctrinal terms, by the time of the 1st century BCE.","accessed":{"date-parts":[["2025",4,14]]},"author":[{"family":"Analayo","given":"Bhikkhu"}],"citation-key":"Analyo 2012a","container-title":"Indo-Iranian Journal","file":"","issue":"3","issued":{"date-parts":[["2012",9]]},"language":"en","page":"223-253","title":"The Historical Value of the Pāli Discourses","type":"article-journal","volume":"55"},
  {"id":"ApteVM 1939a","author":[{"family":"Apte","given":"Vinayak Mahadev"}],"citation-key":"ApteVM 1939a","file":"Apte-1939-social-and-religious-life-in-the-gṛihya-sūtras-with-brief-s.pdf","issued":{"date-parts":[["1939"]]},"language":"en","number-of-pages":"386","publisher":"Dr. V.M. Apte","title":"Social and Religious Life in the Gṛihya-sūtras: With Brief Surveys of Social Conditions in Vedic Literature (from the Ṛigveda to the Śrauta-sūtras) and in Early Avestan Literature","title-short":"Social and Religious Life in the Gṛihya-sūtras","type":"book"},
  {"id":"ArmstrongK 2004a","abstract":"Many know the Buddha only from seeing countless serene, iconic images. But what of the man himself and the world he lived in? What did he actually do in his roughly eighty years on earth that spawned one of the greatest religions in world history? Armstrong tackles these questions and more by examining the life and times of the Buddha in this engrossing philosophical biography. Against the tumultuous cultural background of his world, she blends history, philosophy, mythology, and biography to create a compelling and illuminating portrait of a man whose awakening continues to inspire millions.","author":[{"family":"Armstrong","given":"Karen"}],"citation-key":"ArmstrongK 2004a","collection-title":"Penguin Lives Biographies","file":"Armstrong-2001-buddha.pdf","issued":{"date-parts":[["2004"]]},"language":"English","note":"attachment-label:~2001 Text only","publisher":"Penguin","title":"Buddha","type":"book"},
  {"id":"Bailey-Mabbett 2003a","abstract":"Early Buddhism flourished because it was able to take up the challenge represented by buoyant economic conditions and the need for cultural uniformity in the newly emergent states in north-eastern India from the fifth century BCE onwards. This book begins with the apparent inconsistency of Buddhism, a renunciant movement, surviving within a strong urban environment, and draws out the implications of this. In spite of the Buddhist ascetic imperative, the Buddha and other celebrated monks moved easily through various levels of society and fitted into the urban landscape they inhabited. The Sociology of Early Buddhism tells how and why the early monks were able to exploit the social and political conditions of mid-first millennium north-eastern India in such a way as to ensure the growth of Buddhism into a major world religion. Its readership lies both within Buddhist studies and more widely among historians, sociologists and anthropologists of religion.","accessed":{"date-parts":[["2025",4,25]]},"author":[{"family":"Bailey","given":"Greg"},{"family":"Mabbett","given":"Ian"}],"citation-key":"Bailey-Mabbett 2003a","DOI":"10.1017/CBO9780511488283","event-place":"Cambridge","file":"Bailey and Mabbett-2003-the-sociology-of-early-buddhism.pdf","ISBN":"978-0-521-83116-1","issued":{"date-parts":[["2003"]]},"publisher":"Cambridge University Press","publisher-place":"Cambridge","source":"Cambridge University Press","title":"The Sociology of Early Buddhism","type":"book","URL":"https://www.cambridge.org/core/books/sociology-of-early-buddhism/0D358352FDE2AF280BAA635B12265EC3"},
  {"id":"BajpaiKD 1985a","abstract":"Bajpai discusses the cultural significance of the site, mentioned in Mahabharata as well as in the Jaina and Buddhist texts","author":[{"family":"Bajpai","given":"K.D."}],"citation-key":"BajpaiKD 1985a","container-title":"Purātattva","file":"Bajpai-1985-location-of-pava.pdf","issued":{"date-parts":[["1985"],["86"]]},"page":"39–44","title":"Location of Pava","type":"article-journal","URL":"https://www.indarchaeology.org/archives-content.html","volume":"16"},
  {"id":"BalbirN 2000a","author":[{"family":"Balbir","given":"Nalini"}],"citation-key":"BalbirN 2000a","container-title":"Journal of the Pali Text Society","file":"Balbir-2000-jain-buddhist-dialogue-material-from-the-pāli-nalini.pdf","issued":{"date-parts":[["2000"]]},"title":"Jain-Buddhist Dialogue: Material from the Pāli Scriptures","type":"article-journal","URL":"https://palitextsociety.org/product/journal-of-the-pali-text-society-vol-xxvi-2000/","volume":"XXVI"},
  {"id":"BalcerowiczP 2016a","abstract":"Ājīvikism was once ranked one of the most important religions in India between the 4th and 2nd centuries BCE, after Buddhism, ‘Brahmanism’ and before Jainism, but is now a forgotten Indian religion. However, Jainism has remained an integral part of the religious landscape of South Asia, despite the common beginnings shared with Ājīvikism.\nBy rediscovering, reconstructing, and examining the Ājīvikism doctrine, its art, origins and development, this book provides new insight into Ājīv","accessed":{"date-parts":[["2025",4,28]]},"author":[{"family":"Balcerowicz","given":"Piotr"}],"citation-key":"BalcerowiczP 2016a","file":"","issued":{"date-parts":[["2016"]]},"language":"en","title":"Early Asceticism in India: Ājīvikism and Jainism","title-short":"Early Asceticism in India","type":"book","URL":"https://www.routledge.com/Early-Asceticism-in-India-Ajivikism-and-Jainism/Balcerowicz/p/book/9781138493469"},
  {"id":"BallV 1889a","abstract":"In 1676, Jean-Baptiste Tavernier (1605–89), French merchant, traveller and pioneer of trade with India, published an account of his journey through India. This two-volume translation, published in 1889 by Irish geologist Valentine Ball (1843–94), includes a biographical sketch of the author, notes and appendices. Tavernier begins his tale with the declaration that 'I came into this world to travel.' As well as most of Europe, he visited large areas of Turkey, Persia and India (where he acquired the great gem, now known as the Hope Diamond, which he sold to Louis XIV), and sailed to Java. In Volume 1, Tavernier sets out from Isfahan to Agra and Delhi; he then supplies a historical and political description of the empire of Shah Jahan and his successors. An appendix provides details about the values of coins, weights and measures mentioned by Tavernier in the original work.","citation-key":"BallV 1889a","contributor":[{"family":"Ball","given":"V"}],"event-place":"Cambridge","file":"Tavernier-1889-travels-in-india.pdf","ISBN":"978-1-108-04602-2","issued":{"date-parts":[["1889"]]},"language":"English","number-of-pages":"500","number-of-volumes":"2","publisher":"Cambridge University Press","publisher-place":"Cambridge","title":"Travels in India by Jean Baptiste Tavernier, Baron of Aubonne. Translated from the original French of 1676 with a Biographical Sketch of the Author, Notes and Appendices, etc. Vol.1","title-short":"Travels in India by Jean Baptiste Tavernier, Baron of Aubonne. Translated from the original French of 1676","type":"book","volume":"1"},
  {"id":"BanerjeeNR 1986a","abstract":"This excavation report on Nagda languished for several decades before being finalized by Banerjee and published in 1986. Despite that, it still has significance for today. Banerjee excavated the site in the mid-fifties using one large trench and several smaller trenches. The site is estimated to date from circa 3500 B.P.-2300 B.P. (1500 B.C. to 300 B.C.). Period I is the Chalcolithic period that was indexed for Outline of Cultural Materials (OCM) codes. Found at the site were artifacts of ceramic pots, terracotta figurines including one 'mother goddess figure,' microlithic tools, other stone tools such as querns, some copper ornaments, and architectural features such as ovens, floors and walls (some belonging to dwellings, others of unknown use), and a fortification and rampart along the river.","accessed":{"date-parts":[["2025",4,28]]},"author":[{"family":"Banerjee","given":"N.R."}],"citation-key":"BanerjeeNR 1986a","collection-number":"85","collection-title":"Memoirs of the Archaeological Survey of India","file":"Banerjee-1986-memoirs-of-the-archaeological-survey-of-india,-no.-85-nagda.pdf","issued":{"date-parts":[["1986"]]},"publisher":"Archaeological Survey of India","title":"Nagda (1955-57)","type":"book"},
  {"id":"BapatPV 1956a","abstract":"The book gives a short account of Buddhism in the last 2500 years. The foreword for the book was written by Dr. Radhakrishnan, world-renowned philosopher. The book contains 16 chapters and about one hundred articles written by eminent Buddhist scholars from India, China, Japan, Sri Lanka, Nepal. Buddhism is a way of life, of purity in thinking, speaking and acting. This book gives an account of Buddhism not only in India but also in other countries of the East. Detailed and insightful glimpse into the different schools and sects of Buddhism find a place in this book. Buddhist ideas on education and the prevailing state of Buddhism as revealed by the Chinese pilgrims who visited India during that time are other components of the book. Chapters on Buddhist Art in India and abroad and places of Buddhist interest are also included to give it a holistic perspective. The spirit of Buddha comes alive in the book and enlightens the reader with his teachings so essential now for peace in the strife-torn world.","author":[{"family":"Bapat","given":"P. V."}],"citation-key":"BapatPV 1956a","file":"Bapat-1956-2500-years-of-buddhism.pdf","ISBN":"978-81-208-3981-6","issued":{"date-parts":[["1956"]]},"language":"English","number-of-pages":"447","publisher":"Motilal Banarsidass","title":"2500 Years of Buddhism","type":"book"},
  {"id":"BarishJ 1981a","abstract":"The Antitheatrical Prejudice is essential reading today when theatricality, antitheatricality, and performativity are once again provocative issues playing out across contemporary culture and the arts. The original edition was published in 1981. The new edition includes a Foreword by Joseph Roach, the distinguished theatre historian and stage director, and professor emeritus, Dept. of English, Yale University. He is the author of The Player’s Passion: Studies in the Science of Acting and Cities of the Dead: Circum-Atlantic Performance.","author":[{"family":"Barish","given":"Jonas"}],"citation-key":"BarishJ 1981a","event-place":"Los Angeles","file":"","ISBN":"0-520-03734-9","issued":{"date-parts":[["1981"]]},"language":"English","note":"IACode: antitheatricalpr0000bari","number-of-pages":"512","publisher":"University of California Press","publisher-place":"Los Angeles","title":"The Anti-Theatrical Prejudice","type":"book"},
  {"id":"BaruaPR 1956a","author":[{"family":"Barua","given":"Promode Ranjan"}],"citation-key":"BaruaPR 1956a","container-title":"Journal of the Asiatic Society of Pakistan","file":"","issued":{"date-parts":[["1956"]]},"title":"The Brahmin Doctrine of Sacrifice and Ritual in the Pali Canon","type":"article-journal","volume":"1"},
  {"id":"Basham 1951a","abstract":"The book presents the history and doctrines of the Ajivikas who formed a third herectical sect besides the sect of Gautama Bhuddha and that of Mahavira Vardhamana, The sect was founded by Makkhali Gosal, with a belief in the all embracing rule of Niyati principle of order]. According to Gosal, it was Niyati which ultimately governed ouraction, controlled phenomena and left no room for human volition.","author":[{"family":"Basham","given":"A. L."}],"citation-key":"Basham 1951a","event-place":"London","file":"Basham-1951-history-and-doctrines-of-the-ajivikas-a-vanished-indian-rel.pdf","issued":{"date-parts":[["1951"]]},"language":"English","number-of-pages":"310","publisher":"Luzac & Co","publisher-place":"London","title":"History and Doctrines of the Ajivikas: A Vanished Indian Religion","title-short":"History and Doctrines of the Ajivikas","type":"book"},
  {"id":"BashamAL 1980a","author":[{"family":"Basham","given":"Arthur Llewellyn"}],"citation-key":"BashamAL 1980a","container-title":"Studies in History of Buddhism","editor":[{"family":"Narain","given":"A.K."}],"event-place":"Delhi","file":"Basham-1980-the-background-to-the-rise-of-buddhism.pdf","issued":{"date-parts":[["1980"]]},"publisher":"B.R. Publishing","publisher-place":"Delhi","title":"The Background to the Rise of Buddhism","type":"chapter"},
  {"id":"BasuSC 1916a","citation-key":"BasuSC 1916a","collection-number":"17","collection-title":"The Sacred Books of the Hindus","contributor":[{"family":"Basu","given":"Sris Chandra"}],"event-place":"Bahadurganj","file":"Oudh-1916-the-matsya-puranam1.pdf;Oudh-1916-the-matsya-puranam2.pdf","issued":{"date-parts":[["1916"]]},"language":"English","note":"attachment-label: Part 1;Part 2","number-of-pages":"884","publisher":"The Pāṇiṇi Office","publisher-place":"Bahadurganj","title":"The Matsya Puranam. Translated by a Taluqdar of Oudh","type":"book"},
  {"id":"BechertH 1991a","citation-key":"BechertH 1991a","editor":[{"family":"Beschert","given":"Heinz"}],"event-place":"Göttingen","event-title":"Symposien zur Buddhismusforschung, IV, 1","file":"","issued":{"date-parts":[["1991"]]},"publisher":"Vandenhoec & Ruprech","publisher-place":"Göttingen","title":"The Dating of the Historical Buddha","type":"paper-conference","volume":"1"},
  {"id":"BlackB 2011a","abstract":"This volume brings together sixteen articles on the religions, literatures and histories of South and Central Asia in tribute to Patrick Olivelle, one of North America’s leading Sanskritists and historians of early India. Over the last four decades, the focus of his scholarship has been on the ascetic and legal traditions of India, but his work as both a researcher and a teacher extends beyond early Indian religion and literature. ‘Religion and Identity and South Asia and Beyond’ is a testament to that influence. The contributions in this volume, many by former students of Olivelle, are committed to linguistic and historical rigor, combined with sensitivity to how the study of Asia has been changing over the last several decades.","author":[{"family":"Black","given":"Brian"}],"citation-key":"BlackB 2011a","container-title":"Religion and Identity in South Asia and Beyond: Essays in Honor of Patrick Olivelle","editor":[{"family":"Lindquist","given":"Steven E."}],"event-place":"London","file":"","ISBN":"978-0-85728-790-8","issued":{"date-parts":[["2011"]]},"language":"English","page":"101–126","publisher":"Anthem Press","publisher-place":"London","title":"The Rhetoric of Secrecy in the Upaniṣads","type":"chapter","URL":"https://www.jstor.org/stable/j.ctt1gxp99q.8"},
  {"id":"Bodhi 2005a","abstract":"This landmark collection is the definitive introduction to the Buddha's teachings — in his own words.The American scholar-monk Bhikkhu Bodhi, whose voluminous translations have won widespread acclaim, here presents selected discourses of the Buddha from the Pali Canon, the earliest record of what the Buddha taught.Divided into ten thematic chapters, In the Buddha's Words reveals the full scope of the Buddha's discourses, from family life and marriage to renunciation and the path of insight. A concise, informative introduction precedes each chapter, guiding the reader toward a deeper understanding of the texts that follow.This book contains:Clear translations of the Buddha's original teachingsThoughtfully curated selections from the Pali CanonChapters on the Buddha's life, rebirth, suffering, liberation, and practiceA foreword by His Holiness the Dalai LamaIn the Buddha's Words allows even readers unacquainted with Buddhism to grasp the significance of the Buddha's contributions to our world heritage. Taken as a whole, these texts bear eloquent testimony to the breadth and intelligence of the Buddha's teachings, and point the way to an ancient yet ever-vital path. Practitioners and scholars alike will find this systematic presentation indispensable.Dive into the world of the Buddha through these easy-to-read English translations of the Pali Canon. The Pali Canon is the literary, intellectual, and spiritual foundation of Theravada Buddhism. This volume, being organized in a progressive manner \"from the simple to the difficult, from the elementary to the profound,\" makes it well-suited for those looking for an accessible introduction to the Theravadin scriptural corpus, as well as being a valuable resource for those familiar with the Pali Canon but wanting a more structured presentation of the materials.","author":[{"family":"Bodhi","given":"Bhikkhu"}],"citation-key":"Bodhi 2005a","collection-title":"Teachings of the Buddha","edition":"First Edition","event-place":"Boston, Mass","file":"","ISBN":"978-0-86171-491-9","issued":{"date-parts":[["2005"]]},"language":"English","number-of-pages":"485","publisher":"Wisdom Publications U.S","publisher-place":"Boston, Mass","title":"In the Buddha's Words: An Anthology of Discourses from the Pali Canon","title-short":"In the Buddha's Words","type":"book","URL":"https://wisdomexperience.org/product/buddhas-words/"},
  {"id":"Bodhi 2012a","abstract":"The present volume, which continues Wisdom s famous Teachings of the Buddha series, contains a full translation of the Anguttara Nikaya. The Anguttara arranges the Buddha s discourses in accordance with a numerical scheme intended to promote retention and easy comprehension. In an age when writing was still in its infancy, this proved to be the most effective way to ensure that the disciples could grasp and replicate the structure of a teaching. A broad survey of the Anguttara Nikaya shows that its primary focus is on practice, and it treats practice from a wide-angle perspective. The subjects of the discourses range from the basic ethical observances recommended to the busy layperson, through the pillars of mind training, to the highest meditative attainments. The Anguttara is also distinguished among the four Nikayas by its interest in types of persons, which it describes and classifies in detail, often with stunning similes. In such a work, it is fitting that the Buddha appears, not merely as a teacher, but as a real person with his own life story and achievements.","citation-key":"Bodhi 2012a","collection-title":"Teachings of the Buddha","contributor":[{"family":"Bodhi","given":"Bhikkhu"}],"edition":"Annotated edition","event-place":"Boston","file":"","ISBN":"978-1-61429-040-7","issued":{"date-parts":[["2012",11,13]]},"language":"English","number-of-pages":"1936","publisher":"Wisdom Publications,U.S.","publisher-place":"Boston","title":"The Numerical Discourses of the Buddha: A Complete Translation of the Anguttara Nikaya","title-short":"The Numerical Discourses of the Buddha","type":"book","URL":"https://wisdomexperience.org/product/numerical-discourses-buddha/"},
  {"id":"Bodhi 2016a","abstract":"In a world of conflict and strife, how can we be advocates of peace and justice? In this volume acclaimed scholar-monk Bhikkhu Bodhi has collected and translated the Buddha’s teachings on conflict resolution, interpersonal and social problem-solving, and the forging of harmonious relationships. The selections, all drawn from the Pali Canon, the earliest record of the Buddha’s discourses, are organized into ten thematic chapters. The chapters deal with such topics as the quelling of anger, good friendship, intentional communities, the settlement of disputes, and the establishing of an equitable society. Each chapter begins with a concise and informative introduction by the translator that guides us toward a deeper understanding of the texts that follow. In times of social conflict, intolerance, and war, the Buddha’s approach to creating and sustaining peace takes on a new and urgent significance. Even readers unacquainted with Buddhism will appreciate these ancient teachings, always clear, practical, undogmatic, and so contemporary in flavor. The Buddha’s Teachings on Social and Communal Harmony will prove to be essential reading for anyone seeking to bring peace into their communities and into the wider world.","author":[{"family":"Bodhi","given":"Bhikkhu"}],"citation-key":"Bodhi 2016a","collection-title":"Teachings of the Buddha","event-place":"Somerville","file":"","ISBN":"978-1-61429-355-2","issued":{"date-parts":[["2016"]]},"language":"English","number-of-pages":"248","publisher":"Wisdom Publications,U.S.","publisher-place":"Somerville","title":"The Buddha's Teaching on Social and Communal Harmony: An Anthology of Discourses from the Pali Canon","title-short":"The Buddha's Teaching on Social and Communal Harmony","type":"book","URL":"https://wisdomexperience.org/product/buddhas-teachings-social-and-communal-harmony/"},
  {"id":"BronkhorstJ 2000a","accessed":{"date-parts":[["2025",4,28]]},"author":[{"family":"Bronkhorst","given":"Johannes"}],"citation-key":"BronkhorstJ 2000a","container-title":"Journal of Indian Philosophy","DOI":"10.1023/A:1017500901500","file":"","ISSN":"00221791","issue":"5/6","issued":{"date-parts":[["2000"]]},"page":"511-529","title":"The Riddle of the Jains and Ājīvakas in Early Buddhist Literature","type":"article-journal","volume":"28"},
  {"id":"BronkhorstJ 2002a","author":[{"family":"Bronkhorst","given":"Johannes"}],"citation-key":"BronkhorstJ 2002a","container-title":"Asiatische Studien/Études Asiatiques","file":"Bronkhorst-2002-literacy-and-rationality-in-ancient-india.pdf","issue":"4","issued":{"date-parts":[["2002"]]},"page":"797-831","title":"Literacy and Rationality in Ancient India","type":"article-journal","volume":"56"},
  {"id":"BronkhorstJ 2007a","abstract":"Greater Magadha, roughly the eastern part of the Gangetic plain of northern India, has so far been looked upon as deeply indebted to Brahmanical culture. Religions such as Buddhism and Jainism are thought of as derived, in one way or another, from Vedic religion. This belief is defective in various respects. The book argues for the importance and independence of Greater Magadha as a cultural area until a date close to the beginning of the Common Era. In order to correct the incorrect notions, two types of questions are dealt with: questions pertaining to cultural and religious dependencies, and questions relating to chronology. As a result a modified picture arises that also has a bearing on the further development of Indian culture. The book is arranged in five parts. Part-I describes cultural features of Greater Magadha, under which there are three chapters-The Fundamental Spiritual Ideology, Other Features and Conclusions. Part-II: Brahmanism vis-a-vis Rebirth and Karmic Retribution has three sections- Hesitantly Accepted, Rebirth and Karmic Retribution Ignored or Rejected, and Urban Brahmins. Under section one there are chapters onó Dharma Sutra, a portion from the Mahabharata and the early Upanisads. Section two features chapters on Rebirth and Karmic Retribution Ignored and Rebirth and Karmic Retribution Rejected. Section three is on urban Brahmins. Part-III dwells on the chronological issues, - linguistic consideration, the Vedic texts known to the early Sanskrit grammarians, to the early Buddhists, some indications in late-Vedic literature, urban versus rural culture, etc. Part-IV is Conclusion, while Part V has useful appendices-The antiquity of the Vedanta philosophy, a Carvaka in the Mahabharata, Vedic texts known to panini, the form of the Rgveda known to Panini, Vedic texts known to Patanjali, Brahmins in the Buddhist canon, Brahmanism in Gandhara and surrounding and Carvakas and the Sabarabhasya. The book also contains references and index.","author":[{"family":"Bronkhorst","given":"Johannes"}],"citation-key":"BronkhorstJ 2007a","collection-number":"19","collection-title":"Handbook of Oriental Studies","edition":"First Edition","event-place":"Delhi","file":"Bronkhorst-2013-greater-magadha-studies-in-the-cultures-of-early-india.pdf","ISBN":"978-81-208-3534-4","issued":{"date-parts":[["2007"]]},"language":"English","number-of-pages":"433","publisher":"Motilal Banarsidass Publishers Pvt. Ltd.","publisher-place":"Delhi","title":"Greater Magadha: Studies in the Cultures of Early India","type":"book","URL":"https://brill.com/display/title/13862"},
  {"id":"BronkhorstJ 2011a","abstract":"This book deals with the confrontation of Buddhism and Brahmanism in India. Both depended on support from the royal court, but Buddhism had less to offer in return than Brahmanism. Buddhism developed in a manner to make up for this.","author":[{"family":"Bronkhorst","given":"Johannes"}],"citation-key":"BronkhorstJ 2011a","event-place":"Leiden","file":"Bronkhorst-2011-buddhism-in-the-shadow-of-brahmanism.pdf","ISBN":"978-90-04-20140-8","issued":{"date-parts":[["2011"]]},"language":"English","number-of-pages":"304","publisher":"BRILL","publisher-place":"Leiden","title":"Buddhism in the Shadow of Brahmanism","title-short":"Buddhism in the Shadow of Brahmanism","type":"book"},
  {"id":"BurlingameEW 1921a","citation-key":"BurlingameEW 1921a","contributor":[{"family":"Burlingame","given":"Eugene Watson"}],"event-place":"New Delhi","file":"Burlingame-1999-buddhist-legends.pdf","ISBN":"978-81-215-0879-7","issued":{"date-parts":[["1921"]]},"language":"English","number-of-pages":"1129","publisher":"Munshiram Manoharlal Publishers","publisher-place":"New Delhi","title":"Buddhist Legends: Dhammapada Commentary Volumes 1, 2 & 3","type":"book"},
  {"id":"CampbellJ 1949a","abstract":"In this compelling and influential work, Joseph Campbell scours the myths of the world to reveal the characteristics common to heroes from all cultures and periods.Mankind has always used fantastical stories as a weapon against fear and ignorance. But despite their infinite variety of incident, setting and costume, the myths of the world present us with remarkably similar heroes. Through meticulous research, Joseph Campbell has identified the composite hero, the common thread that runs through Apollo, Buddha, the Grimm Brothers’ Frog King, and thousands of others. By comparing his findings with the words of such spiritual leaders as Moses, Jesus and Mohammed, Campbell shows how the myths of the world hold a mirror to our notion of heroism – and our interpretation of life itself.","author":[{"family":"Campbell","given":"Joseph"}],"citation-key":"CampbellJ 1949a","event-place":"London","file":"Campbell-1949-the-hero-with-a-thousand-faces.pdf","ISBN":"978-0-586-08571-4","issued":{"date-parts":[["1949"]]},"language":"English","number-of-pages":"448","publisher":"Fontana Press","publisher-place":"London","title":"The Hero with a Thousand Faces","type":"book"},
  {"id":"ChakrabartiDK 2001a","author":[{"family":"Chakrabarti","given":"Dilip K."}],"citation-key":"ChakrabartiDK 2001a","event-place":"Bangalore","file":"","ISBN":"978-81-7824-016-9","issued":{"date-parts":[["2001"]]},"language":"eng","number-of-pages":"307","publisher":"Distributed by Orient Longman","publisher-place":"Bangalore","title":"Archaeological geography of the Ganga Plain: the lower and the middle Ganga","type":"book"},
  {"id":"ChakrabartiDK 2007a","author":[{"family":"Chakrabarti","given":"Dilip K."}],"citation-key":"ChakrabartiDK 2007a","edition":"1. publ","event-place":"New Delhi, India","file":"","ISBN":"978-81-215-1185-8","issued":{"date-parts":[["2007"]]},"language":"eng","number-of-pages":"245","publisher":"Munshiram Manoharlal Publ","publisher-place":"New Delhi, India","title":"Archaeological geography of the Ganga plain: the upper Ganga (Oudh, Rohilkhand, and the Doab)","type":"book"},
  {"id":"ChakravartiU 1996a","author":[{"family":"Chakravarti","given":"Uma"}],"citation-key":"ChakravartiU 1996a","event-place":"New Delhi","file":"Chakravarti-1996-the-social-dimensions-of-early-buddhism.pdf","ISBN":"978-81-215-0749-3","issued":{"date-parts":[["1996"]]},"language":"eng","number-of-pages":"238","publisher":"Mushiram Manoharlal","publisher-place":"New Delhi","title":"The Social Dimensions of Early Buddhism","type":"book"},
  {"id":"ChandraP 1971a","accessed":{"date-parts":[["2025",4,28]]},"author":[{"family":"Chandra","given":"Pratap"}],"citation-key":"ChandraP 1971a","container-title":"Philosophy East and West","container-title-short":"Philosophy East and West","DOI":"10.2307/1398359","file":"","ISSN":"00318221","issue":"3","issued":{"date-parts":[["1971"]]},"page":"317","title":"Was Early Buddhism Influenced by the Upanisads?","type":"article-journal","URL":"https://www.jstor.org/stable/1398359?origin=crossref","volume":"21"},
  {"id":"CousinsL 1983a","author":[{"family":"Cousins","given":"Lance"}],"citation-key":"CousinsL 1983a","collection-number":"4","collection-title":"Collected Papers on South Asia","container-title":"Buddhist studies: Ancient and Modern","editor":[{"family":"Denwood","given":"Philip"},{"family":"Piatigorsky","given":"Alexander"}],"event-place":"London","file":"Cousins-1983-pali-oral-literature.pdf","ISBN":"978-0-389-20264-6 978-0-7007-0153-7","issued":{"date-parts":[["1983"]]},"language":"eng","publisher":"Curzon [u.a.]","publisher-place":"London","title":"Pali Oral Literature","type":"chapter"},
  {"id":"deSilvaL 1993a","author":[{"family":"Silva","given":"Lily","non-dropping-particle":"de"}],"citation-key":"deSilvaL 1993a","collection-number":"5","collection-title":"South Asian Studies Papers","container-title":"Studies on Buddhism in Honour of A. K. Warder","editor":[{"family":"Wagle","given":"N. K."},{"family":"Watanabe","given":"F."}],"event-place":"Toronto, Canada","file":"de Silva-1993-ministering-to-the-sick-and-counselling-the-terminally-ill.pdf","ISBN":"1-895214-06-8 978-1-895214-07-9","issued":{"date-parts":[["1993"]]},"publisher":"Centre for South Asian Studies, University of Toronto","publisher-place":"Toronto, Canada","title":"Ministering to the Sick and Counselling the Terminally Ill","type":"chapter"},
  {"id":"DevaK 2003a","author":[{"family":"Deva","given":"Krishna"}],"citation-key":"DevaK 2003a","container-title":"Studies in Archaeology and History","editor":[{"family":"Chandra","given":"Satish"}],"file":"","issued":{"date-parts":[["2003"]]},"title":"The Antiquity of Sites Related to the Buddha","type":"article-journal"},
  {"id":"Dhammajoti 2008a","author":[{"family":"Dhammajoti","given":"Bhikkhu"}],"citation-key":"Dhammajoti 2008a","container-title":"Journal of the Centre for Buddhist Studies, Sri Lanka","file":"Dhammajoti-2008-the-sixteen-mode-mindfulness-of-breathing.pdf","issued":{"date-parts":[["2008"]]},"title":"The Sixteen-mode Mindfulness of Breathing","type":"article-journal"},
  {"id":"Dhammika 2016a","abstract":"An issue that has long divided Buddhists is whether or not meant-eating is consistent with the Dhamma, the teachings of the Buddha. Both ancient and modern scholars have debated this matter, sometimes with considerable rancour. In this small boo, Bhante Dhammika, a well-known Buddhist monk, revisits the various arguments for and against meat eating and examines them from a very different perspective. In doing so, he also dispels several misconceptions about Buddhism, highlights some rarely discussed problems associated with being vegetarian and details some of the good reasons for becoming one. This book will make you look at Buddhism very differently. It might make you look at your next meal very differently too.","accessed":{"date-parts":[["2025",5,6]]},"author":[{"family":"Dhammika","given":"Bhante S"}],"citation-key":"Dhammika 2016a","file":"Dhammika-2010-to-eat-or-not-to-eat-meat.pdf","issued":{"date-parts":[["2010"]]},"language":"en","publisher":"Buddha Dhamma Mandala Society","title":"To Eat Or Not To Eat Meat","type":"book"},
  {"id":"Dhammika 2018a","abstract":"During the last hundred years it has increasingly been said that all religions are actually pointing to the same reality. Now there are numerous books claiming that the teachings of Jesus and the Buddha are just different versions of the same truth. Is this true or is it the outcome of a superficial examination of the facts or perhaps a genuine but misguided attempt to encourage inter-religious understanding? This book is the first in-depth comparison of the life and teachings of Jesus and the Buddha and presented in the New Testament and the Tipitaka, the Buddhist scriptures. The result is portraits of the two great religious figures very different from how they have traditionally been seen and the question ‘Are Christianity and Buddhism compatible?’ is answered in a way that may surprise many readers. Bhante Shravasti Dhammika is well placed to write this comparative study having been brought up a Christian and later becoming a Buddhist and a monk.","author":[{"family":"Dhammika","given":"Bhante S"}],"citation-key":"Dhammika 2018a","file":"Dhammika-2018-jesus-and-the-buddha-a-study-of-their-commonalities-and-con.pdf","issued":{"date-parts":[["2018"]]},"title":"Jesus and the Buddha: A Study of Their Commonalities and Contrasts","title-short":"Jesus and the Buddha","type":"book"},
  {"id":"Dhammika 2018b","abstract":"This book is an in-depth investigation of the natural environment that the Buddha lived in, as depicted in early Theravada Buddhist texts.\nIn recent decades there has been a great deal of interest in the contribution religions can make to environmental awareness and the development of environmental ethics. Because of its teaching of a compassion that includes all sentient life, Buddhism in particular is well placed to make an important contribution to such discussions. The many works resulting from this have tended to focus mainly on human/animal interaction, animal and plant symbolism, and especially environmental ethics. In the present book the author examines the underpinning of all this. The first part examines how north Indian Buddhists tried to explain, define and classify their natural world; everything from its topographical features to metrological phenomena and of course its flora and fauna. The second and largest part lists alphabetically the Pali names of every animal and plant mentioned in early Theravada scriptures, some 580 altogether, describing each, together with its scientific name and uses. The last part lists the medicinal herbs mentioned in the scriptures together with their traditional application and modern usage. Comprehensive, detailed and well referenced, this book will be an essential companion for anyone interested in the early Buddhist understanding of the natural world.","author":[{"family":"Dhammika","given":"Bhante S"}],"citation-key":"Dhammika 2018b","editor":[{"family":"Nyanatusita","given":"Ven."}],"event-place":"Kandy","file":"Dhammika-2018-nature-and-the-environment-in-early-buddhism.pdf","issued":{"date-parts":[["2018"]]},"publisher":"The Buddhist Publication Society","publisher-place":"Kandy","title":"Nature and the Environment in Early Buddhism","type":"book"},
  {"id":"Dhammika 2018c","abstract":"This book examines a range of subjects and issues related to Buddhism which are rarely given the attention they deserve. With a mastery of the ancient Buddhist texts and an eye for the unusual the author looks at subjects such as the Buddha's toothbrush, his travels, what he said about food and friendship, and topical issues such including smoking and capital punishment. These essays bring into focus the scope and depth of Buddhism as a philosophy of life.","author":[{"family":"Dhammika","given":"Bhante S"}],"citation-key":"Dhammika 2018c","event-place":"Singapore","file":"","issued":{"date-parts":[["2018"]]},"publisher":"Buddha Dhamma Mandala Society","publisher-place":"Singapore","title":"The View from the West: An Australian monk looks at Buddhism","title-short":"The View from the West","type":"book"},
  {"id":"Dhammika 2018d","abstract":"Middle Land, Middle Way: Pilgrim's Guide to Buddhist India is a comprehensive travel and spiritual guidebook that takes readers on a journey through the sacred sites of Buddhist India.","author":[{"family":"Dhammika","given":"Bhante S"}],"citation-key":"Dhammika 2018d","event-place":"Kandy","file":"Dhammika-2018-middle-land-middle-way-pilgrim's-guide-to-buddhist-india.pdf","ISBN":"978-955-24-0095-7","issued":{"date-parts":[["2018"]]},"language":"English","number-of-pages":"208","publisher":"Buddhist Publication Society, Sri lanka","publisher-place":"Kandy","title":"Middle Land Middle Way: Pilgrim's Guide to Buddhist India","title-short":"Middle Land Middle Way","type":"book"},
  {"id":"Dict-Monier-Williams","accessed":{"date-parts":[["2024",1,15]]},"author":[{"family":"Monier-Williams","given":"Monier"}],"citation-key":"Dict-Monier-Williams","file":"","title":"Monier-Williams Sanskrit Dictionary 1899 Advanced","type":"webpage","URL":"https://www.sanskrit-lexicon.uni-koeln.de/scans/MWScan/2020/web/webtc2/index.php"},
  {"id":"Dict-PED","abstract":"Online version of 'The Pali Text Society's Pali-English Dictionary' from the Digital Dictionaries of South Asia","accessed":{"date-parts":[["2024",1,10]]},"author":[{"family":"Rhys-Davids","given":"T.W."},{"family":"Stede","given":"William"}],"citation-key":"Dict-PED","file":"Rhys Davids_Stede_1921_Pāli-English Dictionary.pdf","genre":"Dictionary","issued":{"date-parts":[["1921"],["1925"]]},"language":"eng","title":"The Pali Text Society's Pali-English Dictionary","type":"webpage","URL":"https://dsal.uchicago.edu/dictionaries/pali/"},
  {"id":"Doniger-Kakar 2003a","abstract":"''When the wheel of sexual ecstasy is in full motion, there is no textbook at all, and no order.''The Kamasutra is the oldest extant Hindu textbook of erotic love. It is about the art of living - about finding a partner, maintaining power in a marriage, committing adultery, living as or with a courtesan, using drugs - and also about the positions in sexual intercourse. It was composed in Sanskrit, the literary language of ancient India, sometime in the third century CE. It combines an encyclopaedic coverage of all imaginable aspects of sex with a closely observed sexual psychology and a dramatic, novelistic narrative of seduction, consummation, and disentanglement. Best known in English through the highly mannered, padded, and inaccurate nineteenth-century translation of Sir Richard Burton, the text is presented here in an entirely new translation into clear, vivid, sexually frank English, together with three commentaries: translated excerpts from the earliest and most famous Sanskrit commentary (13th century) and from a twentieth-century Hindi commentary, and explanatory notes by the two translators. ABOUT THE SERIES: For over 100 years Oxford World''s Classics has made available the widest range of literature from around the globe. Each affordable volume reflects Oxford''s commitment to scholarship, providing the most accurate text plus a wealth of other valuable features, including expert introductions by leading authorities, helpful notes to clarify the text, up-to-date bibliographies for further study, and much more.","citation-key":"Doniger-Kakar 2003a","contributor":[{"family":"Doniger","given":"Wendy"},{"family":"Kakar","given":"Sudhir"}],"event-place":"Oxford","file":"Vatsyayana-2009-kamasutra.pdf","ISBN":"978-0-19-953916-1","issued":{"date-parts":[["2009"]]},"language":"English","number-of-pages":"304","publisher":"Oxford University Press","publisher-place":"Oxford","title":"Vatsyayana Mallanaga—Kamasutra: A new, complete English translation of the Sanskrit text with excerpts from the Sanskrit Jayamangala commentary of Yashodhara Indrapada, the Hindi Jaya commentary of Devadatta Shastri, and explanatory notes by the translators","title-short":"Vatsyayana Mallanaga—Kamasutra","type":"book"},
  {"id":"DTC 2013a","abstract":"The Play in Full tells the story of how the Buddha manifested in this world and attained awakening, as perceived from the perspective of the Great Vehicle. The sūtra, which is structured in twenty-seven chapters, first presents the events surrounding the Buddha’s birth, childhood, and adolescence in the royal palace of his father, king of the Śākya nation. It then recounts his escape from the palace and the years of hardship he faced in his quest for spiritual awakening. Finally the sūtra reveals his complete victory over the demon Māra, his attainment of awakening under the Bodhi tree, his first turning of the wheel of Dharma, and the formation of the very early saṅgha.","accessed":{"date-parts":[["2025",5,28]]},"author":[{"literal":"Dharmachakra Translation Committee"}],"citation-key":"DTC 2013a","file":"Dharmachakra-Translation-Committee-the-play-in-full-lalitavistara.pdf","language":"en","title":"The Noble Great Vehicle Sūtra “The Play in Full,” Ārya­­lalita­vistara­­nāma­­mahā­­yāna­­sūtra","type":"book","URL":"https://84000.co/translation/toh95"},
  {"id":"DundesL 1987a","accessed":{"date-parts":[["2025",5,28]]},"author":[{"family":"Dundes","given":"L"}],"citation-key":"DundesL 1987a","container-title":"American Journal of Public Health","container-title-short":"Am J Public Health","DOI":"10.2105/AJPH.77.5.636","file":"Dundes-1987-the-evolution-of-maternal-birthing-position..pdf","ISSN":"0090-0036, 1541-0048","issue":"5","issued":{"date-parts":[["1987",5]]},"language":"en","page":"636-641","source":"DOI.org (Crossref)","title":"The Evolution of Maternal Birthing Position.","type":"article-journal","URL":"https://ajph.aphapublications.org/doi/full/10.2105/AJPH.77.5.636","volume":"77"},
  {"id":"DysonT 2018a","abstract":"A Population History of India provides an account of the size and characteristics of India's population stretching from when hunter-gatherer homo sapiens first arrived in the country - very roughly seventy thousand years ago - until the modern day. It is a period during which the population grew from just a handful of people to reach almost 1.4 billion, and a time when the fact of death had a huge influence on the nature of life. This book considers the millennia that were characterized by hunting and gathering, the Indus valley civilization, the opening-up of the Ganges river basin, and the eras of the Delhi Sultanate, the Mughal Empire, British colonial rule, and India since independence.By observing India through a demographic lens, A Population History of India: From the First Modern People to the Present Day addresses mortality, fertility, the size of cities, patterns of migration, and the multitude of famines, epidemics, invasions, wars, and other events that affected the population. It draws together research from archaeology, cultural studies, economics, epidemiology, linguistics, history, and politics to understand the likely trajectory of India's population in comparison to the trends that applied to Europe and China, and to reveal a surprising and dramatic story.","author":[{"family":"Dyson","given":"Tim"}],"citation-key":"DysonT 2018a","event-place":"Oxford (GB)","file":"","ISBN":"978-0-19-882905-8","issued":{"date-parts":[["2018"]]},"language":"English","number-of-pages":"330","publisher":"OUP Oxford","publisher-place":"Oxford (GB)","title":"A Population History of India: From the First Modern People to the Present Day","title-short":"A Population History of India","type":"book"},
  {"id":"EggelingJ 1900a","citation-key":"EggelingJ 1900a","collection-editor":[{"family":"Müller","given":"F. Max"}],"collection-number":"44","collection-title":"The Sacred Books of the East","contributor":[{"family":"Eggeling","given":"Julius"}],"event-place":"Oxford","file":"Eggeling-1900-the-satapatha-brahmana.pdf","issued":{"date-parts":[["1900"]]},"language":"English","number-of-pages":"595","publisher":"Clarendon Press","publisher-place":"Oxford","title":"The Satapatha-Brâhmana, According to the Text of the Mâdhyandina School. Part V, Books XI, XII, XIII and XIV","type":"book"},
  {"id":"EltschingerV 2012a","abstract":"From the sixth to the eight century CE, the Buddhist philosophers paid considerable attention to the issue of the caste-classes. Far from seeking to reform the non-Buddhist social environment, they endeavoured to undermine theorectical attempts at \"naturalizing\" the social statuses, especially Kumarila's doctrine of the perceptibility of jati.","author":[{"family":"Eltschinger","given":"Vincent"}],"citation-key":"EltschingerV 2012a","event-place":"Delhi","file":"","ISBN":"978-81-208-3559-7","issued":{"date-parts":[["2012"]]},"language":"English","number-of-pages":"404","publisher":"Motilal Banarsidass","publisher-place":"Delhi","title":"Caste and Buddhist Philosophy: Continuity of Some Buddhist Arguments against the Realist Interpretation of Social Denominations","type":"book"},
  {"id":"ErdosyG 1995a","abstract":"Cities and states developed in South Asia between c. BC 800 and AD 250, as Hinduism and Buddhism arose and spread. Drawing on archaeological studies and also on texts and inscriptions, this book explores the character of the early Indian cities, paying particular attention to their art and architecture and analyzing the political ideas that shaped the state systems. The study extends to the opening centuries of the Christian era, offering an Indian perspective on the contacts with the Greek and Roman worlds that followed the invasion by Alexander the Great.","author":[{"family":"Erdosy","given":"George"}],"citation-key":"ErdosyG 1995a","container-title":"The Archaeology of Early Historic South Asia: The Emergence of Cities and States","editor":[{"family":"Allchin","given":"Frank Raymond"}],"file":"","ISBN":"978-0-521-37695-2","issued":{"date-parts":[["1995"]]},"language":"en","publisher":"Cambridge University Press","title":"City States of North India and Pakistan at the Time of the Buddha","type":"chapter"},
  {"id":"FalkH 2006a","author":[{"family":"Falk","given":"Harry"}],"citation-key":"FalkH 2006a","file":"Falk-2006-aśokan-sites-and-artefacts-a-source-book-with-bibliography.pdf","ISBN":"978-3-8053-3712-0","issued":{"date-parts":[["2006"]]},"language":"en","number-of-pages":"295","publisher":"Von Zabern","title":"Aśokan Sites and Artefacts: A Source-book with Bibliography","title-short":"Aśokan Sites and Artefacts","type":"book"},
  {"id":"FalkH 2013a","accessed":{"date-parts":[["2025",5,6]]},"author":[{"family":"Falk","given":"Harry"}],"citation-key":"FalkH 2013a","container-title":"Bulletin of the Asia Institute","file":"Falk-2013-the-ashes-of-the-buddha.pdf","ISSN":"08904464","issued":{"date-parts":[["2013"]]},"page":"43–75","title":"The Ashes of the Buddha","type":"article-journal","volume":"27"},
  {"id":"FickR 1920a","author":[{"family":"Fick","given":"Richard"}],"citation-key":"FickR 1920a","file":"Fick-1920-the-social-organization-in-north-east-india-in-buddha's-time.pdf","issued":{"date-parts":[["1920"]]},"language":"en","number-of-pages":"398","publisher":"University of Calcutta [Press]","title":"The Social Organization in North-East India in Buddha's Time","type":"book"},
  {"id":"FleetJF 1906a","author":[{"family":"Fleet","given":"John Faithfull"}],"citation-key":"FleetJF 1906a","container-title":"Journal of the Royal Asiatic Society","file":"Fleet-1906-the-inscription-on-the-piprahwa-vase.pdf","issue":"1","issued":{"date-parts":[["1906"]]},"page":"105-130","title":"The Inscription on the Piprahwa Vase","type":"article-journal","volume":"38"},
  {"id":"FührerA 1894","author":[{"family":"Führer","given":"Alois"}],"citation-key":"FührerA 1894","container-title":"Epigraphia Indica","editor":[{"family":"Burgess","given":"James"}],"file":"Fuhrer-1894-pabhosa-inscriptions.pdf","issued":{"date-parts":[["1894"]]},"page":"240-245","title":"Pabhosa Inscriptions","type":"article-journal","volume":"II"},
  {"id":"GabrielRA 2016a","abstract":"It is one of the more startling facts of military history that the founders of three of the four 'great religions'-Judaism, Buddhism, and Islam-were also accomplished field generals with extensive experience in commanding men in battle. One of these, Muhammad, fought eight battles and was wounded twice, once almost fatally. Another, Siddhartha Gautama (later to become the Buddha), witnessed so much battlefield carnage that he suffered a psychological collapse. Moses had become so much a 'god-intoxicated' personality, it is a reasonable suspicion that he, like the Buddha, was murdered. Indeed, had the experiences of these men in war not been so successful, it is quite possible that their achievements as religious leaders would never have occurred. For all three, war and religion were so closely intertwined in their personalities that it is difficult to discern where the influence of one ended and the other began. This book attempts to explore the military lives of Moses, the Buddha and Muhammad, and the role their war experiences played in their religious lives.","author":[{"family":"Gabriel","given":"Professor Richard A."}],"citation-key":"GabrielRA 2016a","event-place":"Havertown","file":"","ISBN":"978-1-4738-5904-3","issued":{"date-parts":[["2016"]]},"language":"English","number-of-pages":"240","publisher":"Pen & Sword Books Ltd","publisher-place":"Havertown","title":"God's Generals: The Military Lives of Moses, the Buddha and Muhammad","type":"book"},
  {"id":"GanguliKM 1896a","citation-key":"GanguliKM 1896a","contributor":[{"family":"Ganguli","given":"Kisari Mohan"}],"file":"Vyasa-1896-the-mahabharata.pdf","issued":{"date-parts":[["1896"]]},"title":"The Mahabharata of Krishna-Dwaipayana Vyasa, Translated into English Prose from the Original Sanskrit Text","title-short":"The Mahabharata of Krishna-Dwaipayana Vyasa","type":"book"},
  {"id":"GeigerW 1912a","abstract":"Excerpt from Mahavamsa the Great Chronicle of CeylonEarly in 1908 the Government of Ceylon were contemplating a new and revised edition of Turnour's translation of the Mahavamsa, published in 1837 and reprinted in L. C. Wijesinha's Mahavamsa published in 1889, and were in correspondence on the subject with the Ceylon Branch of the Royal Asiatic Society. The Society appointed a numerous and influential Committee, and recommended myself as Editor for Europe. By their letter of July 18, 1908, the Government of Ceylon requested me to undertake that post. I took the opportunity at the Congress of Orientalists held at Copenhagen in August, and again at the Congress on the History of Religions held in September at Oxford, to consult my colleagues on the best plan for carrying out the proposed revision. They agreed that the method most likely to lead to a satisfactory result within a reasonable time was to entrust the work to one competent critical scholar who could, if necessary, consult members of the Ceylon Committee, but who should be himself responsible for all the details of the work. I reported to Government accordingly, and recommended that Prof. Geiger, who had just completed his edition of the text, should be asked to undertake the task. The Government approved the plan, and asked me to make the necessary arrangements. Those arrangements have resulted in the publication of the present volume.About the PublisherForgotten Books publishes hundreds of thousands of rare and classic books. Find more at www.forgottenbooks.com","citation-key":"GeigerW 1912a","contributor":[{"family":"Geiger","given":"Wilhelm"}],"event-place":"Oxford","file":"Geiger-1912-the-mahavamsa.pdf","issued":{"date-parts":[["1912"]]},"language":"English","number-of-pages":"374","publisher":"Pali Text Society","publisher-place":"Oxford","title":"The Mahavamsa, Or the Great Chronicle of Ceylon: Translated Into English","title-short":"The Mahavamsa, Or the Great Chronicle of Ceylon","type":"book"},
  {"id":"GhoshA 1956a","citation-key":"GhoshA 1956a","editor":[{"family":"Ghosh","given":"Amalananda"}],"file":"Ghosh-1956-indian-archaeology-1955-56-a-review.pdf","issued":{"date-parts":[["1956"]]},"language":"en","number-of-pages":"77","publisher":"Archaeological Survey of India","title":"Indian Archaeology, 1955-56: A Review","type":"book"},
  {"id":"GhoshA 1963a","author":[{"family":"Ghosh","given":"Amalananda"}],"citation-key":"GhoshA 1963a","container-title":"Epigraphia Indica","file":"Ghosh-1963-buddhist-inscription-from-kausambi.pdf","issue":"1961-1962","issued":{"date-parts":[["1963"]]},"page":"14-16","title":"Buddhist Inscription from Kausambi","type":"article-journal","volume":"XXXIV"},
  {"id":"GillonBS 2008a","abstract":"The Fang Bian Xin Lun is a text on Buddhist logic which is thought to be the earliest one still to be extant. It appears in Chinese only (T1632). The great Italian indologist Giuseppe Tucci, believing that the text was originally a Sanskrit text, translated it into Sanskrit and gave it the title Upāyahṛdaya. The paper provides the historical background of the development of logic in Classical India up to the time of this text, summarizes its content and translates its first section.","accessed":{"date-parts":[["2025",5,6]]},"author":[{"family":"Gillon","given":"Brendan S."}],"citation-key":"GillonBS 2008a","container-title":"Argumentation","container-title-short":"Argumentation","DOI":"10.1007/s10503-007-9076-5","file":"Gillon-2008-an-early-buddhist-text-on-logic-fang-bian-xin-lun.pdf","ISSN":"0920-427X, 1572-8374","issue":"1","issued":{"date-parts":[["2008"]]},"language":"en","page":"15-25","title":"An Early Buddhist Text on Logic: Fang Bian Xin Lun","title-short":"An Early Buddhist Text on Logic","type":"article-journal","URL":"http://link.springer.com/10.1007/s10503-007-9076-5","volume":"22"},
  {"id":"GokhaleBG 1970a","archive":"https://wakespace.lib.wfu.edu/handle/10339/102030","archive_location":"box 2 folder 4","author":[{"family":"Gokhale","given":"Balkrishna Govind"}],"citation-key":"GokhaleBG 1970a","file":"","issued":{"date-parts":[["1970"]]},"title":"The Brāhmaṇas in Early Buddhist Literature","type":"document"},
  {"id":"GokhaleBG 1977a","accessed":{"date-parts":[["2025",5,7]]},"author":[{"family":"Gokhale","given":"Balkrishna Govind"}],"citation-key":"GokhaleBG 1977a","container-title":"Journal of the American Oriental Society","container-title-short":"Journal of the American Oriental Society","DOI":"10.2307/599001","file":"","ISSN":"00030279","issue":"2","issued":{"date-parts":[["1977"]]},"page":"125","title":"The Merchant in Ancient India","type":"article-journal","URL":"https://www.jstor.org/stable/599001?origin=crossref","volume":"97"},
  {"id":"GokhaleBG 1982a","author":[{"family":"Gokhale","given":"Balkrishna Govind"}],"citation-key":"GokhaleBG 1982a","container-title":"The Journal of the International Association of Buddhist Studies","file":"Gokhale-1982-early-buddhism-and-the-urban-revolution.pdf","issue":"2","issued":{"date-parts":[["1982"]]},"page":"7–22","title":"Early Buddhism and the Urban Revolution","type":"article-journal","volume":"5"},
  {"id":"Gombrich 1987a","author":[{"family":"Gombrich","given":"Richard"}],"citation-key":"Gombrich 1987a","container-title":"The Journal of the Pali Text Society","file":"Gombrich-1987-old-bodies-like-carts.pdf","issued":{"date-parts":[["1987"]]},"page":"1–3","title":"Old Bodies Like Carts","type":"article-journal","URL":"https://archive.org/download/jpts-xi-1987/Old%20Bodies%20Like%20Carts%20-%20Richard%20Gombrich_text.pdf","volume":"11"},
  {"id":"Gombrich 1988a","abstract":"Written by the leading authority on Theravada Buddhism, this up-dated edition takes into account recent research to include the controversies over the date of the Buddha and current social and political developments in Sri Lanka. Gombrich explores the legacy of the Buddha's predecessors and the social and religious contexts against which Buddhism has developed and changed throughout history, demonstrating above all, how it has always influenced and been influenced by its social surroundings in a way which continues to this day.","author":[{"family":"Gombrich","given":"Richard"}],"citation-key":"Gombrich 1988a","event-place":"New York","file":"Gombrich-2006-theravada-buddhism-a-social-history-from-ancient-benares-to.pdf","ISBN":"978-0-415-36509-3","issued":{"date-parts":[["1988"]]},"language":"English","number-of-pages":"252","publisher":"Routledge","publisher-place":"New York","title":"Theravada Buddhism: A Social History from Ancient Benares to Modern Colombo","title-short":"Theravada Buddhism","type":"book"},
  {"id":"Gombrich 1996a","abstract":"Written by one of the world's top scholars in the field of Pali Buddhism, this new and updated edition of How Buddhism Began, discusses various important doctrines and themes in early Buddhism. It takes 'early Buddhism' to be that reflected in the Pali canon, and to some extent assumes that these doctrines reflect the teachings of the Buddha himself. Two themes predominate. Firstly, the author argues that we cannot understand the Buddha unless we understand that he was debating with other religious teachers, notably Brahmins. The other main theme concerns metaphor, allegory and literalism. This accessible, well-written book is mandatory reading for all serious students of Buddhism.","accessed":{"date-parts":[["2024",1,9]]},"author":[{"family":"Gombrich","given":"Richard"}],"citation-key":"Gombrich 1996a","file":"Gombrich_1996_How Buddhism Began.pdf","ISBN":"0-415-37123-6","issued":{"date-parts":[["1996"]]},"language":"en","publisher":"Routledge","title":"How Buddhism Began: The Conditioned Genesis of the Early Teachings","type":"book","URL":"https://www.routledge.com/How-Buddhism-Began-The-Conditioned-Genesis-of-the-Early-Teachings/Gombrich/p/book/9780415514163"},
  {"id":"Gombrich 2009a","author":[{"family":"Gombrich","given":"Richard F."}],"call-number":"BQ915 .G66 2009","citation-key":"Gombrich 2009a","collection-title":"Oxford Centre for Buddhist Studies monographs","event-place":"London ; Oakville, CT","file":"Gombrich_2009_What the Buddha thought.pdf","ISBN":"978-1-84553-612-1 978-1-84553-614-5","issued":{"date-parts":[["2009"]]},"number-of-pages":"240","publisher":"Equinox Pub","publisher-place":"London ; Oakville, CT","source":"Library of Congress ISBN","title":"What the Buddha thought","type":"book","URL":"https://ocbs.org/what-the-buddha-thought/"},
  {"id":"Gombrich 2018a","abstract":"Can studying Pali – the language of the earliest Buddhist texts – get us closer to what the Buddha actually said, in his very own words? In this short and brilliant book, Richard Gombrich suggests that this may well be possible …Richard Gombrich is Chair and Founding Director of the Oxford Centre for Buddhist Studies and one of the world’s leading authorities on early Buddhism. This book is the result of a lifetime’s dedication to the study and teaching of Pali.‘This study of the language of the Buddhist texts – and, it seems, the Buddha himself – is essential reading for anyone interested in the early history of Buddhism. It is a gem: scholarly, readable, and beautifully written too.’Charles Shaw","author":[{"family":"Gombrich","given":"Richard"}],"citation-key":"Gombrich 2018a","collection-title":"Mud Pie Slices","event-place":"Oxford","file":"","ISBN":"978-0-9934770-4-1","issued":{"date-parts":[["2018"]]},"language":"English","number-of-pages":"118","publisher":"Mud Pie","publisher-place":"Oxford","title":"Buddhism and Pali","type":"book","URL":"https://mudpiebooks.com/books-authors/buddhism-and-pali/"},
  {"id":"GriffithRTH 1895–1896a","abstract":"This scarce antiquarian book is a facsimile reprint of the original. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions that are true to the original work.","citation-key":"GriffithRTH 1895–1896a","contributor":[{"family":"Griffith","given":"Ralph T. H."}],"file":"Griffith-1895-the-hymns-of-the-atharva-veda.pdf","issued":{"date-parts":[["1895"],["1896"]]},"language":"English","number-of-pages":"499","title":"The Hymns Of The Atharva-Veda","type":"book","URL":"https://www.globalgreyebooks.com/hymns-of-the-atharva-veda-griffith-ebook.html"},
  {"id":"Heirman-Torck 2012a","accessed":{"date-parts":[["2025",5,7]]},"author":[{"family":"Heirman","given":"Ann"},{"family":"Torck","given":"Mathieu"}],"citation-key":"Heirman-Torck 2012a","file":"Heirman and Torck-2012-a-pure-mind-in-a-clean-body--bodily-care-in-the-buddhist-mo.pdf","ISBN":"978-90-382-2014-7","issued":{"date-parts":[["2012"]]},"license":"https://creativecommons.org/licenses/by-nc/3.0/","publisher":"Academia Press","title":"A Pure Mind in a Clean Body : Bodily Care in the Buddhist Monasteries of Ancient India and China","type":"book"},
  {"id":"HinüberOv 2006a","author":[{"family":"Hinüber","given":"Oskar","dropping-particle":"von"}],"citation-key":"HinüberOv 2006a","container-title":"The Journal of the International Association of Buddhist Studies","file":"Hinüber-2006-hoary-past-and-hazy-memory-on-the-history-of-early-buddhist.pdf","issue":"2","issued":{"date-parts":[["2006"]]},"page":"193–210","title":"Hoary Past and Hazy Memory: On the History of Early Buddhist Texts","type":"article-journal","URL":"https://journals.ub.uni-heidelberg.de/index.php/jiabs/article/download/8977/2870/0","volume":"29"},
  {"id":"HinüberOv 2019a","accessed":{"date-parts":[["2025",5,7]]},"author":[{"family":"Hinüber","given":"Oskar","dropping-particle":"von"}],"citation-key":"HinüberOv 2019a","container-title":"Journal of the International Association of Buddhist Studies","DOI":"10.2143/JIABS.42.0.3287480","file":"Hinüber, Oskar von-2019-the-buddha-as-a-historical-person.pdf","ISSN":"2507-0347, 2507-0347","issued":{"date-parts":[["2019"]]},"page":"231–264","title":"The Buddha as a Historical Person","type":"article-journal","volume":"42"},
  {"id":"HoeyW 1907a","accessed":{"date-parts":[["2025",5,7]]},"author":[{"family":"Hoey","given":"William"}],"citation-key":"HoeyW 1907a","container-title":"Journal of the Royal Asiatic Society of Great Britain and Ireland","file":"Hoey-1907-the-five-rivers-of-the-buddhists.pdf","ISSN":"0035869X","issued":{"date-parts":[["1907"]]},"page":"41–47","title":"The Five Rivers of the Buddhists","type":"article-journal","URL":"http://www.jstor.org/stable/25210364"},
  {"id":"HornerIB 1978a","citation-key":"HornerIB 1978a","contributor":[{"family":"Horner","given":"I. B."}],"file":"Horner-1978-the-clarifier-of-the-sweet-meaning.pdf","issued":{"date-parts":[["1978"]]},"number-of-pages":"453","publisher":"Pali Text Society","title":"The Clarifier of the Sweet Meaning (Madhuratthavilasini): Commentary of the Chronicle of the Buddha (Buddhavaṁsa) by Buddhadatta Thera","title-short":"The Clarifier of the Sweet Meaning (Madhuratthavilasini)","type":"book","URL":"https://palitextsociety.org/product/the-clarifier-of-the-sweet-meaning/"},
  {"id":"HumeRE 1921a","abstract":"This Is A New Release Of The Original 1921 Edition.","citation-key":"HumeRE 1921a","contributor":[{"family":"Hume","given":"Robert Ernest"}],"event-place":"London","file":"Hume-1921-the-thirteen-principal-upanishads.pdf","issued":{"date-parts":[["1921"]]},"language":"English","number-of-pages":"539","publisher":"Humphrey Milford","publisher-place":"London","title":"The Thirteen Principal Upanishads, with an Outline of the Philosophy of the Upanishads","type":"book"},
  {"id":"IrelandJD 1976a","abstract":".","accessed":{"date-parts":[["2025",5,8]]},"author":[{"family":"Ireland","given":"John D."}],"citation-key":"IrelandJD 1976a","container-title":"Buddhist Studies Review","container-title-short":"BSRV","DOI":"10.1558/bsrv.v1i2.13815","file":"Ireland-1976-the-kosambi-suttas.pdf","ISSN":"1747-9681, 0265-2897","issue":"2","issued":{"date-parts":[["1976"]]},"page":"105–121","title":"The Kosambi Suttas","type":"article-journal","URL":"https://journal.equinoxpub.com/BSR/article/view/13815","volume":"1"},
  {"id":"IrelandJD 1993a","abstract":".","accessed":{"date-parts":[["2025",5,8]]},"author":[{"family":"Ireland","given":"John D."}],"citation-key":"IrelandJD 1993a","container-title":"Buddhist Studies Review","container-title-short":"BSRV","DOI":"10.1558/bsrv.v10i1.15236","file":"Ireland-1993-sukaramaddava,-the-buddha's-last-meal.pdf","ISSN":"1747-9681, 0265-2897","issue":"1","issued":{"date-parts":[["1993"]]},"page":"24–26","title":"Sukaramaddava, The Buddha's Last Meal","type":"article-journal","URL":"https://journal.equinoxpub.com/BSR/article/view/15236","volume":"10"},
  {"id":"JacobiH 1884a","abstract":"The Sacred Books of the East, a 50-volume series, encompasses the seven non-Christian religions of Asia: Hinduism, Buddhism, Taoism, Confucianism, Zoroastrianism, Jainism, and Islam. Translated into English by authorities in their respective fields, these sacred texts have been edited by F. Max Muller and have profoundly influenced civilization. Jaina Sutras, Part 1 (1884), translated by Hermann Jacobi, is volume XXII of The Sacred Books of the East, a series available from Cosimo Classics. This book, in two parts, focuses on Jainism. Passed on through oral tradition, this text contains the teachings of Jain leader Mahavira, specifically the Acharanga and Kalpa sutras, the foundation of Jainism. This is a fascinating addition to the personal library of those interested in Jainism and ancient religions.","citation-key":"JacobiH 1884a","collection-title":"The Sacred Books of the East","contributor":[{"family":"Jacobi","given":"Hermann"}],"event-place":"Oxford","file":"Jacobi-1884-jaina-sūtras-1.pdf","issued":{"date-parts":[["1884"]]},"language":"English","number-of-pages":"324","publisher":"The Clarendon Press","publisher-place":"Oxford","title":"Jaina Sūtras, Part 1 of 2: The Ākārāṅga Sūtra and The Kalpa Sūtra","title-short":"Jaina Sūtras, Part 1 of 2","type":"book","volume":"22"},
  {"id":"JacobiH 1895a","abstract":"The Sacred Books of the East, a 50-volume series, encompasses the seven non-Christian religions of Asia: Hinduism, Buddhism, Taoism, Confucianism, Zoroastrianism, Jainism, and Islam. Translated into English by authorities in their respective fields, these sacred texts have been edited by F. Max Muller and have profoundly influenced civilization. Jaina Sutras, Part 1 (1884), translated by Hermann Jacobi, is volume XXII of The Sacred Books of the East, a series available from Cosimo Classics. This book, in two parts, focuses on Jainism. Passed on through oral tradition, this text contains the teachings of Jain leader Mahavira, specifically the Acharanga and Kalpa sutras, the foundation of Jainism. This is a fascinating addition to the personal library of those interested in Jainism and ancient religions.","citation-key":"JacobiH 1895a","collection-title":"The Sacred Books of the East","contributor":[{"family":"Jacobi","given":"Hermann"}],"event-place":"Oxford","file":"Jacobi-1884-jaina-sūtras-2.pdf","issued":{"date-parts":[["1895"]]},"language":"English","number-of-pages":"456","publisher":"The Clarendon Press","publisher-place":"Oxford","title":"Jaina Sūtras, Part 2 of 2: The Uttarādhyayana Sūtra and The Sūtrakritāṅga Sūtra","title-short":"Jaina Sūtras, Part 2 of 2","type":"book","volume":"45"},
  {"id":"JainiPS 1979a","author":[{"family":"Jaini","given":"Padmanabh S."}],"citation-key":"JainiPS 1979a","event-place":"Delhi","file":"","ISBN":"978-81-208-1578-0","issued":{"date-parts":[["1979"]]},"language":"English","note":"IACode: jainapathofpurif0000jain","number-of-pages":"374","publisher":"Motilal Banarsidass,India","publisher-place":"Delhi","title":"The Jaina Path of Purification","type":"book"},
  {"id":"JainiPS 2001a","author":[{"family":"Jaini","given":"Padmanabh S."}],"citation-key":"JainiPS 2001a","container-title":"Collected Papers on Buddhist Studies","event-place":"Delhi","file":"Jaini-2001-śamaṇas-their-conflict-with-brahamanical-society.pdf","ISBN":"978-81-208-1776-0","issued":{"date-parts":[["2001"]]},"language":"English","page":"47-96","publisher":"Motilal Banarsidass Publications","publisher-place":"Delhi","title":"Śamaṇas: Their Conflict with Brahamanical Society","type":"chapter"},
  {"id":"JainJC 1984a","author":[{"family":"Jain","given":"Jagdish Chandra"}],"citation-key":"JainJC 1984a","event-place":"Bombay","file":"","issued":{"date-parts":[["1984"]]},"language":"English","number-of-pages":"420","publisher":"New Book Company","publisher-place":"Bombay","title":"Life In Ancient India As Depicted In Jain Canons (with commentaries): An Administrative, Economic Social And Geographical Survey of Ancient India Based on The Jain Canons","title-short":"Life In Ancient India As Depicted In Jain Canons","type":"book"},
  {"id":"JamesW 1902a","abstract":"Being the Gifford Lectures on Natural Religion Delivered at Edinburgh in 1901‐1902\nStanding at the crossroads of psychology and religion, this catalyzing work applied the scientific method to a field abounding in abstract theory. William James believed that individual religious experiences, rather than the precepts of organized religions, were the backbone of the world's religious life. His discussions of conversion, repentance, mysticism and saintliness, and his observations on actual, personal religious experiences - all support this thesis. In his introduction, Martin E. Marty discusses how James's pluralistic view of religion led to his remarkable tolerance of extreme forms of religious behaviour, his challenging, highly original theories, and his welcome lack of pretension in all of his observations on the individual and the divine.","author":[{"family":"James","given":"William"}],"citation-key":"JamesW 1902a","event-place":"New York, London, Bombay, Calcutta, and Madras","file":"James-1917-the-varieties-of-religious-experience.pdf","ISBN":"978-0-14-039034-6","issued":{"date-parts":[["1902"]]},"language":"English","number-of-pages":"576","publisher":"Longmans, Green, And Co","publisher-place":"New York, London, Bombay, Calcutta, and Madras","title":"The Varieties of Religious Experience: A Study in Human Nature","title-short":"The Varieties of Religious Experience","type":"book"},
  {"id":"Jamison-Brereton 2014a","abstract":"The Rigveda is the oldest Sanskrit text, consisting of over one thousand hymns dedicated to various divinities of the Vedic tradition. Orally composed and orally transmitted for several millennia, the hymns display remarkable poetic complexity and religious sophistication. As the culmination of the long tradition of Indo-Iranian oral-formulaic praise poetry and the first monument of specifically Indian religiousity and literature, the Rigveda is crucial to the understanding both of Indo-European and Indo-Iranian intellectual and aesthetic prehistory and of the rich flowering of Indic religious expression and Indic high literature that were to follow.This new translation represents the first complete scholarly translation into English in over a century and utilizes the results of the intense research of the last century on the language and the ritual system of the text. The focus of this translation is on the poetic techniques and structures utilized by the bards and on the ways that the poetry intersects with and dynamically expresses the ritual underpinnings of the text.","citation-key":"Jamison-Brereton 2014a","collection-title":"South Asia Research series","contributor":[{"family":"Jamison","given":"Stephanie W."},{"family":"Brereton","given":"Joel P."}],"event-place":"New York","file":"Jamison-Brereton-2014-the-rigveda-3-volume-set.pdf","ISBN":"978-0-19-937018-4","issued":{"date-parts":[["2014"]]},"language":"English","number-of-pages":"1728","publisher":"OUP USA","publisher-place":"New York","title":"The Rigveda: 3-Volume Set","title-short":"The Rigveda","type":"book","URL":"https://global.oup.com/academic/product/the-rigveda-9780190685003"},
  {"id":"JayaswalKP 1934a","accessed":{"date-parts":[["2025",5,8]]},"author":[{"family":"Jayaswal","given":"Kashi Prasad"}],"citation-key":"JayaswalKP 1934a","contributor":[{"family":"Sāṅkṛityāyana","given":"Rāhula"}],"event-place":"Lahore","file":"K. P. Jayaswal-1934-an-imperial-history-of-india-in-a-sanskrit-text-[c.700-bc–c..pdf","issued":{"date-parts":[["1934"]]},"language":"eng","publisher":"Motilal Banarsidass","publisher-place":"Lahore","title":"An Imperial History Of India in a Sanskrit Text [c.700 BC–c.770 AD] With a Special Commentary on Later Gupta Period","title-short":"An Imperial History Of India","type":"book"},
  {"id":"JayatillekeKN 1963a","abstract":"The author of this volume, an accomplished philologist, historian and philosopher, analyzes the relevant earlier and later texts and traces the epistemological foundations of Pali canonical thought from the Vedic period onwards. Originally published in 1963, it sheds new light on later developments and elucidates from the Indian point of view some of the basic problems of the conflict between metaphysics and logical and linguistic analysis.","accessed":{"date-parts":[["2024",1,9]]},"author":[{"family":"Jayatilleke","given":"Kulatissa Nanda"}],"citation-key":"JayatillekeKN 1963a","file":"Jayatilleke_1963_Early Buddhist Theory of Knowledge.pdf","issued":{"date-parts":[["1963"]]},"language":"en","title":"Early Buddhist Theory of Knowledge","type":"book","URL":"https://www.routledge.com/Early-Buddhist-Theory-of-Knowledge/Arasteh/p/book/9780415461078"},
  {"id":"JhaDN 2016a","author":[{"family":"Jha","given":"Dwijendra Narayan"}],"citation-key":"JhaDN 2016a","container-title":"Social Scientist","file":"","issue":"5/6","issued":{"date-parts":[["2016"]]},"page":"3–10","title":"Brahmanical Intolerance in Early India","type":"article-journal","volume":"44"},
  {"id":"JonesJJ 1949a","abstract":"Translation from the Buddhist Sanskrit of a text of the Lokottaravada-Mahasamghika school; contains many parallels to canonical Pali materials","citation-key":"JonesJJ 1949a","contributor":[{"family":"Jones","given":"John James"}],"event-place":"London","file":"JonesJJ-1949-mahāvastu-volume1.pdf","issued":{"date-parts":[["1949"]]},"language":"English","number-of-pages":"324","number-of-volumes":"3","publisher":"Luzac & Co","publisher-place":"London","title":"Mahāvastu I, Translated from the Buddhist Sanskrit","type":"book","volume":"1"},
  {"id":"JonesJJ 1952a","abstract":"Translation from the Buddhist Sanskrit of a text of the Lokottaravada-Mahasamghika school; contains many parallels to canonical Pali materials","citation-key":"JonesJJ 1952a","contributor":[{"family":"Jones","given":"John James"}],"event-place":"London","file":"JonesJJ-1952-mahāvastu-volume-2.pdf","issued":{"date-parts":[["1952"]]},"language":"English","number-of-pages":"454","number-of-volumes":"3","publisher":"Luzac & Co","publisher-place":"London","title":"Mahāvastu II, Translated from the Buddhist Sanskrit","type":"book","volume":"2"},
  {"id":"JonesJJ 1956a","abstract":"Translation from the Buddhist Sanskrit of a text of the Lokottaravada-Mahasamghika school; contains many parallels to canonical Pali materials","citation-key":"JonesJJ 1956a","contributor":[{"family":"Jones","given":"John James"}],"event-place":"London","file":"JonesJJ-1956-mahāvastu-volume-3.pdf","issued":{"date-parts":[["1956"]]},"language":"English","number-of-pages":"480","number-of-volumes":"3","publisher":"Luzac & Co","publisher-place":"London","title":"Mahāvastu III, Translated from the Buddhist Sanskrit","type":"book","volume":"3"},
  {"id":"JoshiJP 1990a","citation-key":"JoshiJP 1990a","editor":[{"family":"Joshi","given":"Jagat Pati"}],"event-place":"New Delhi","file":"Joshi-1990-indian-archaeology-1985–86-—a-review.pdf","issued":{"date-parts":[["1990"]]},"publisher":"Archaeological Survey of India","publisher-place":"New Delhi","title":"Indian Archaeology, 1985–86: A Review","type":"book"},
  {"id":"JoshiLM 1983a","author":[{"family":"Joshi","given":"Lal Mani"}],"citation-key":"JoshiLM 1983a","event-place":"New Delhi","file":"Joshi-1983-discerning-the-buddha-a-study-of-buddhism-and-of-the-brahma.pdf","issued":{"date-parts":[["1983"]]},"language":"English","publisher":"Munshiram Manoharlal Publ","publisher-place":"New Delhi","title":"Discerning the Buddha: A Study of Buddhism and of the Brahmanical Hindu Attitude to it","type":"book"},
  {"id":"KarpikS 2019a","author":[{"family":"Karpik","given":"Stefan"}],"citation-key":"KarpikS 2019a","container-title":"The Journal of the Oxford Center for Buddhist Studies","file":"Karpik-2019-the-buddha-taught-in-pali-a-working-hypothesis.pdf","issued":{"date-parts":[["2019"]]},"page":"10–86","title":"The Buddha taught in Pali: A working hypothesis","type":"article-journal","URL":"http://www.jocbs.org/index.php/jocbs/article/view/191","volume":"16"},
  {"id":"KatzJ 2017a","author":[{"family":"Katz","given":"Judith"},{"family":"Saadon-Grosman","given":"Noam"},{"family":"Arzy","given":"Shahar"}],"citation-key":"KatzJ 2017a","container-title":"Consciousness and Cognition","container-title-short":"Consciousness and Cognition","DOI":"10.1016/j.concog.2016.10.011","file":"Katz-2017-the-life-review-experience.pdf","ISSN":"10538100","issued":{"date-parts":[["2017"]]},"language":"en","page":"76-86","title":"The life review experience: Qualitative and Quantitative Characteristics","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S1053810016301441","volume":"48"},
  {"id":"KaulS 2010a","abstract":"Language: EnglishPages: 292 (20 B/W Illustrations)About the Book When you think of India's ancient cities, you think of khaki archaeologists digging crumbling structures out of ancient mud. Urban spheres, Irom this perspective, often look as dull as the dust from which they emerge.  But the early Indian city wasn't like that at all, says Shonaleeka Kaul: it was certainly not only brickand-mortar, nor merely an agglomeration of built up space. In Sanskrit literature these cities were alive, vibrant, teeming with variety, Kaul examines Samkrit kavyas over about a thousand years to see what India's early historic cities were like as living, lived-in, entities. She looks at ideologies, altitudes, institutions, and practices in ancient urban areas, showing the ways in which they often cohered into a world view, a mentalite.  'Ihis is also a book about Sanskrit literature. Scholars have long argued for a nuanccd use of literary texts to achieve a more rounded understanding of ancient history, and Kaul achieves exactly that. She takes forward the idea of a Sanskrit 'literary culture', arguing that genres influence methods of historical representation. Her book gives us a fresh view of the early city, showing distinctive urban ways of thought and behaviour which relate in complex w.iys to tradition, morality, and authority. In advocating Sanskrit kavyas an important historical source, it addresses not just ancient India specialists bur also scholars of literary history: the kavyas rework history, says Kaul, providing us with 'transhistoricity' rather than 'ahistoricity.  By asking new questions about early Indian cities and ancient Indian texts, this book asks to be read by every scholar of history, urban ism, cityscapcs, literary history, Sanskrit writings, and","author":[{"family":"Kaul","given":"Shonaleeka"}],"citation-key":"KaulS 2010a","edition":"2010th edition","event-place":"Ranikhet Bangalore","file":"","ISBN":"978-81-7824-278-1","issued":{"date-parts":[["2010"]]},"language":"English","publisher":"Permanent Black","publisher-place":"Ranikhet Bangalore","title":"Imagining The Urban (Sanskrit and the City in Early India)","type":"book"},
  {"id":"KeithAB 1914a","abstract":"This work has been selected by scholars as being culturally important and is part of the knowledge base of civilization as we know it.This work is in the public domain in the United States of America, and possibly other nations. Within the United States, you may freely copy and distribute this work, as no entity (individual or corporate) has a copyright on the body of the work.Scholars believe, and we concur, that this work is important enough to be preserved, reproduced, and made generally available to the public. To ensure a quality reading experience, this work has been proofread and republished using a format that seamlessly blends the original graphical elements with text in an easy-to-read typeface.We appreciate your support of the preservation process, and thank you for being an important part of keeping this knowledge alive and relevant.","citation-key":"KeithAB 1914a","collection-number":"18–19","collection-title":"Harvard Oriental Series","contributor":[{"family":"Keith","given":"Arthur Berriedale"}],"event-place":"Cambridge, Massachusetts","file":"Keith-1914-taittiriya-sanhita-1.pdf;Keith-1914-taittiriya-sanhita-2.pdf;Keith-1914-taittiriya-sanhita-translation-only.pdf","issued":{"date-parts":[["1914"]]},"language":"English","note":"attachment-label: Part 1 Kāṇḍas I–III;Part 2 Kaṇḍas IV–VII;Translation only","number-of-pages":"660","publisher":"Harvard University Press","publisher-place":"Cambridge, Massachusetts","title":"The Veda  of the Black Yajus entitled Taittiriya Sanhita","type":"book"},
  {"id":"Kennet-Rao-Bai 2020a","abstract":"Beyond Boundaries: Religion, Region, Language and the State is a research initiative hosted by the British Museum and the British Library in London. Moving beyond geographical, chronological, disciplinary and historiographical boundaries, the books in this series explore the interactions of India and her neighbors from late antiquity to the close of the medieval.","accessed":{"date-parts":[["2025",5,8]]},"author":[{"family":"Kennet","given":"Derek"},{"family":"Rao","given":"J. Varaprasada"},{"family":"Bai","given":"M. Kasturi"}],"citation-key":"Kennet-Rao-Bai 2020a","collection-number":"5","collection-title":"Beyond Boundaries—Religion, Region, Language and the State","file":"Kennet et al.-2020-excavations-at-paithan,-maharashtra-transformations-in-earl.pdf","ISBN":"978-3-11-065354-0","issued":{"date-parts":[["2020"]]},"language":"English","publisher":"De Gruyter","title":"Excavations at Paithan, Maharashtra: Transformations in Early Historic and Early Medieval India","title-short":"Excavations at Paithan, Maharashtra","type":"book"},
  {"id":"Knitter-Haight 2015a","abstract":"Two friends, one a Christian theologian, the other a Buddhist-Christian theologian, explore how a conversation between Christians and Buddhists can clarify and support a spirituality that is experientially real (mystical) as well as socially engaged (prophetic). From basic questions about Buddha and Jesus—who were they? what did they teach? Paul Knitter and Roger Haight explore Buddhist and Christian notions about ultimate reality, human nature, spiritual practice, and the question of work for peace and social transformation. They also address the nature of interreligious dialogue and the possibilities of religious double belonging (is it possible? dangerous? necessary?).","author":[{"family":"Knitter","given":"Paul"},{"family":"Haight","given":"Roger"}],"citation-key":"Knitter-Haight 2015a","event-place":"Maryknoll, New York","file":"","ISBN":"978-1-62698-151-5","issued":{"date-parts":[["2015"]]},"language":"English","note":"IACode: jesusbuddhafrien0000knit","number-of-pages":"240","publisher":"Orbis Books","publisher-place":"Maryknoll, New York","title":"Jesus and Buddha: Friends in Conversation","type":"book"},
  {"id":"KosambiDD 1952a","author":[{"family":"Kosambi","given":"D.D."}],"citation-key":"KosambiDD 1952a","container-title":"Journal of the Bombay Branch of the Royal Asiatic Society","file":"Kosambi-1952-ancient-kosala-and-magadha.pdf","issued":{"date-parts":[["1952"]]},"title":"Ancient Kosala and Magadha","type":"article-journal"},
  {"id":"KramrischS 1981a","author":[{"family":"Kramrisch","given":"Stella"}],"citation-key":"KramrischS 1981a","collection-number":"35","collection-title":"Mythos: The Princeton/Bollingen Series in World Mythology","file":"","ISBN":"978-0-691-22422-0 978-0-691-03964-0","issued":{"date-parts":[["1981"]]},"publisher":"Princeton University Press","title":"The Presence of Siva","type":"book"},
  {"id":"KumarD 1986a","author":[{"family":"Kumar","given":"Dilip"}],"citation-key":"KumarD 1986a","collection-number":"7","collection-title":"Heritage of Ancient India","event-place":"New Delhi","file":"","issued":{"date-parts":[["1986"]]},"number-of-pages":"191","publisher":"Ramanand vidya bhawan","publisher-place":"New Delhi","title":"Archaeology of Vaishali","type":"book"},
  {"id":"LalM 1984a","author":[{"family":"Lal","given":"Makkhan"}],"citation-key":"LalM 1984a","event-place":"Delhi : New Delhi, India","file":"","issued":{"date-parts":[["1984"]]},"language":"eng","number-of-pages":"363","publisher":"B.R. Pub. Corp. ; Distributed by D.K. Publishersʾ Distributors","publisher-place":"Delhi : New Delhi, India","title":"Settlement history and Rise of Civilization in Ganga-Yamuna Doab, from 1500 B.C. to 300 A.D","type":"book"},
  {"id":"LalM 1984b","accessed":{"date-parts":[["2025",5,10]]},"author":[{"family":"Lal","given":"Makkhan"}],"citation-key":"LalM 1984b","container-title":"Man and Environment","file":"","issued":{"date-parts":[["1984"]]},"language":"en-US","page":"61-80","publisher":"Indian Society for Prehistoric and Quaternary Studies","title":"Summary of Four Seasons of Exploration in Kanpur District, Uttar Pradesh","type":"chapter","volume":"8"},
  {"id":"LalM 1987a","author":[{"family":"Lal","given":"Makkhan"}],"citation-key":"LalM 1987a","container-title":"Purātattva","file":"Lal-1987-population-distribution-and-its-movement-during-the-second-f.pdf","issued":{"date-parts":[["1987"],["1988"]]},"page":"35–53","title":"Population Distribution and its Movement During the Second-First Millennium B.C. in the Indo-Gangetic Divide and Upper Ganga Plain","type":"article-journal","URL":"https://www.indarchaeology.org/archives-content.html","volume":"18"},
  {"id":"LawBC 1932a","abstract":"A comprehensive list and review of geographical sites mentioned in early Buddhist texts, and in selected later works.","accessed":{"date-parts":[["2025",5,10]]},"author":[{"family":"Law","given":"Bimala Churn"}],"citation-key":"LawBC 1932a","event-place":"London","file":"Law-1932-geography-of-early-buddhism.pdf","issued":{"date-parts":[["1932"]]},"language":"en","publisher":"Kegan Paul, Trench,Trubner & co. Ltd.","publisher-place":"London","title":"Geography of Early Buddhism","type":"book","URL":"https://ancient-buddhist-texts.net/Reference/Geography-of-Early-Buddhism/index.htm"},
  {"id":"LawBC 1935a","author":[{"family":"Law","given":"Bimala Churn"}],"citation-key":"LawBC 1935a","collection-number":"50","collection-title":"Memoirs of the Archaeological Survey of India","file":"Law-1935-srāvastī-in-indian-literature.pdf","issued":{"date-parts":[["1935"]]},"language":"en","number-of-pages":"64","publisher":"Manager of publications","title":"Śrāvastī in Indian Literature","type":"book"},
  {"id":"LevmanBG 2008a","author":[{"family":"Levman","given":"Bryan Geoffrey"}],"citation-key":"LevmanBG 2008a","container-title":"Bulletin d'études indiennes","file":"Levman-2008-sakāya-niruttiyā-revisited.pdf","issued":{"date-parts":[["2008"],["2009"]]},"page":"33–51","title":"Sakāya niruttiyā revisited","type":"article-journal","volume":"26–27"},
  {"id":"LevmanBG 2011a","abstract":"This article examines previous scholarship on the genealogy of muṇḍa/muṇḍaka and concludes that it is of non Indo-Aryan origin. The primary meaning of the word is usually taken to mean “bald,” but it also has many additional connotations which do not appear to be connected with this primary meaning. It also occurs as a proper name, the name of an ethnic or tribal group, in place names and in a technical vocabulary associated with agriculture, architecture, chariot and wagon construction, torture, etc. The word mmuṇḍa is cognate with the Puṇḍra tribe of pre-Buddhist India, and possibly with the Mallas, the sub-Himalayan tribe who hosted the Buddha’s funeral. If one takes muṇḍa/muṇḍaka as an ethnic or tribal cognomen, many of the heretofore-unexplained meanings of the word are explainable, although the precise meaning still eludes us.","author":[{"family":"Levman","given":"Bryan Geoffrey"}],"citation-key":"LevmanBG 2011a","container-title":"Canadian Journal of Buddhist Studies","file":"Levman-2011-the-muṇḍamuṇḍaka-crux-what-does-the-word-mean.pdf","issued":{"date-parts":[["2011"]]},"page":"45–76","title":"The muṇḍa/muṇḍaka crux: What does the word mean?","type":"article-journal","volume":"7"},
  {"id":"LevmanBG 2013a","abstract":"While the linguistic influence of India’s indigenous languages on the Indo- Aryan language (IA) is well understood, the cultural impact of the autochthonous Munda, Dravidian and Tibeto-Burman speaking peoples is much harder to evaluate, due to the lack of indigenous coeval records, and later historicization of the Buddha’s life and teachings. Nevertheless, there are cultural remnants of the indigenous belief systems discoverable in the Buddhist scriptures. In this article we examine 1) The longstanding hostility between the IA immigrants and the eastern ethnic groups, especially the Buddha’s Sakya clan. 2) The Sakyas’ socio-political organization, religious and cultural values which differ significantly from those of the immigrants. 3) The concept of the Mah?puru?a which was likely an historicization of an indigenous Indian belief. 4) Indigenous belief structures like serpent- and tree-worship and the culture of sacred groves, and 5) Indigenous funeral rites in the story of the Buddha’s parinibb?na.","accessed":{"date-parts":[["2025",5,12]]},"author":[{"family":"Levman","given":"Bryan Geoffrey"}],"citation-key":"LevmanBG 2013a","container-title":"Buddhist Studies Review","container-title-short":"BSRV","DOI":"10.1558/bsrv.v30i2.145","file":"Levman-2014-cultural-remnants-of-the-indigenous-peoples-in-the-buddhist.pdf","ISSN":"1747-9681, 0265-2897","issue":"2","issued":{"date-parts":[["2013"]]},"source":"DOI.org (Crossref)","title":"Cultural Remnants of the Indigenous Peoples in the Buddhist Scriptures","type":"article-journal","URL":"https://journal.equinoxpub.com/BSR/article/view/13702","volume":"30"},
  {"id":"LevmanBG 2019a","abstract":"This article is a response to David Drewes’ hypothesis (2017: 1-25) that the Buddha was a mythic figure who did not necessarily exist as an historical fact. The article suggests that there are four criteria by which the Buddha’s historicity can be established, none of which were discussed by Drewes: 1) the historical facts presented in the Buddhist canon which are corroborated by non-canonical sources, 2) the fact that there is no plausible alternative explanation for the provenance of the teachings 3) the humanness of the Buddha as presented in the canon belies the purported mythologization which Drewes asserts and 4) a core biography of the Founder can be discerned in the Buddhist canon, once later interpolations are removed.","author":[{"family":"Levman","given":"Bryan Geoffrey"}],"citation-key":"LevmanBG 2019a","container-title":"Canadian Journal of Buddhist Studies","file":"Levman-2019-the-historical-buddha-response-to-drewes.pdf","issue":"14","issued":{"date-parts":[["2019"]]},"title":"The Historical Buddha: Response to Drewes","type":"article-journal"},
  {"id":"LevmanBG 2020a","abstract":"What language did the Buddha speak? Scholars think it was Pāli, or something very close to it. This book argues that the medium in which the Buddha spoke is just as important as the message. It answers the question, “how does the sonic content of Pāli carry the Buddha’s message, complement and enhance it?”Pāli is based on an oral, vernacular language of the people, full of natural idioms and colloquial expressions. It is the opposite of Sanskrit, the formal, abstract, liturgical language of Brahmanism. In its conversational directness, harmony and musicality, oral immediacy and visceral emotivity, Pāli speaks to the here and now, to the urgency of man’s suffering and to the practicality of a philosophy which promises to end it.Anyone interested in Theravādin Buddhism, what the Buddha taught and the special nature of the language in which he taught will find this book engaging. Buddhist practitioners will find it especially beneficial for their meditation and recitation practice. Academics in any area of Buddhism and Historical Linguistics who do not know Pāli will find it a useful introduction to the language and its evolution, while Pāli scholars will find here a unique perspective on the special role the language played in the communication of the Buddha’s teachings.","author":[{"family":"Levman","given":"Bryan Geoffrey"}],"citation-key":"LevmanBG 2020a","file":"","ISBN":"978-1-5275-4700-1","issued":{"date-parts":[["2020"]]},"language":"en","number-of-pages":"311","publisher":"Cambridge Scholars Publishing","title":"Pāli, the Language: The Medium and Message","type":"book","URL":"https://www.cambridgescholars.com/product/978-1-5275-4195-5"},
  {"id":"LevmanBG 2021a","abstract":"This book is a collection of essays on the history and evolution of the Pāli language, which preserves the earliest record of the Buddha’s teaching. Although only the Pāli record has survived, it argues that the Buddha also taught in several of the indigenous languages of northern India, including Dravidian, probably Munda and possibly others. Pāli was derived from a koiné or common language for inter-dialect communication between the different dialects spoken by the Indo-Aryan immigrants, but was also strongly influenced by the languages of the indigenous peoples, Dravidian and Munda. The language of the Buddha’s native clan, the Sakyas, was probably Dravidian, which had a Munda substrate. The Buddha was bi- or multilingual and taught in the Indo Aryan koiné of the immigrants, but also in the local language(s) of his people, whose impact may be found in extensive word and cultural borrowing from these languages into Indo-Aryan, and a significant phonological, morphological and syntactical imprint on Pāli and other Indo-Aryan languages. The book examines this influence and other factors of language change over time in the context of current theories of comparative philology.","author":[{"family":"Levman","given":"Bryan Geoffrey"}],"citation-key":"LevmanBG 2021a","event-place":"Newcastle-upon-Tyne","file":"","ISBN":"978-1-5275-7555-4 978-1-5275-7687-2","issued":{"date-parts":[["2021"]]},"language":"eng","number-of-pages":"490","publisher":"Cambridge Scholars Publisher","publisher-place":"Newcastle-upon-Tyne","title":"Pāli and Buddhism: Language and Lineage","type":"book","URL":"https://www.cambridgescholars.com/product/978-1-5275-7555-4"},
  {"id":"LingT 1973a","author":[{"family":"Ling","given":"Trevor"}],"citation-key":"LingT 1973a","event-place":"London","file":"","ISBN":"978-0-85117-042-8","issued":{"date-parts":[["1973",5,31]]},"language":"English","note":"IACode: buddhabuddhistci0000ling","number-of-pages":"288","publisher":"Maurice Temple Smith Ltd","publisher-place":"London","source":"Amazon","title":"The Buddha: Buddhist Civilization in India and Ceylon","type":"book"},
  {"id":"LiyanarataneJ 1996","author":[{"family":"Liyanaratane","given":"Jinadasa"}],"citation-key":"LiyanarataneJ 1996","container-title":"Journal of the Pali Text Society","file":"Liyanaratane-1996-pāli-canonical-passages-of-importance-for-the-history-of-ind.pdf","issued":{"date-parts":[["1996"]]},"title":"Pāli Canonical Passages of Importance for the History of Indian Medicine","type":"article-journal","volume":"XXII"},
  {"id":"MajumdarRC 1922","abstract":"This work has been selected by scholars as being culturally important, and is part of the knowledge base of civilization as we know it.This work is in the \"public domain in the United States of America, and possibly other nations. Within the United States, you may freely copy and distribute this work, as no entity (individual or corporate) has a copyright on the body of the work.Scholars believe, and we concur, that this work is important enough to be preserved, reproduced, and made generally available to the public. We appreciate your support of the preservation process, and thank you for being an important part of keeping this knowledge alive and relevant.","author":[{"family":"Majumdar","given":"Ramesh Chandra"}],"citation-key":"MajumdarRC 1922","event-place":"S.l.","file":"Majumdar-1922-corporate-life-in-ancient-india.pdf","ISBN":"978-1-01-575714-1","issued":{"date-parts":[["1922"]]},"language":"English","number-of-pages":"438","publisher":"Legare Street Press","publisher-place":"S.l.","title":"Corporate Life in Ancient India","type":"book"},
  {"id":"Malalasekera-Jayatilleke 1974a","author":[{"family":"Malalasekera","given":"Gunapala Piyasena"},{"family":"Jayatilleke","given":"Kulatissa Nanda"}],"citation-key":"Malalasekera-Jayatilleke 1974a","collection-number":"200/201","collection-title":"The Wheel","file":"Malalasekera_Jayatilleke_1974_Buddhism and the Race Question.pdf","issued":{"date-parts":[["1974"]]},"language":"en","number-of-pages":"75","publisher":"Buddhist Publication Society","title":"Buddhism and the Race Question","type":"book","URL":"https://www.bps.lk/library-search-select.php?id=wh200"},
  {"id":"ManiM 1990a","author":[{"family":"Mani","given":"B.R."}],"citation-key":"ManiM 1990a","container-title":"Purātattva","file":"","issued":{"date-parts":[["1990"],["1991"]]},"page":"43–51","title":"Identification of Setavyā, the Ancient City of Kosala with Siswania and its Terracotta Art","type":"article-journal","volume":"21"},
  {"id":"MannéJ 1992a","abstract":".","accessed":{"date-parts":[["2025",5,12]]},"author":[{"family":"Manné","given":"Joy"}],"citation-key":"MannéJ 1992a","container-title":"Buddhist Studies Review","container-title-short":"BSRV","DOI":"10.1558/bsrv.v9i2.15265","file":"Manné-1992-digha-nikaya-debates-debating-practices-at-the-time-of-the.pdf","ISSN":"1747-9681, 0265-2897","issue":"2","issued":{"date-parts":[["1992"]]},"page":"117-136","source":"DOI.org (Crossref)","title":"Digha Nikaya Debates: Debating Practices at the Time of the Buddha","title-short":"Digha Nikaya Debates","type":"article-journal","URL":"https://journal.equinoxpub.com/BSR/article/view/15265","volume":"9"},
  {"id":"Marshall-Foucher 1982a","author":[{"family":"Marshall","given":"John"},{"family":"Foucher","given":"Alfred"}],"citation-key":"Marshall-Foucher 1982a","file":"Marshall-Foucher-1982-the-monuments-of-sāñchī.pdf","issued":{"date-parts":[["1982"]]},"language":"en","number-of-pages":"book","publisher":"Swati Publications","title":"The Monuments of Sāñchī","type":"book"},
  {"id":"Masefield-Revire 2021a","author":[{"family":"Masefield","given":"Peter"},{"family":"Revire","given":"Nicolas"}],"citation-key":"Masefield-Revire 2021a","container-title":"Journal of the Oxford Centre for Buddhist Studies","file":"Masefield and Revire-2021-on-the-buddha’s-‘kammic-fluff’-the-last-meal-revisited.pdf","ISSN":"2047-1076","issued":{"date-parts":[["2021"]]},"page":"51–82","title":"On the Buddha’s ‘Kammic Fluff’: The Last Meal Revisited","title-short":"On the Buddha’s ‘Kammic Fluff’","type":"article-journal","volume":"20"},
  {"id":"Mettananda-Hinüber 2000a","author":[{"family":"Mettanando","given":"Bhikkhu"},{"family":"Hinüber","given":"Oskar","dropping-particle":"von"}],"citation-key":"Mettananda-Hinüber 2000a","container-title":"The Journal of the Pali Text Society","file":"Mettanando and Hinüber-2000-the-cause-of-the-buddha's-death.pdf","issued":{"date-parts":[["2000"]]},"page":"105–117","title":"The Cause of the Buddha's Death","type":"article-journal","volume":"26"},
  {"id":"MitraD 1972a","abstract":"Report on the work undertaken in 1962 jointly by the Department of Archaeology, His Majesty’s Government of Nepal, and the Archaeology Survey of India.","author":[{"family":"Mitra","given":"Debala"}],"citation-key":"MitraD 1972a","event-place":"Calcutta","file":"Mitra-1972-excavations-at-tilaura-kot-and-kodan-and-explorations-in-the.pdf","issued":{"date-parts":[["1972"]]},"publisher":"The Department of Archaeology, His Majesty’s Government of Nepal","publisher-place":"Calcutta","title":"Excavations at Tilaura-Kot and Kodan and Explorations in the Nepalese Tarai","type":"book"},
  {"id":"MohantyG 2007a","author":[{"family":"Mohanty","given":"Gopinath"},{"family":"Patel","given":"C.B."},{"family":"Pradhan","given":"D.R."},{"family":"Tripathy","given":"B."}],"citation-key":"MohantyG 2007a","container-title":"Orissa Review","file":"Mohanty-2007-tapussa-and-bhallika-of-orissa.pdf","issue":"Nov. 2007","issued":{"date-parts":[["2007"]]},"page":"1–11","title":"Tapussa and Bhallika of Orissa, their Historsity and Nativity","type":"article-magazine","URL":"https://magazines.odisha.gov.in/orissareview/nov-2007/novreview.htm"},
  {"id":"NakamuraH 2001a","abstract":"In Gotama Buddha, Professor Hajime Nakamura embarks on a search for the details of the historical Buddha's life. He conducts an exhaustive analysis of both the oldest, most reliable texts and later biographies of the Buddha that contain mythological material.Carefully sifting these texts to separate facts from embellishments, he constructs a biography that begins with the Indian historical context at the time of Buddha's Birth and takes the reader through all the stages of his life. Professor Nakamura also compares the oldest Buddhist texts with the earliest Jain and Hindu writings and finds surprising similarities that elucidate the significance of the historical Buddha. Archeological discoveries and factual elements from Buddhist art support Professor Nakamura's fascinating story. This is the first of two volumes; The second will be printed at a later date.","author":[{"family":"Nakamura","given":"Hajime"}],"citation-key":"NakamuraH 2001a","event-place":"Tokyo","file":"Nakamura-2001-gotama-buddha-a-biography-based-on-the-most-reliable-texts-1.pdf","ISBN":"978-4-333-01893-2","issued":{"date-parts":[["2001"]]},"language":"English","number-of-pages":"528","number-of-volumes":"2","publisher":"Rissho Kosei-kai of the UK","publisher-place":"Tokyo","title":"Gotama Buddha: A Biography Based on the Most Reliable Texts: 1","translator":[{"family":"Sekimori","given":"Gaynor"}],"type":"book","volume":"1"},
  {"id":"NakamuraH 2005a","abstract":"This second volume in a two volume set traces the Buddha's final journey from Rajagaha toward his birthplace of Kapilavatthu, detailing the many events of the Buddha's death and discussing the beginnings of his deification.","author":[{"family":"Nakamura","given":"Hajime"}],"citation-key":"NakamuraH 2005a","event-place":"Tokyo","file":"Nakamura-2001-gotama-buddha-a-biography-based-on-the-most-reliable-texts-2.pdf","ISBN":"978-4-333-02072-0","issued":{"date-parts":[["2005"]]},"language":"English","number-of-pages":"350","number-of-volumes":"2","publisher":"Rissho Kosei-kai of the UK","publisher-place":"Tokyo","title":"Gotama Buddha: A Biography Based on the Most Reliable Texts: 2","translator":[{"family":"Sekimori","given":"Gaynor"}],"type":"book","volume":"2"},
  {"id":"NeelisJ 2011a","accessed":{"date-parts":[["2025",5,13]]},"author":[{"family":"Neelis","given":"Jason"}],"citation-key":"NeelisJ 2011a","file":"Neelis-2011-early-buddhist-transmission-and-trade-networks-mobility-and.pdf","ISBN":"978-90-04-19458-8 978-90-04-18159-5","issued":{"date-parts":[["2011"]]},"publisher":"BRILL","title":"Early Buddhist Transmission and Trade Networks: Mobility and Exchange within and beyond the Northwestern Borderlands of South Asia","title-short":"Early Buddhist Transmission and Trade Networks","type":"book","URL":"https://brill.com/view/title/18172"},
  {"id":"NormanKR 1988a","author":[{"family":"Norman","given":"K. R."}],"citation-key":"NormanKR 1988a","container-title":"The Journal of Pāli and Buddhist Studies","file":"Norman-1988-the-origin-of-pāli-and-its-position-among-the-indo-european.pdf","issued":{"date-parts":[["1988"]]},"page":"1–27","title":"The Origin of Pāli and its Position among the Indo-European Languages","type":"article-journal","URL":"https://doi.org/10.20769/jpbs.1.0_1","volume":"1"},
  {"id":"NormanKR 1990a","author":[{"family":"Norman","given":"K. R."}],"citation-key":"NormanKR 1990a","collection-number":"2","collection-title":"Asian Studies - Book Archive pre-2000","container-title":"Earliest Buddhism and Madhyamaka","editor":[{"family":"Ruegg","given":"David Seyfort"}],"event-place":"Leiden Boston","file":"Norman-1990-aspects-of-early-buddhism.pdf","ISBN":"90-04-09246-3","issued":{"date-parts":[["1990"]]},"language":"eng","page":"24–35","publisher":"Brill","publisher-place":"Leiden Boston","title":"Aspects of Early Buddhism","type":"chapter"},
  {"id":"NormanKR 1992a","author":[{"family":"Norman","given":"K. R."}],"citation-key":"NormanKR 1992a","collection-title":"The Buddhist Forum","container-title":"Seminar Papers 1988-1990","editor":[{"family":"Skorupski","given":"Tadeusz"}],"event-place":"London","file":"Norman_1992_Theravāda Buddhism and Brahmanical Hinduism.pdf","issued":{"date-parts":[["1992"]]},"number-of-volumes":"6","page":"193–200","publisher":"SOAS","publisher-place":"London","title":"Theravāda Buddhism and Brahmanical Hinduism: Brahmanical Terms in a Buddhist Guise","type":"chapter","URL":"https://www.shin-ibs.edu/research/archived-publications-and-research-projects/the-buddhist-forum/the-buddhist-forum-volume-ii/","volume":"2"},
  {"id":"NormanKR 1997a","author":[{"family":"Norman","given":"K. R."}],"citation-key":"NormanKR 1997a","collection-title":"The Buddhist Forum","event-place":"London","file":"Norman_1997_A Philological Approach to Buddhism.pdf","ISBN":"0-7286-0276-8","issued":{"date-parts":[["1997"]]},"number-of-pages":"193","number-of-volumes":"6","publisher":"SOAS","publisher-place":"London","title":"A Philological Approach to Buddhism: The Bukkyō Dendō Kyōkai Lectures 1994","type":"book","URL":"https://www.shin-ibs.edu/research/archived-publications-and-research-projects/the-buddhist-forum/the-buddhist-forum-volume-v/","volume":"5"},
  {"id":"OldenbergH 1882a","abstract":"This is translation of a German work by Prof. Hermann Oldenberg. The original had attracted the attention of European scholars and the name of Oldenberg is a sufficient guarantee of the value of its contents. The distinguished author has in this work demolished the sceptical theory of a solar Buddha put forward by M. Senart. He has sifted the legendary elements of Buddhist tradition and has given the reliable residuum of facts concerning Buddha's life. He has gone to the roots of Buddhism in pre-Buddhist Brahmanism and has given to Indologists the original authorities for his views of Buddhist doctrines in Excursus at the end of the work.","author":[{"family":"Oldenberg","given":"Hermann"}],"citation-key":"OldenbergH 1882a","event-place":"London","file":"Oldenberg-1892-buddha-his-life,-his-doctrine,-his-order.pdf","issued":{"date-parts":[["1892"]]},"language":"English, German","number-of-pages":"462","publisher":"Williams and Norgate","publisher-place":"London","title":"Buddha: His Life, His Doctrine, His Order","translator":[{"family":"Hoey","given":"William"}],"type":"book"},
  {"id":"OldenbergH 1886a","abstract":"The Grihya-Sûtras; Rules of Vedic Domestic Ceremonies, Part. 1: \nSânkhâyana-Grihya Sûtra; \nÂsvalâyana-Grihya Sûtra; \nPâraskara-Grihya Sûtra; \nKhâdira-Grihya Sûtra\nHere we have grouped together the two Brfihmana authors (with the fictitious doubles, the great Kaushitaki, the great Aitareya) and the two corresponding Satra authors belonging to the two chief branches of the Rig veda literature; first comes one Brahmana author (for Kahola Kaushitaki is one person) with the Sfitra author connected with him, then the second Sfitra author and the corresponding Brfihmaﬂa teacher.","citation-key":"OldenbergH 1886a","collection-number":"29","collection-title":"The Sacred Books of the East","contributor":[{"family":"Oldenberg","given":"Hermann"}],"event-place":"Oxford","file":"Oldenberg-1886-the-grihya-sūtras-1.pdf","issued":{"date-parts":[["1886"]]},"language":"English","number-of-pages":"492","number-of-volumes":"2","publisher":"Clarendon Press","publisher-place":"Oxford","title":"The Grihya-Sūtras: Rules of Vedic Domestic Ceremonies","type":"book","volume":"1"},
  {"id":"OldenbergH 1892a","abstract":"Excerpt from The Grihya-Sûtras: Rules of Vedic Domestic Ceremonies. Part II\nGobhila, \nHiranyakesin, \nÂpastamba\nThere are, as it seems, no direct traces Of the' Grzhya ceremonies in the most ancient portion of Vedic litera ture. It is certain indeed that a number of the most important of those ceremonies are contemporaneous with or even earlier than the most ancient hymns of the Rig Veda, as far as their fundamental elements and character are concerned, whatever their precise arrangement may have been. However, in the literature of the oldest period they play no part. It was another portion of the ritual that attracted the attention of the poets to whom we owe the hymns to Agni, Indra, and the other deities of the Vedic Olympus, Viz. The Offerings Of the srauta-ritual with their far superior pomp, or, to state the matter more precisely, among the offerings of the srauta-ritual the Soma offer ing. In the Soma Offering centred the thought, the poetry, and we may almost say the life of the Vasisht/zas, of the Visvamitras, &c., in whose families the poetry Of the Rig-veda had its home. We may assume that the acts of the Grz'hya worship, being more limited in extent and Simpler in their ritual construction than the great Soma Offerings, were not yet at that time, so far as they existed at all, decked out with the reciting of the poetic texts, which we find later on connected with them, and which in the case of the Soma Offering came early to be used. Probably they were celebrated in simple unadorned fashion.About the PublisherForgotten Books publishes hundreds of thousands of rare and classic books. Find more at www.forgottenbooks.comThis book is a reproduction of an important historical work. Forgotten Books uses state-of-the-art technology to digitally reconstruct the work, preserving the original format whilst repairing imperfections present in the aged copy. In rare cases, an imperfection in the original, such as a blemish or missing page, may be replicated in our edition. We do, however, repair the vast majority of imperfections successfully; any imperfections that remain are intentionally left to preserve the state of such historical works.","citation-key":"OldenbergH 1892a","collection-number":"30","collection-title":"The Sacred Books of the East","contributor":[{"family":"Oldenberg","given":"Hermann"}],"event-place":"Oxford","file":"Oldenberg-1892-the-grihya-sūtras-2.pdf","issued":{"date-parts":[["1892"]]},"language":"English","number-of-pages":"424","number-of-volumes":"2","publisher":"The Clarendon Press","publisher-place":"Oxford","title":"The Grihya-Sūtras: Rules of Vedic Domestic Ceremonies","type":"book","volume":"2"},
  {"id":"OlivelleP 1992a","abstract":"The first readable and accurate translation of twenty of the most authoritative Hindu documents pertaining to ascetic ideals and the ascetic way of life, this text opens to students a major source for the study of the Hindu ascetical institutions and of the historical changes they underwent during a period of a thousand years or more. Beginning with an analysis of the historical context that gave rise to Indian ascetical institutions and ideologies, Patrick Olivelle moves on to elucidate the meaning of renunciation--the central institution of holiness in most Hindu traditions--and the function and significance of the various elements that constitute the rite of renunciation. The Samnyasa Upanisads will be an unparalleled source of information and insight for students of Hinduism and Indian asceticism, mysticism, and holiness.","author":[{"family":"Olivelle","given":"Patrick"}],"citation-key":"OlivelleP 1992a","event-place":"New York","file":"Olivelle-1992-saṃnyasa-upaniṣads-hindu-scriptures-on-asceticism-and-renun.pdf","ISBN":"978-0-19-507045-3","issued":{"date-parts":[["1992"]]},"language":"English","number-of-pages":"342","publisher":"Oxford University Press","publisher-place":"New York","title":"Saṃnyasa Upaniṣads: Hindu Scriptures on Asceticism and Renunciation","title-short":"Saṃnyasa Upaniṣads","type":"book"},
  {"id":"OlivelleP 1993a","abstract":"This is the first full-length study of the asrama system, a Hindu construct consisting of four legitimate ways of leading a religious life. Together with the varna (class) system, it forms one of the pillars of Hindu life. Olivelle traces its early history and how it gradually established connections with other Hindu religious institutions to emerge as one of the two central dimensions of the Hindu dharma. It represents a major study not only of Hindu religious history but also of the tradition of Indian hermeneutics.","author":[{"family":"Olivelle","given":"Patrick"}],"citation-key":"OlivelleP 1993a","event-place":"New York ; Oxford","file":"Olivelle-1993-the-āśrāma-system-the-history-and-hermeneutics-of-a-religio.pdf","ISBN":"978-0-19-508327-9","issued":{"date-parts":[["1993"]]},"language":"English","number-of-pages":"288","publisher":"OUP USA","publisher-place":"New York ; Oxford","title":"The Āśrāma System: The History and Hermeneutics of a Religious Institution","title-short":"The Āśrāma System","type":"book"},
  {"id":"OlivelleP 1998a","abstract":"This is the full edition of the early Upanisads, the central scriptures of Hinduism. Featuring Patrick Olivelle's acclaimed new English translation (Oxford, 1996), it also includes the complete Sanskrit text, as well as variant readings, scholarly emendations, and explanations of Olivelle's choices of particular readings. The volume also contains a concordance of the two recensions of the Brhadaranyaka Upanisad, and an extensive bibliography.\n             \n             \n              \n            ,  \n             This is the full edition of the early Upanisads, the central scriptures of Hinduism. Featuring Patrick Olivelle's acclaimed new English translation (Oxford, 1996), it also includes the complete Sanskrit text, as well as variant readings, scholarly emendations, and explanations of Olivelle's choices of particular readings. The volume also contains a concordance of the two recensions of the Brhadaranyaka Upanisad, and an extensive bibliography.","author":[{"family":"Olivelle","given":"Patrick"}],"citation-key":"OlivelleP 1998a","collection-title":"South Asia Research","event-place":"Oxford, New York","file":"Olivelle_1998_The Early Upanisads.pdf","ISBN":"978-0-19-512435-4","issued":{"date-parts":[["1998"]]},"note":"IACode: TheEarlyUpanisads","number-of-pages":"700","publisher":"Oxford University Press","publisher-place":"Oxford, New York","source":"Oxford University Press","title":"The Early Upanisads: Annotated Text and Translation","title-short":"The Early Upanisads","type":"book","URL":"https://global.oup.com/academic/product/the-early-upanisads-9780195124354?cc=gb&lang=en&"},
  {"id":"OlivelleP 1999a","abstract":"The Dharmasutras are the four surviving works of the ancient Indian expert tradition on the subject of dharma, or the rules of behaviour a community recognizes as binding on its members.  Written in a pithy and aphoristic style and representing the culmination of a long tradition of scholarship, the Dharmasutras record intense disputes and divergent views on such subjects as the education of the young and their rites of passage, ritual procedures and religious ceremonies, marriage and marital rights and obligations, dietary restrictions, the right professions for and the proper interaction between different social groups, sins and their expiations, institutions for the pursuit of holiness, king and the administration of justice, crimes and punishments, death and ancestral rites. In short, these unique documents give us a glimpse of how people, especially Brahmin males, were ideally expected to live their lives within an ordered and hierarchically arranged society.  In this first English translation of the Dharmasutras for over a century, Patrick Olivelle uses the same lucid and elegant style as in his award-winning translation of the Upanisads and incorporates the most recent scholarship on ancient Indian law, society, and religion. Complex material is helpfully organized, making this the ideal edition for the non-specialist as well as for students of Indian society and religion.","author":[{"family":"Olivelle","given":"Patrick"}],"citation-key":"OlivelleP 1999a","file":"Olivelle-1999-the-dharmasūtras-the-law-codes-of-ancient-india.pdf","issued":{"date-parts":[["1999"]]},"language":"English","number-of-pages":"386","publisher":"OUP Oxford","title":"The Dharmasūtras: The Law Codes of Ancient India","title-short":"The Dharmasūtras","type":"book"},
  {"id":"OlivelleP 2004a","abstract":"'Manu was seated, when the great seers came up to him: \"Please, Lord, tell us the Laws of all the social classes, as well as of those born in between...\"' The Law Code of Manu is the most authoritative and the best-known legal text of ancient India. Famous for two thousand years it still generates controversy, with Manu's verses being cited in support of the oppression of women and members of the lower castes. A seminal Hindu text, the Law Code is important for its classic description of so many social institutions that have come to be identified with Indian society. It deals with the relationships between social and ethnic groups, between men and women, the organization of the state and the judicial system, reincarnation, the workings of karma, and all aspects of the law. Patrick Olivelle's lucid translation is the first to be based on his critically edited text, and it incorporates the most recent scholarship on ancient Indian history, law, society, and religion.","author":[{"family":"Olivelle","given":"Patrick"}],"citation-key":"OlivelleP 2004a","event-place":"Oxford","file":"","ISBN":"978-0-19-280271-2","issued":{"date-parts":[["2004"]]},"language":"English","note":"IACode: lawcodeofmanu0000manu","number-of-pages":"368","publisher":"OUP Oxford","publisher-place":"Oxford","title":"The Law Code of Manu","type":"book"},
  {"id":"OlivelleP 2008a","abstract":"“Life of the Buddha” (Buddhacarita) was composed by a Buddhist monk named Ashva·ghosha in the first or second century CE probably in the north-central Indian city of Ayódhya. This text is the earliest surviving example of the Sanskrit literary genre called kāvya (ornate epic poetry) and probably provided models for Kali·dasa’s more famous poetical works. The fourteen Cantos extant in Sanskrit take the reader from the birth of Siddhártha, the future Buddha, to his Awakening when he discovered the truths of the Buddhist doctrine. Some of the most poignant scenes of the text take place when the young prince is, on the one hand, confronted by the reality of human life subject to sickness, old age, and death, and, on the other, seduced by the charms of the women employed by his father to keep him at home.\n\nAlthough it is a poetic composition of the highest order, Ashva·ghosha’s main aim is not to entertain but to instruct, to present the Buddha’s teaching as the culmination of the Brahmanical tradition. His wonderful descriptions of the lovely bodies of the courtesans are ultimately meant to show the transience of beauty:\n\nOthers, grasping branches\nof mango in full bloom,\nbent down to expose breasts\nresembling golden pots. (4.35)\n\nIn sleep these same lovely girls reveal their true nature, which prompts Siddhártha to leave home and become an ascetic:\n\nAnother was lying as if she was drunk,\nmouth wide open and saliva oozing,\nlegs wide open and genitals exposed,\nbody distorted, looking repulsive. (5.61)","citation-key":"OlivelleP 2008a","collection-title":"Clay Sanskrit","contributor":[{"family":"Olivelle","given":"Patrick"}],"file":"Olivelle-Ashvaghosha-2008-life-of-the-buddha.pdf","ISBN":"978-0-8147-6216-5","issued":{"date-parts":[["2008"]]},"language":"English","number-of-pages":"499","publisher":"New York University Press and the JJC Foundation","title":"Life of the Buddha by Aśvaghoṣa","title-short":"Life of the Buddha","type":"book","URL":"https://claysanskritlibrary.org/volumes/life-of-the-buddha/"},
  {"id":"OlivelleP 2013a","abstract":"King, Governance, and Law in Ancient India presents an English translation of Kautilya's Arthashastra (AS.) along with detailed endnotes. When it was discovered in 1923, the Arthashastra was described as perhaps the most precious work in the whole range of Sanskrit literature, an assessment that still rings true. This new translation of this significant text, the first in close to half a century takes into account a number of important advances in our knowledge of the texts, inscriptions, and archeological and art historical remains from the period in Indian history to which the AS. belongs (2nd-3rd century CE, although parts of it may be much older). The text is what we would today call a scientific treatise. It codifies a body of knowledge handed down in expert traditions. It is specifically interested in two things: first, how a king can expand his territory, keep enemies at bay, enhance his external power, and amass riches; second, how a king can best organize his state bureaucracy to consolidate his internal power, to suppress internal enemies, to expand the economy, to enhance his treasury through taxes, duties, and entrepreneurial activities, to keep law and order, and to settle disputes among his subjects. The book is accordingly divided into two sections: the first encompassing Books 1-5 deals with internal matters, and the second spanning Books 6-14 deals with external relations and warfare. The AS. stands alone: there is nothing like it before it and there is nothing after it-if there were other textual productions within that genre they are now irretrievably lost. Even though we know of many authors who preceded Kautilya, none of their works have survived the success of the AS. Being \"textually\" unique makes it difficult to understand and interpret difficult passages and terms; we cannot look to parallels for help. The AS. is also unique in that, first, it covers such a vast variety of topics and, second, it presents in textual form expert traditions in numerous areas of human and social endeavors that were handed down orally. Expert knowledge in diverse fields communicated orally from teacher to pupil, from father to son, is here for the first time codified in text. These fields include: building practices of houses, forts, and cities; gems and gemology; metals and metallurgy; mining, forestry and forest management; agriculture; manufacture of liquor; animal husbandry, shipping, and the management of horses and elephants- and so on. Finally, it is also unique in presenting a viewpoint distinctly different from the Brahmanical \"party line\" we see in most ancient Indian documents.","author":[{"family":"Olivelle","given":"Patrick"}],"citation-key":"OlivelleP 2013a","edition":"Illustrated edition","event-place":"New York","file":"","ISBN":"978-0-19-989182-5","issued":{"date-parts":[["2013"]]},"language":"English","note":"IACode: kinggovernancela0000kaua","number-of-pages":"784","publisher":"OUP USA","publisher-place":"New York","title":"King, Governance, and Law in Ancient India: Kauṭilya’s Arthaśāstra","title-short":"King, Governance, and Law in Ancient India","type":"book"},
  {"id":"OttoR 1932a","author":[{"family":"Otto","given":"Rudolf"}],"citation-key":"OttoR 1932a","event-place":"New York,","file":"Otto-1932-mysticism-east-and-west.pdf","issued":{"date-parts":[["1932"]]},"publisher":"Macmillan","publisher-place":"New York,","title":"Mysticism East and West","translator":[{"family":"Bracey","given":"Bertha L."},{"family":"Payne","given":"Richenda C."}],"type":"book"},
  {"id":"PandeGC 1978a","accessed":{"date-parts":[["2025",5,14]]},"author":[{"family":"Pande","given":"Govind Chandra"}],"citation-key":"PandeGC 1978a","collection-number":"66","collection-title":"L.D. Series","editor":[{"family":"Malvania","given":"Dalsukh Bhai"},{"family":"Shah","given":"Nagin J."}],"event-place":"Ahmedabad-9","file":"Pande-1978-śramaṇa-tradition.-its-history-and-contribution-to-indian-cu.pdf","issued":{"date-parts":[["1978"]]},"publisher":"L.D. Institute of Indology","publisher-place":"Ahmedabad-9","title":"Śramaṇa Tradition. Its History and Contribution to Indian Culture","type":"book"},
  {"id":"PandeyMS 1963a","author":[{"family":"Pandey","given":"Mithila Sharan"}],"citation-key":"PandeyMS 1963a","edition":"First Edition","file":"Pandey-1963-the-historical-geography-and-topography-of-bihar.pdf","issued":{"date-parts":[["1963"]]},"number-of-pages":"250","publisher":"Motilal Banarsidass Publishing House","title":"The Historical Geography and Topography of Bihar","type":"book"},
  {"id":"PathakV 1963a","author":[{"family":"Pathak","given":"Vishuddhanand"}],"citation-key":"PathakV 1963a","file":"Pathak-1963-history-of-kośala-up-to-the-rise-of-the-mouryas.pdf","issued":{"date-parts":[["1963"]]},"language":"en","number-of-pages":"514","publisher":"Motilal Banarsidass","title":"History of Kośala Up to the Rise of the Mouryas","type":"book"},
  {"id":"PatilDR 1963a","author":[{"family":"Patil","given":"Devendrakumar Rajaram"}],"citation-key":"PatilDR 1963a","collection-title":"Historical Research Series","event-place":"Patna","file":"Patil-1963-the-antiquarian-remains-in-bihar.pdf","issued":{"date-parts":[["1963"]]},"language":"English","number-of-pages":"665","publisher":"Kashi Prasad Jayaswal Research Institute","publisher-place":"Patna","title":"The Antiquarian Remains in Bihar","type":"book","volume":"4"},
  {"id":"PollockS 2005a","accessed":{"date-parts":[["2025",5,15]]},"author":[{"family":"Pollock","given":"Sheldon"}],"citation-key":"PollockS 2005a","container-title":"Axial Civilizations and World History","editor":[{"family":"Arnason","given":"Johann P."},{"family":"Eisenstadt","given":"Shmuel N."},{"family":"Wittrock","given":"Björn"}],"event-place":"Leiden Boston","file":"Pollock-2005-axialism-and-empire.pdf","ISBN":"978-90-474-0578-8","issued":{"date-parts":[["2005"]]},"language":"en","page":"397–450","publisher":"Brill","publisher-place":"Leiden Boston","title":"Axialism and Empire","type":"chapter","URL":"https://brill.com/display/title/11335"},
  {"id":"PostelM 1989a","abstract":"This is the first time that earrings worn in ancient India are studied comprehensively taking into account the excavated material which is compared to the earrings depicted on the sculptures of the different periods. A classification is attempted on the basis of types, shapes, materials and periods. Some revealing conclusions emerge, like the perennity of some forms, the permanency of the symbols depicted on them, which are mostly solar, their origin in the Harappan culture, and the geographical unity of the usage of certain types. A large number of coloured photographs show the earrings worn from the Harappan period into medieval India. The moulds to make metal earrings are also studied - particularly, the controversial stone discs and rings. Additionally, the nandipada or taurine symbol, the Mother Goddess, the conch shell, the beads, amulets, as also solar symbolism are studied in separate appendices, since they are relevant to this subject.","author":[{"family":"Postel","given":"Michel"}],"citation-key":"PostelM 1989a","file":"","ISBN":"978-0-10-001289-9 0-10-001289-2","issued":{"date-parts":[["1989"]]},"language":"English","number-of-pages":"323","publisher":"Franco-Indian Pharmaceuticals","title":"Ear Ornaments of Ancient India","type":"book"},
  {"id":"PrakashO 1961a","author":[{"family":"Prakash","given":"Om"}],"citation-key":"PrakashO 1961a","event-place":"Delhi","file":"Prakash-1961-food-and-drinks-in-ancient-india-from-earliest-times-to-c..pdf","issued":{"date-parts":[["1961"]]},"language":"English","number-of-pages":"341","publisher":"Munshi Ram Manohar Lal","publisher-place":"Delhi","title":"Food And Drinks In Ancient India: From Earliest Times to C. 1200 A.d.","title-short":"Food And Drinks In Ancient India","type":"book"},
  {"id":"PrasadRC 1987a","abstract":"Antiquities of Bhāgalpur District, Bihar; to 1200","author":[{"family":"Prasad","given":"Ram Chandra"}],"citation-key":"PrasadRC 1987a","collection-title":"Heritage of Ancient India","file":"","issued":{"date-parts":[["1987"]]},"number-of-pages":"124","publisher":"Ramananda Vidya Bhawan","title":"Archaeology of Champā And Vikramaśīlā","type":"book","volume":"11"},
  {"id":"PretsE 2000a","abstract":"This volume of Studia Indologiczne contained the published Proceedings of the International Conference on Sanskrit and Related Studies to Commemorate the Centenary of the Birth of Stanis³aw Schayer (1899–1941) Warsaw University, Poland, October 7–10, 1999. The title of this conference was: ‘On the Understanding of Other Cultures’","author":[{"family":"Prets","given":"Ernst"}],"citation-key":"PretsE 2000a","container-title":"Studia Indologiczne","editor":[{"family":"Balcerowicz","given":"Piotr"},{"family":"Mejor","given":"Marek"}],"file":"Prets-2000-theories-of-debate,-proof-and-counter-proof-in-the-early-ind.pdf","issued":{"date-parts":[["2000"]]},"title":"Theories of Debate, Proof and Counter-proof in the Early Indian Dialectical Tradition","type":"article-journal","volume":"7"},
  {"id":"PuriBN 1957a","abstract":"Patanjali's Mahabhasya is not merely a commentary on Panini and Katyayana, but seeks to present the politico-socio scenario of his time. The present works is based on the data, as could be culled from the relevant illustrations and citations quoted by the Bhasyakara in support of his grammatical comments, as also supported by literary and epigraphic source materials. The study concentrates not only on the date, birth-place and identity of two or more Patanjalis, but also provides a study of the political history of the Sunga-Kanva and early Andhra rulers in proper perspectives.In addition, besides the geographical background, social life in all its facets, as all the economic condition, followed by religion and literature have been fully brought out. The chapter on art and architecture is based on Bharhut and Sanci, the two contemporary art centers with rich sculptural details, and also includes a section on the terracottas of the Sunga period.The work in its totality provides a comprehensive study of the history and culture of Northern India of the Period centering round c. 150 BC. In the edition, several chapters have received fresh treatment to make the work innovative with a flair of improved style and diction.\n\nProfessor Emeritus B.N. Puri is one of the leading historians engaged in interpreting the history of India. His two works;:India in the Time of Patanjali and The History of the Gurjara Pratiharas earned him the degrees of M.Litt. and D.Phil. from the University of Oxford. Now for more than 50 years Dr. Puri has been occupied in research in different branches of Indology. His publications include India Under the Kusanas, India in Classical Greek Writings, Histor","author":[{"family":"Puri","given":"Baij Nath"}],"citation-key":"PuriBN 1957a","file":"Puri-1957-india-in-the-time-of-patañjali.pdf","issued":{"date-parts":[["1957"]]},"language":"English","number-of-pages":"272","publisher":"Munshiram Manoharlal Publishers Pvt. Ltd.","title":"India in the Time of Patañjali","type":"book"},
  {"id":"Rhys-DavidsCAF 1913a","author":[{"family":"Rhys-Davids","given":"C.A.F"}],"citation-key":"Rhys-DavidsCAF 1913a","event-place":"London","file":"Rhys-Davids-1913-psalms-of-the-early-buddhists-ii-psalms-of-the-brethren.pdf","issued":{"date-parts":[["1913"]]},"language":"English","number-of-pages":"446","publisher":"Pali Text Society","publisher-place":"London","title":"Psalms of the Early Buddhists II: Psalms of the Brethren","title-short":"Psalms of the Early Buddhists II","type":"book"},
  {"id":"Rhys-DavidsTW 1899a","author":[{"family":"Rhys-Davids","given":"T.W."}],"citation-key":"Rhys-DavidsTW 1899a","collection-number":"2","collection-title":"Sacred Books of the Buddhists","event-place":"London","file":"Rhys-Davids-1899-dialogues-of-the-buddha,-translated-fron-the-pali-of-the-dīg.pdf","issued":{"date-parts":[["1899"]]},"number-of-volumes":"3","publisher":"Henry Frowde","publisher-place":"London","title":"Dialogues of the Buddha, Translated fron the Pali of the Dīgha Nikāya","type":"book","volume":"1"},
  {"id":"Rhys-DavidsTW 1903a","author":[{"family":"Rhys-Davids","given":"T.W."}],"citation-key":"Rhys-DavidsTW 1903a","event-place":"London","file":"Rhys-Davids-1903-buddhist-india.pdf","issued":{"date-parts":[["1903"]]},"language":"English","number-of-pages":"332","publisher":"T. Fisher Unwin","publisher-place":"London","title":"Buddhist India","type":"book"},
  {"id":"Rhys-DavidsTW 1921a","author":[{"family":"Rhys-Davids","given":"T.W."},{"family":"Rhys-Davids","given":"C.A.F"}],"citation-key":"Rhys-DavidsTW 1921a","collection-number":"4","collection-title":"Sacred Books of the Buddhists","event-place":"London","file":"Rhys-Davids and Rhys-Davids-1921-dialogues-of-the-buddha,-translated-fron-the-pali-of-the-dīg.pdf","issued":{"date-parts":[["1921"]]},"number-of-volumes":"3","publisher":"Humphrey Milford","publisher-place":"London","title":"Dialogues of the Buddha, Translated fron the Pali of the Dīgha Nikāya","type":"book","volume":"3"},
  {"id":"RobertsPA 2018a","abstract":"Toh 113—Degé Kangyur, vol. 51 (mdo sde, ja), folios 1.b–180.b","citation-key":"RobertsPA 2018a","collection-title":"Degé Kangyur","contributor":[{"family":"Roberts","given":"Peter Alan"}],"file":"Roberts-2018-the-white-lotus-of-the-good-dharma.pdf","issued":{"date-parts":[["2018"]]},"publisher":"84000: Translating the Words of the Buddha","title":"The White Lotus of the Good Dharma (Saddharma­puṇḍarīka)","type":"book","URL":"https://84000.co/translation/toh113","volume":"51"},
  {"id":"RoyK 1994a","abstract":"By an analysis of myths, rituals, and prescriptions embedded in the brahmanical tradition, this book explores the institutionalization of relationships of power in early north India.","author":[{"family":"Roy","given":"Kumkum"}],"citation-key":"RoyK 1994a","event-place":"Delhi","file":"Roy-1994-the-emergence-of-monarchy-in-north-india-eighth-fourth-ce.pdf","ISBN":"978-0-19-563416-7","issued":{"date-parts":[["1994"]]},"language":"English","number-of-pages":"356","publisher":"Oxford Univ Pr","publisher-place":"Delhi","title":"The Emergence of Monarchy in North India: Eighth - Fourth Centuries B.C. : As Reflected in the Brahmanical Tradition","title-short":"The Emergence of Monarchy in North India","type":"book"},
  {"id":"RoyTN 1987a","author":[{"family":"Roy","given":"T. N"}],"citation-key":"RoyTN 1987a","container-title":"Archaeology And History, Vol. I: Essays In Memory of Shri A Ghosh","editor":[{"family":"Pande","given":"B.M."},{"family":"Chattopadhyaya","given":"B.D"}],"event-place":"Delhi","file":"","issued":{"date-parts":[["1987"]]},"publisher":"Agam Kala Prakashan","publisher-place":"Delhi","title":"Sanitary Arrangements in Northern Black Polished Ware Period, Archaeology and History","type":"chapter"},
  {"id":"SachauEC 1910a","abstract":"In 1017 CE, at the behest of Sultan Mahmud of Persia, Alberuni, also known as Al-Biruni, travelled to India toearn about the Hindus and to discuss with them questions of religion, science anditerature and what formed the very basis of their civilization. He remained in India for thirteen years, his exploration and study of the country gave way to a scholarly work that, in its profound understanding of almost all aspects of Indianife, remained unmatched for eight hundred years.","author":[{"family":"Sachau","given":"Edward C."}],"citation-key":"SachauEC 1910a","event-place":"London","file":"Sachau-1910-alberunis-india.pdf","issued":{"date-parts":[["1910"]]},"language":"English","number-of-pages":"802","publisher":"Kegan Paul, Trench, Trubner & Co. Ltd.","publisher-place":"London","title":"Alberuni's India: An Account of the Religion, Philosophy, Literature, Geography, Chronology, Astronomy, Customs, Laws and Astrology of India about AD 1030","type":"book"},
  {"id":"Salomon-Marino 2014a","author":[{"family":"Salomon","given":"Richard"},{"family":"Marino","given":"Joseph"}],"citation-key":"Salomon-Marino 2014a","container-title":"Annual Report of The International Research Institute for Advanced Buddhology at Soka University","file":"Salomon and Marino-2014-observations-on-the-deorkothar-inscriptions-and-their-signif.pdf","issued":{"date-parts":[["2014"]]},"page":"27–39","title":"Observations on the Deorkothar Inscriptions and Their Significance for the Evaluation of Buddhist Historical Traditions","type":"article-journal","volume":"17"},
  {"id":"SaraoTS 1989a","author":[{"family":"Sarao","given":"Karam Tej S"}],"citation-key":"SaraoTS 1989a","file":"Sarao-1989-the-origin-and-nature-of-ancient-indian-buddhism.pdf","issued":{"date-parts":[["1989"]]},"language":"en","number-of-pages":"178","publisher":"Eastern Book Linkers","title":"The Origin and Nature of Ancient Indian Buddhism","type":"book"},
  {"id":"SaraoTS 1990a","author":[{"family":"Sarao","given":"Karam Tej S"}],"citation-key":"SaraoTS 1990a","event-place":"New Delhi","ISBN":"978-81-215-1223-7","issued":{"date-parts":[["1990"]]},"language":"English","note":"IACode: urbancentresurba0000ktss","number-of-pages":"281","publisher":"Munshiram Manoharlal Publishers Pvt. Ltd.","publisher-place":"New Delhi","title":"Urban Centres and Urbanisation: As Reflected in the Pali Vinaya and Sutta Pitakas","type":"book"},
  {"id":"SastryT 1985a","abstract":"Works on Vedic astronomy and astrology; critical edition.","citation-key":"SastryT 1985a","contributor":[{"family":"Sastry","given":"T.S. Kuppanna"}],"file":"Sastry-1985-vedāṅga-jyotiṣa-of-lagadha-in-its-r̥k-and-yajus-recensions.pdf","issued":{"date-parts":[["1985"]]},"language":"en","number-of-pages":"140","publisher":"National Commission for the Compilation of History of Sciences in India","title":"Vedāṅga jyotiṣa of Lagadha in its R̥k and Yajus Recensions, with the translation and notes","title-short":"Vedāṅga jyotiṣa of Lagadha in its R̥k and Yajus Recensions","type":"book"},
  {"id":"SchaffP 1885a","abstract":"The Ante-Nicene Fathers, subtitled \"The Writings of the Fathers Down to A.D. 325\", is a collection of books in 10 volumes (one volume is indexes) containing English translations of the majority of Early Christian writings. The period covers the beginning of Christianity until before the promulgation of the Nicene Creed at the First Council of Nicaea. The translations are very faithful, but sometimes rather old-fashioned.The series was originally published between 1867 and 1873 by the Presbyterian publishing house T. & T. Clark in Edinburgh under the title Ante-Nicene Christian Library, as a response to the Oxford movement's Library of the Fathers which was perceived as too Roman Catholic. The volumes were edited by Rev. Alexander Roberts and James Donaldson. This series was available by subscription but the editors were unable to interest enough subscribers to commission a translation of the homilies of Origen. In 1885 a US firm, the Christian Literature Company, first of Buffalo, then New York, began to issue the volumes in a reorganised form, edited by the Episcopalian bishop of New York, A. Cleveland Coxe. Coxe gave his \"new\" series the title: The Ante-Nicene Fathers. In 1896, the American edition/revision was complete. In 1897, the volume 9 of this one which contained new translations, was published by T. & T. Clark as an additional volume to complete the original ANCL.This is Volume III: Latin Christianity: Its Founder, Tertullian, and it focuses on the work of Tertullian, who is often called the \"father of Latin Christianity.\" It brings together three of his most important works. These writings were heavily influential on the early Church, and for good reason, as they are inspirational and encouraging. These volumes also come with many useful notes.","author":[{"family":"Schaff","given":"Philip"}],"citation-key":"SchaffP 1885a","collection-title":"Ante-Nicene Fathers","editor":[{"family":"Menzies","given":"Allan"}],"event-place":"MI","file":"Schaff-1885-latin-christianity-its-founder-tertullian.pdf","issued":{"date-parts":[["1885"]]},"language":"English","number-of-volumes":"10","publisher":"Grand Rapids","publisher-place":"MI","title":"Latin Christianity: Its Founder, Tertullian","type":"book","URL":"https://www.ccel.org/ccel/schaff/anf03.html","volume":"3"},
  {"id":"SchlieterJ 2012a","accessed":{"date-parts":[["2025",5,16]]},"author":[{"family":"Schlieter","given":"Jens"}],"citation-key":"SchlieterJ 2012a","collection-title":"Dynamics in the History of Religions","container-title":"Dynamics in the History of Religions between Asia and Europe","editor":[{"family":"Krech","given":"Volkhard"},{"family":"Steinicke","given":"Marion"}],"file":"Schlieter-2012-did-the-buddha-emerge-from-a-brahmanic-environment-the-earl.pdf","issued":{"date-parts":[["2012"]]},"language":"en","page":"137–148","publisher":"Brill","title":"Did the Buddha Emerge from a Brahmanic Environment? The Early Buddhist Evaluation of “Noble Brahmins” and the “Ideological System” of Brahmanism","title-short":"Did the Buddha Emerge from a Brahmanic Environment?","type":"chapter","URL":"https://brill.com/display/book/9789004225350/B9789004225350-s008.xml","volume":"1"},
  {"id":"SchlingloffD 2014a","abstract":"Authored by one of the leading scholars of German Indology, “Fortified Cities in Ancient India” offers a comparative exploration of the development of towns and cities in ancient India. Based on in-depth textual and archeological research, Professor Dieter Schlingloff’s work presents for the first time the striking outcomes of intertwining data garnered from a wide range of sources. This volume scrutinizes much of the established knowledge on urban fortifications in South Asia, advancing new conceptions based on an authoritative, far-reaching study.","author":[{"family":"Schlingloff","given":"Dieter"}],"citation-key":"SchlingloffD 2014a","collection-title":"Cultural, Historical and Textual Studies of South Asian Religions","event-place":"London","file":"","ISBN":"978-0-85728-331-3","issued":{"date-parts":[["2014"]]},"language":"English","number-of-pages":"112","publisher":"Anthem Press","publisher-place":"London","title":"Fortified Cities of Ancient India: A Comparative Study","title-short":"Fortified Cities of Ancient India","type":"book"},
  {"id":"SchubringW 1974a","citation-key":"SchubringW 1974a","collection-title":"L.D. Series","editor":[{"family":"Schubring","given":"Walther"}],"event-place":"Ahmedabad-9","file":"Schubring-1974-isibhāsiyāiṁ.-a-jaina-text-of-early-period.pdf","issued":{"date-parts":[["1974"]]},"publisher":"L.D. Institute of Indology","publisher-place":"Ahmedabad-9","title":"Isibhāsiyāiṁ. A Jaina Text of Early Period","type":"book","volume":"45"},
  {"id":"SenC 1978a","author":[{"family":"Sen","given":"Chitrabhanu"}],"citation-key":"SenC 1978a","event-place":"Delhi","file":"Sen-1978-dictionary-of-the-vedic-rituals-based-on-the-śrauta-and-gri.pdf","ISBN":"978-81-7022-945-2","issued":{"date-parts":[["1978"]]},"language":"English","number-of-pages":"184","publisher":"Concept Publishing Company, New Delhi","publisher-place":"Delhi","title":"Dictionary of the Vedic Rituals: Based on the Śrauta and Grihya Sūtras","type":"book"},
  {"id":"SenDN 1918a","author":[{"family":"Sen","given":"D. N."}],"citation-key":"SenDN 1918a","container-title":"Journal of the Bihar and Orissa Research Society","file":"Sen-1918-sites-in-rajgir-associated-with-the-buddha-and-his-disciples.pdf","issue":"2","issued":{"date-parts":[["1918"]]},"page":"113–135","title":"Sites in Rajgir Associated with the Buddha and His Disciples","type":"article-journal","volume":"4"},
  {"id":"SharmaGR 1969a","author":[{"family":"Sharma","given":"Govardhan Raj"}],"citation-key":"SharmaGR 1969a","collection-title":"Memoirs of the Archaeological Survey of India","event-place":"Delhi","file":"Sharma-1969-excavations-at-kauśāmbī,-1949-50.pdf","issued":{"date-parts":[["1969"]]},"language":"en","number-of-pages":"328","publisher":"Manager of Publications","publisher-place":"Delhi","title":"Excavations at Kauśāmbī, 1949-50","type":"book","volume":"74"},
  {"id":"SharmaRS 1968a","author":[{"family":"Sharma","given":"R. S."}],"citation-key":"SharmaRS 1968a","container-title":"Das Kapital Centenary Volume: A Symposium","editor":[{"family":"Sen","given":"Mohit"},{"family":"Rao","given":"M. B."}],"event-place":"New Delhi","file":"Sharma-1968-material-background-of-the-rise-of-buddhism.pdf","issued":{"date-parts":[["1968"]]},"publisher":"People’s Punlishing House","publisher-place":"New Delhi","title":"Material Background of the Rise of Buddhism","title-short":"Das Kapital Centenary Volume","type":"chapter"},
  {"id":"SiegelL 1991a","abstract":"Vast like the subcontinent itself and teeming with outrageous and exotic characters, Net of Magic is an enthralling voyage through the netherworld of Indian magic. Lee Siegel, scholar and magician, uncovers the age-old practices of magic in sacred rites and rituals and unveils the contemporary world of Indian magic of street and stage entertainers.  Siegel's journeys take him from ancient Sanskrit texts to the slums of New Delhi to find remnants of a remarkable magical tradition. In the squalid settlement of Shadipur, he is initiated into a band of Muslim street conjurers and performs as their shill while they tutor him in their con and craft. Siegel also becomes acquainted with Hindu theatrical magicians, who claim descent from court illusionists and now dress as maharajahs to perform a repertoire of tricks full of poignant kitsch and glitz.  Masterfully using a panoply of narrative sleights to recreate the magical world of India, Net of Magic intersperses travelogue, history, ethnography, and fiction. Siegel's vivid, often comic tale is crowded with shills and stooges, tourists and pickpockets, snake charmers and fakirs. Among the cast of characters are Naseeb, a poor Muslim street magician who guides Siegel into the closed circle of itinerant performers; the Industrial Magician, paid by a bank, who convinces his audience to buy traveler's checks by making twenty-rupee notes disappear; the Government Magician, who does a trick with condoms to encourage family planning; P. C. Sorcar, Jr., the most celebrated Indian stage magician; and the fictive Professor M. T. Bannerji, the world's greatest magician, who assumes various guises over a millennium of Indian history and finally arrives in the conjuring capital of the world—Las Vegas.  Like Indra's net—the web of illusion in which Indian performers ensnare their audience—Net of Magic captures the reader in a seductive portrayal of a world where deception is celebrated and lies are transformed into compelling and universal truths.","author":[{"family":"Siegel","given":"Lee"}],"citation-key":"SiegelL 1991a","event-place":"New Delhi","file":"","ISBN":"978-0-226-75687-5","issued":{"date-parts":[["1991"]]},"language":"English","number-of-pages":"464","publisher":"University of Chicago Press","publisher-place":"New Delhi","title":"Net of Magic: Wonders and Deceptions in India","title-short":"Net of Magic","type":"book"},
  {"id":"SilkJ 2019a","accessed":{"date-parts":[["2025",6,2]]},"author":[{"family":"Silk","given":"Jonathan"},{"family":"Eltschinger","given":"Vincent"},{"family":"Bowring","given":"Richard"},{"family":"Radich","given":"Michael"}],"citation-key":"SilkJ 2019a","collection-title":"Handbook of Oriental Studies. Section 2 South Asia","file":"","ISBN":"978-90-04-29937-5","issued":{"date-parts":[["2019",6,20]]},"language":"en","publisher":"Brill","title":"Brill's Encyclopedia of Buddhism. Volume Two","type":"book","URL":"https://brill.com/display/title/23918","volume":"29-2"},
  {"id":"SinghU 2017a","abstract":"Mahatma Gandhi and Jawaharlal Nehru helped create the myth of a nonviolent ancient India while building a modern independence movement on the principle of nonviolence (ahimsa). But this myth obscures a troubled and complex heritage: a long struggle to reconcile the ethics of nonviolence with the need to use violence to rule. Upinder Singh documents the dynamic tension between violence and nonviolence in ancient Indian political thought and practice over twelve hundred years.Political Violence in Ancient India looks at representations of kingship and political violence in epics, religious texts, political treatises, plays, poems, inscriptions, and art from 600 BCE to 600 CE. As kings controlled their realms, fought battles, and meted out justice, intellectuals debated the boundary between the force required to sustain power and the excess that led to tyranny and oppression. Duty (dharma) and renunciation were important in this discussion, as were punishment, war, forest tribes, and the royal hunt. Singh reveals a range of perspectives that defy rigid religious categorization. Buddhists, Jainas, and even the pacifist Maurya emperor Ashoka recognized that absolute nonviolence was impossible for kings.By 600 CE religious thinkers, political theorists, and poets had justified and aestheticized political violence to a great extent. Nevertheless, questions, doubt, and dissent remained. These debates are as important for understanding political ideas in the ancient world as for thinking about the problem of political violence in our own time.","author":[{"family":"Singh","given":"Upinder"}],"citation-key":"SinghU 2017a","event-place":"Cambridge, Massachusetts","file":"Singh-2017-political-violence-in-ancient-india.pdf","ISBN":"978-0-674-97527-9","issued":{"date-parts":[["2017"]]},"language":"English","number-of-pages":"116","publisher":"Harvard UP","publisher-place":"Cambridge, Massachusetts","title":"Political Violence in Ancient India","type":"book"},
  {"id":"SinhaBP 1979a","author":[{"family":"Sinha","given":"Bindeshwari Prasad"}],"citation-key":"SinhaBP 1979a","container-title":"Archaeology and Art of India","event-place":"Delhi","file":"Sinha-1979-excavations-at-champa.pdf","issued":{"date-parts":[["1979"]]},"page":"87–106","publisher":"Swadesh Prasad Singhal for Sundeep Prakashan","publisher-place":"Delhi","title":"Excavations at Champa","type":"chapter"},
  {"id":"SinhaBP-NarainLA 1970a","author":[{"family":"Sinha","given":"Bindeshwari Prasad"},{"family":"Narain","given":"Lala Aditya"}],"citation-key":"SinhaBP-NarainLA 1970a","file":"Sinha and Narain-1970-pāṭaliputra-excavation,-1955-56.pdf","issued":{"date-parts":[["1970"]]},"language":"en","number-of-pages":"152","publisher":"Directorate of Archaeology and Museums, Bihar","title":"Pāṭaliputra Excavation, 1955-56","type":"book"},
  {"id":"SinhaBP-RoySR 1969a","author":[{"family":"Sinha","given":"Bindeshwari Prasad"},{"family":"Roy","given":"Sita Ram"}],"citation-key":"SinhaBP-RoySR 1969a","file":"Sinha and Roy-1969-vaiśālī-excavations,-1958-1962.pdf","issued":{"date-parts":[["1969"]]},"language":"en","number-of-pages":"206","publisher":"Directorate of Archaeology and Museums, Bihar","title":"Vaiśālī Excavations, 1958-1962","type":"book"},
  {"id":"SinhaI 2019a","abstract":"The early Buddhist texts record that Buddha announced his approaching nirvana to the monks at vaishali. According to historical traditions, monks followed him as he departed from Vaishali after delivering the last sermon. Buddha persuaded them to return back and presented his alms-bowl to them as memorial. To commemorate that event a stupa was built there which is now identified with kesariya stupa (in Bihar) and which falls en route from Vaishali to Kushinagar (in eastern Uttar Pradesh) where Buddha attained nirvana. This stupa finds reference in the travelogues of Fa Xian and Xuan Zang, the two celebrated Chinese monks of fifth and seventh century CE respectively. Briefly mentioned by Alexander Cunningham in 1861-62, the stupa mound at Kesariya was subjected to meticulous excavation from 1997-98 onwards by Archaeological Survey of India which is still continuing. The unearthed brick stupa is datable to Gupta period (5th-6th century CE) although an earlier phase datable to Sunga-Satavahana period (1st-2nd century CE) was also traced below it. The stupa is a six terraced structure with a cylindrical drum atop and a group of cells, with intervening polygonal designs, on each terrace enshrining stucco image of Buddha. With an extant height of about 31.5 metres and a diameter of about 123 metres, it is undoubtedly one of the tallest\nand most voluminous stupas in India. But it is most notable for its unique architecture. It can also be compared, although in a very limited sense, with the Borobudur stupa of Java islands (Indonesia) in south east Asia. With many features hitherto not found elsewhere, this stupa provides ample scope of intensive as well as extensive research.","accessed":{"date-parts":[["2025",5,16]]},"author":[{"family":"Sinha","given":"Ishani"}],"citation-key":"SinhaI 2019a","container-title":"Proceeding of the International Conference on Archaeology, History and Heritage","DOI":"10.17501/26510243.2019.1103","file":"Deccan College Post Graduate and Research Institute, Pune, Maharashtra, India and Sinha-2019-kesariya-stupa-recently-excavated-architectural-marvel.pdf","issued":{"date-parts":[["2019"]]},"page":"27–31","title":"Kesariya Stupa: Recently Excavated Architectural Marvel","type":"article-journal","URL":"http://tiikmpublishing.com/data/conferences/doi/icahh/26510243.2019.1103.pdf","volume":"1"},
  {"id":"SinhaKK 1967a","author":[{"family":"Sinha","given":"Krishna K."}],"citation-key":"SinhaKK 1967a","collection-title":"Monograph of the Department of Ancient Inian History, Culture and Archaeology","event-place":"Varanasi","file":"Sinha-1967-excavations-of-sravasti,-1959.pdf","issued":{"date-parts":[["1967"]]},"language":"en","number-of-pages":"150","publisher":"Banaras Hindu University","publisher-place":"Varanasi","title":"Excavations of Sravasti, 1959","type":"book","volume":"2"},
  {"id":"SinhaP 2001a","accessed":{"date-parts":[["2025",5,16]]},"author":[{"family":"Sinha","given":"Prakash"}],"citation-key":"SinhaP 2001a","collection-title":"History of science, philosophy, and culture in Indian civilization","container-title":"Life, thought, and culture in India: from c. 600 B.C. to c. A.D. 300","editor":[{"family":"Pande","given":"Govind Chandra"}],"event-place":"New Delhi","file":"","issued":{"date-parts":[["2001"]]},"language":"eng","publisher":"Project of History of Indian Science, Philosophy, and Culture : Centre for Studies in Civilizations : Distributed by Munshiram Manoharlal Publishers","publisher-place":"New Delhi","title":"Buddhist Sites of the Age of Buddha: Archaeological Evidence on Dating and Urbanization","type":"chapter","volume":"1"},
  {"id":"SircarD 1971a","author":[{"family":"Sircar","given":"Dineshchandra"}],"citation-key":"SircarD 1971a","container-title":"Journal of Ancient Indian History","file":"Sircar-1972-mahāmāyūrī-list-of-yaksas.pdf","issue":"Parts 1-2","issued":{"date-parts":[["1972"]]},"language":"en","page":"262–328","title":"Mahāmāyūrī: List of Yaksas","type":"article-journal","volume":"5"},
  {"id":"SivanandaSS 1989a","abstract":"The Bhagavadgita is one phase of the Tripod of Indian philosophy and culture, the other two phases being the Upanishads and the Brahmasutras. While the Upanishads lay the foundation of the loftiest reach possible for humanity and the Brahmasutras logically elucidate the intricate issues involved in the Upanishads, the Bhagavadgita blends together the Transcendent and the Immanent features of the Ultimate Reality, bringing together into an integrated whole knowledge and action, the inner and the outer, the individual and the society, man and God, all which are portrayed as facets of a universal Operation, presenting entire life and all life as a perfectly complete organic wholeness, leaving nothing unsaid and attempting to solve every problem of life.","citation-key":"SivanandaSS 1989a","contributor":[{"family":"Sivananda","given":"Sri Swami"}],"event-place":"Shivanandanagar","file":"Sivananda-1989-bhagavad-gita.pdf","ISBN":"978-81-7052-000-9","issued":{"date-parts":[["1989"]]},"language":"English","number-of-pages":"136","publisher":"The Divine Life Society","publisher-place":"Shivanandanagar","title":"Bhagavad Gita","type":"book"},
  {"id":"SpoonerDB 1916a","author":[{"family":"Spooner","given":"David Brainerd"}],"citation-key":"SpoonerDB 1916a","container-title":"Archaeological Survey of India Annual Report 1912–13","event-place":"Calcutta","file":"Spooner-1916-mr-ratan-tatas-excavations-at-pataliputra.pdf","issued":{"date-parts":[["1916"]]},"publisher":"Superintendent Government Printing, India","publisher-place":"Calcutta","title":"Mr. Ratan Tata’s Excavations at Pataliputra","type":"chapter"},
  {"id":"SrinivasanS 1979a","author":[{"family":"Srinivasan","given":"Saradha"}],"citation-key":"SrinivasanS 1979a","event-place":"Delhi","file":"Srinivasan-1979-mensuration-in-ancient-india.pdf","issued":{"date-parts":[["1979"]]},"number-of-pages":"206","publisher":"Ajanta Publications","publisher-place":"Delhi","title":"Mensuration in Ancient India","type":"book"},
  {"id":"SrivastavaKM 1986a","author":[{"family":"Srivastava","given":"Krishna Murari"}],"citation-key":"SrivastavaKM 1986a","file":"","ISBN":"978-81-85016-16-0","issued":{"date-parts":[["1986"]]},"language":"en","number-of-pages":"390","publisher":"Books & Books","title":"Discovery of Kapilavastu","type":"book"},
  {"id":"StevensonI 1997a","abstract":"Based on some 30 years of research on people who claim to remember past lives, this work encompasses the full spectrum of theory and case study on the subject to date. Early in his investigations, Stevenson became aware that some who remember past lives had birthmarks or birth defects that corresponded to wounds, usually fatal, on the person whose life was remembered. The work suggests surprising answers to such questions as the following: Why does someone born with a birth defect have the one he or she has, instead of another one? Why do some children show phobias in early infancy when they have had no traumatic experiences and no model for the phobia in their family? Why are some monozygotic (one-egg) twins markedly different from each other? Why do many boys who later become homosexual show effeminate behavior in infancy before their parents can have influenced them to do so?Writing as a scientist and a Western medical professional. Stevenson realizes that the idea that wounds on a deceased person can influence the embryo of a later-born baby is subversive of many assumptions of modern biology. Knowing that each individual case has some flaw or weakness, he decided to publish the entire corpus of cases of this sort. Photographs of birthmarks and illustrations of weapons form part of the evidence in this daring and explorative reaearch. This work will be of particular interest to physicians, psychiatrists, biologists, and anthropologists. In addition, those concerned with paranormal phenomena and the mind-brain problem will find this work challenging.","author":[{"family":"Stevenson","given":"Ian"}],"citation-key":"StevensonI 1997a","event-place":"Westport, Conn","file":"Stevenson-1997-reincarnation-and-biology-1.pdf;Stevenson-1997-reincarnation-and-biology-2.pdf","ISBN":"978-0-275-95282-2","issued":{"date-parts":[["1997"]]},"language":"English","note":"attachment-label: Very large PDFs—Part 1;Part 2","number-of-pages":"2314","publisher":"Praeger","publisher-place":"Westport, Conn","title":"Reincarnation and Biology: A Contribution to the Etiology of Birthmarks and Birth Defects","title-short":"Reincarnation and Biology","type":"book"},
  {"id":"Sucitto-Scott 2010a","author":[{"family":"Sucitto","given":"Ajahn"},{"family":"Scott","given":"Nick"}],"citation-key":"Sucitto-Scott 2010a","event-place":"Boston","file":"Sucitto-Scott-2010-rude-awakenings.pdf","issued":{"date-parts":[["2010"]]},"publisher":"Wisdom Publications","publisher-place":"Boston","title":"Where Are You Going: A Pilgrimage on Foot to the Buddhist Holy Places. Part 1, Rude Awakenings","type":"book","URL":"https://media.amaravati.org/en/dhamma-books/rude-awakenings"},
  {"id":"Sujato-Brahmali 2014a","abstract":"Dive into the rich history of Early Buddhism with this comprehensive collection of short articles. Bringing together a wealth of knowledge, this book offers a unique perspective on the historical background of Buddhism, exploring its evolution and development over time. In an academic world where the authenticity of Buddhist texts has been heavily debated, the authors believe it's time for a shift in perspective. They argue that the pendulum has swung too far towards extreme skepticism, and it's time for a more balanced and scientific approach to understanding the history of Buddhism. Whether you're a scholar, student, or simply fascinated by Buddhism, this book provides an invaluable resource for exploring the rich history of this ancient religion. So, join the authors on a journey to uncover the truth of Early Buddhism.","author":[{"family":"Sujato","given":"Bhikkhu"},{"family":"Brahmali","given":"Bhikkhu"}],"citation-key":"Sujato-Brahmali 2014a","file":"","ISBN":"978-1-312-91150-5","issued":{"date-parts":[["2014"]]},"language":"English","note":"tMS: auth","number-of-pages":"158","publisher":"Lulu.com","title":"The Authenticity of the Early Buddhist Texts","type":"book"},
  {"id":"TatiaN 1980a","author":[{"family":"Tatia","given":"N."}],"citation-key":"TatiaN 1980a","container-title":"Studies in History of Buddhism","editor":[{"family":"Narain","given":"A.K."}],"event-place":"Delhi","file":"Tatia-the-interaction-of-jainism-and-buddhism.pdf","issued":{"date-parts":[["1980"]]},"publisher":"B.R. Publishing","publisher-place":"Delhi","title":"The Interaction of Jainism and Buddhism","type":"chapter"},
  {"id":"Tatz 1985a","author":[{"family":"Tatz","given":"Mark"}],"citation-key":"Tatz 1985a","event-place":"Lanham","file":"Tatz-1985-buddhism-and-healing-demiéville's-article-byō-from-hōbōgi.pdf","ISBN":"978-0-8191-4437-9 978-0-8191-4436-2","issued":{"date-parts":[["1985"]]},"language":"eng","number-of-pages":"101","publisher":"Univ. Pr. of America","publisher-place":"Lanham","title":"Buddhism and healing: Demiéville's article \"Byō\" from Hōbōgirin","type":"book"},
  {"id":"TaylorMc 2021a","abstract":"Visnu is a central deity in the Hindu pantheon, especially in his manifestation as the seductive cattle-herding youth, Krsna. The puranas are sacred texts, which, as the Sanskrit name implies, are collections of narratives from ‘long ago’. The Visnu Purana is thus an ancient account of the universe and guide to life, which places Visnu-Krsna at the centre of creation, theology and reality itself. This text, composed about 1,500 years ago, provides a comprehensive and accessible introduction to the most important themes and narratives that constitute the Hindu imagination: the creation and destruction of the universe, the origin of gods and mortals, the peopling of the world, and the structure and conduct of ideal brahminical society. The Visnu Purana describes the trials of exemplary devotees, the existential struggles between gods and demons, and the exploits of legendary cultural heroes. It also contains many ecstatic songs of praise for the deity. The ever-popular accounts of Krsna’s love games with the cattle-herding girls of Vrndavana, which have proliferated in literature, dance, song and visual arts over the millennia, are found here in authoritative form. This faithful yet fluent blank-verse rendering of this great Hindu classic is the first new English translation in nearly 200 years. It will be welcomed by the scholarly community, while remaining readily accessible to a general readership.","citation-key":"TaylorMc 2021a","contributor":[{"family":"Taylor","given":"McComas"}],"event-place":"Acton, ACT","file":"Taylor-2021-the-visnu-purana.pdf","ISBN":"978-1-76046-440-0","issued":{"date-parts":[["2021"]]},"language":"English","number-of-pages":"578","publisher":"ANU Press Languages","publisher-place":"Acton, ACT","title":"The Visnu Purana: Ancient Annals of the God with Lotus Eyes","title-short":"The Visnu Purana","type":"book"},
  {"id":"Ṭhānissaro 2015a","author":[{"family":"Ṭhānissaro","given":"Ajahn Geoff"}],"citation-key":"Ṭhānissaro 2015a","file":"Ṭhānissaro-2015-the-buddha-smiles-humor-in-the-pali-canon.pdf","issued":{"date-parts":[["2015"]]},"title":"The Buddha Smiles: Humor in the Pali Canon","type":"book","URL":"https://www.dhammatalks.org/books/BuddhaSmiles/Section0014.html"},
  {"id":"ThaplyalKK 2004a","abstract":"In this work, an attempt has been made to present in a concise form thevarious and variegated facets of village and village life in northern India fromc.6th century BC, a great landmark in Indian history in several fields, to c.1st century, AD, by linking together pieces of evidence culled from literary andarchaeological sources. Profusely illustrated, the book throws light on the various aspects of the life ofthe village folk. Similarities and diversities between villages and towns havealso been highlighted, and an attempt has been made to distinguish between idealand real, common and rare, and change and continuity. ...","author":[{"family":"Thaplyal","given":"Kiram Kumar"}],"citation-key":"ThaplyalKK 2004a","event-place":"New Delhi","file":"","ISBN":"978-81-7305-261-3","issued":{"date-parts":[["2004"]]},"language":"English","number-of-pages":"364","publisher":"Aryan Books International","publisher-place":"New Delhi","title":"Village and Village Life in Ancient India","type":"book"},
  {"id":"TilakaratneA 2005a","author":[{"family":"Tilakaratne","given":"Asanga"}],"citation-key":"TilakaratneA 2005a","container-title":"Dhamma-Vinaya: Essays in Honour of Venerable Professor Dhammavihari (Jotiya Dhirasekera)","editor":[{"family":"Endo","given":"Toshiichi"},{"family":"Somaratne","given":"G. A."},{"family":"Nānāyakkāra","given":"Sanat"}],"file":"Tilakaratne et al.-2005-personality-differences-of-arahants-and-the-origins-of-thera.pdf","ISBN":"978-955-1271-00-8","issued":{"date-parts":[["2005"]]},"language":"en","page":"55–81","publisher":"Sri Lanka Association for Buddhist Studies","title":"Personality Differences of Arahants and the Origins of Theravada: A Study of Two Great Elders of the Theravada Tradition—Maha Kassapa and Ananda","type":"chapter"},
  {"id":"UnderhillE 1911a","abstract":"Evelyn Underhill was a poet, novelist, pacifist, and mystic, in addition to being a poet and novelist. Many of her acquaintances referred to her as \"Mrs. Moore.\" She was a prolific novelist who wrote over 30 works under her maiden name, Underhill, or the alias \"John Cordelier,\" like in the instance of The Spiral Way, published in 1912. Initially an agnostic, she gradually developed an interest in Neoplatonism and, against her husband's reservations, was gradually converted to Catholicism, finally becoming a renowned Anglo-Catholic.Baron Friedrich von Hügel, her spiritual tutor from 1921 to 1924, was complimentary of her writing but concerned about her reliance on mysticism, encouraging her to adopt a far more Christocentric vision than the theistic and intellectual one she had previously maintained.First published in 1911, this book is Evelyn Underhill's primary work about mysticism. \"The Mystic Fact\" and \"The Mystic Way\" are the book's two main sections. In the first section, Underhill takes a historical look at mysticism's theological, psychological, and philosophical foundations. Underhill discusses the use of mysticism in one's life as a means of spiritual growth in the second section.Mysticism by Evelyn Underhill provides a fantastic introduction to the search for Reality through mysticism as well as an almost comprehensive exploration of the subject. For the sake of easy readability, this version has omitted the Bibliography and Index sections, along with footnotes that readers felt made it academic and rather “heavy reading.”","author":[{"family":"Underhill","given":"Evelyn"}],"citation-key":"UnderhillE 1911a","event-place":"London","file":"Underhill-1911-mysticism.pdf","issued":{"date-parts":[["1911"]]},"language":"English","number-of-pages":"600","publisher":"Methuen & Co. Ltd.","publisher-place":"London","title":"Mysticism: A Study in Nature & Development of Spiritual Consciousness","type":"book"},
  {"id":"UpasakCS 1975a","author":[{"family":"Upasak","given":"Chandrika Singh"}],"citation-key":"UpasakCS 1975a","event-place":"Varanasi","file":"Upasak-1975-dictionary-of-early-buddhist-monastic-terms.pdf","issued":{"date-parts":[["1975"]]},"number-of-pages":"250","publisher":"Bharati Prakashan","publisher-place":"Varanasi","title":"Dictionary of Early Buddhist Monastic Terms","type":"book"},
  {"id":"VasuSC 1891–1898a","citation-key":"VasuSC 1891–1898a","contributor":[{"family":"Vasu","given":"Śrīśa Chandra"}],"file":"Vasu-1891-the-aṣṭādhyāyī-of-pāṇini.pdf","issued":{"date-parts":[["1891"],["1898"]]},"title":"The Aṣṭādhyāyī of Pāṇini interpreted according to The Kāśikāvṛtti of Jayāditya and Vāmana, and translated into English","type":"book"},
  {"id":"VerardiG 2011a","abstract":"Buddhism originated as an atinomial system, facing the opposition of both vaidika and theistic Brahmans, who socially identified themselves with the agrarian world. The two models of society generated in early historical India never merged, and Buddhism was gradually and often violently reduced to impotence. It was Gupta rule the first checkmated the antinomial model of the Buddhist.","author":[{"family":"Verardi","given":"Giovanni"}],"citation-key":"VerardiG 2011a","event-place":"New Delhi","file":"Verardi-2011-hardships-and-downfall-of-buddhism-in-india.pdf","ISBN":"978-81-7304-928-6","issued":{"date-parts":[["2011"]]},"language":"English","number-of-pages":"524","publisher":"Manohar Publishers and Distributors","publisher-place":"New Delhi","title":"Hardships and Downfall of Buddhism in India","type":"book"},
  {"id":"VishnuA 1993a","author":[{"family":"Vishnu","given":"Asha"}],"citation-key":"VishnuA 1993a","event-place":"New Delhi","file":"Vishnu-1993-material-life-of-northern-india-based-on-an-archaeological.pdf","ISBN":"978-81-7099-410-7","issued":{"date-parts":[["1993"]]},"language":"English","number-of-pages":"259","publisher":"Mittal Publications","publisher-place":"New Delhi","title":"Material life of northern India: Based on an archaeological study, 3rd century B.C. to 1st century B.C","title-short":"Material life of northern India","type":"book"},
  {"id":"VogelJP 1908a","author":[{"family":"Vogel","given":"Jean Philippe"}],"citation-key":"VogelJP 1908a","container-title":"Archaeolgical Survey of India Annual Report 1904–5","event-place":"Calcutta","file":"Vogel-1908-notes-on-excavations-at-kasia.pdf","issued":{"date-parts":[["1908"]]},"page":"43–59","publisher":"Archaeolgical Survey of India","publisher-place":"Calcutta","title":"Notes on Excavations at Kasia","type":"chapter"},
  {"id":"WagleNK 1968a","author":[{"family":"Wagle","given":"Narendra K."}],"citation-key":"WagleNK 1968a","container-title":"Journal of the Oriental Institute of Baroda","file":"","issued":{"date-parts":[["1968"]]},"title":"Minor Rites and Rituals Attributed to the Brahmins in the Nikāya Texts of the Pali Canon","type":"article-journal","volume":"17"},
  {"id":"WagleNK 1995a","abstract":"On social structure at the time of Gautama Buddha based on Tipiṭaka.","author":[{"family":"Wagle","given":"Narendra K."}],"citation-key":"WagleNK 1995a","file":"Wagle-1966-society-at-the-time-of-the-buddha.pdf","issued":{"date-parts":[["1966"]]},"language":"en","number-of-pages":"340","publisher":"Popular Prakashan","title":"Society at the Time of the Buddha","type":"book"},
  {"id":"WarderAK 1956a","abstract":"In investigating the nature of original Buddhism a consideration of its position as one among a number of contemporary historical systems, and of the way in which it may have arisen in opposition to the others, may be more illuminating than attempts to trace back the original doctrine through the history of the schools of Buddhism itself. The most important among these systems appear to have been those of the Ājīvakas, the Nirgranthas or Jainas, and the Lokayatas. Many other systems existed, and are occasionally discussed in the extant literature, but the majority failed to attract a substantial following and to persist as organized schools. We may mention the doctrines attributed to the Buddha's teachers, and perhaps the Iśvaravāda, if this was not simply a part of the older Brahmanical tradition (Iśvara = Prajapāti or Brahmā). The cults of Baladeva and Vāsudeva, which with the Kṛṣṇa and other legends were later integrated into Vaisnavism, and which probably were non-Brahmanical in origin, seem from Jaina references to have existed already in eastern India. A heterodox proto- may date back to the period of the origin of Buddhism.","accessed":{"date-parts":[["2025",5,19]]},"author":[{"family":"Warder","given":"A. K."}],"citation-key":"WarderAK 1956a","container-title":"Bulletin of the School of Oriental and African Studies","container-title-short":"Bulletin of the School of Oriental and African Studies","DOI":"10.1017/S0041977X00122207","file":"","ISSN":"0041-977X, 1474-0699","issue":"1","issued":{"date-parts":[["1956"]]},"language":"en","page":"43-63","title":"On the Relationships Between Early Buddhism and Other Contemporary Systems","type":"article-journal","volume":"18"},
  {"id":"Wasson-OFlaherty 1983a","accessed":{"date-parts":[["2025",5,20]]},"author":[{"family":"Wasson","given":"R. Gordon"},{"family":"O'Flaherty","given":"Wendy Doniger"}],"citation-key":"Wasson-OFlaherty 1983a","container-title":"Botanical Museum Leaflets, Harvard University","file":"Wasson-OFlaherty-1983-the-last-meal-of-the-buddha.pdf","ISSN":"00068098","issue":"3","issued":{"date-parts":[["1983"]]},"page":"219–249","title":"The Last Meal of the Buddha","type":"article-journal","URL":"http://www.jstor.org/stable/41762849","volume":"29"},
  {"id":"WeberM 1947a","abstract":"2012 Reprint of Original 1947 Edition. Exact facsimile of the original edition, not reproduced with Optical Recognition Software. ©New Foreword Martino Publishing. This volume contains a full and representative statement of Max Weber's sociological theory, drawn from important publications never previously translated. The book opens with a discussion of the analytical methods of sociology and an application of these methodological conclusions to the broadest classification of social relationship and groups. Nearly half the volume is devoted to a further elaboration of this scheme in the field of economic activity. The typology is copiously illustrated with material from many periods of history and parts of the world. Chapters include: The Fundamental Concepts of Sociology Sociological Categories of Economic Action The Types of Authority and Imperative Co-ordination The Transformation of Charisma in an Anti-Authoritarian Direction Social Stratification and Class Structure","author":[{"family":"Weber","given":"Max"}],"citation-key":"WeberM 1947a","event-place":"New York","file":"Weber-1947-the-theory-of-social-and-economic-organization.pdf","issued":{"date-parts":[["1947"]]},"language":"English","number-of-pages":"436","publisher":"Oxford University Press","publisher-place":"New York","title":"The Theory of Social and Economic Organization","type":"book"},
  {"id":"WezlerA 1995a","author":[{"family":"Wezler","given":"Albrecht"}],"citation-key":"WezlerA 1995a","container-title":"Journal of the European Āyurvedic Society","file":"Wezler-1995-on-the-problem-of-the-contribution-of-ascetics-and-buddhist.pdf","issued":{"date-parts":[["1995"]]},"page":"219–228","title":"On the Problem of the Contribution of Ascetics and Buddhist Monks to the Development of Indian Medicine","type":"article-journal","volume":"4"},
  {"id":"WijayaratnaM 1990a","abstract":"This book provides a brief yet detailed account of the ideal way of life prescribed for Buddhist monks and nuns in the Pali texts of the Theravada school of Buddhism. The author describes the way in which the Buddha's disciples institutionalized his teachings about such things as food, dress, money, chastity, solitude and discipleship. This tradition represents an ideal of religious life that has been followed in South and Southeast Asia for over two thousand years. In previous writing on the early period of Buddhist monasticism, scholars have usually tried to give an historical account of the evolution of the monastic order, and so have seen the extant Vinaya texts as coming from distinct historical periods. This book takes a different approach by presenting a synchronic account, which allows the author to show that sources are in fact predominantly consistent and coherent.","author":[{"family":"Wijayaratna","given":"Mohan"}],"citation-key":"WijayaratnaM 1990a","event-place":"Cambridge England ; New York","file":"Wijayaratna-1990-buddhist-monastic-life-according-to-the-texts-of-the-therav.pdf","ISBN":"978-0-521-36708-0","issued":{"date-parts":[["1990"]]},"language":"English","number-of-pages":"214","publisher":"Cambridge University Press","publisher-place":"Cambridge England ; New York","title":"Buddhist Monastic Life: According to the Texts of the Theravada Tradition","title-short":"Buddhist Monastic Life","type":"book"},
  {"id":"WijesekeraM 1941a","author":[{"family":"Wijesekera","given":"Oliver Hector de Alwis"}],"citation-key":"WijesekeraM 1941a","container-title":"Indian History Quarterly","file":"Wijesekera-1941-buddhist-evidence-for-the-early-existence-of-drama.pdf","issue":"2","issued":{"date-parts":[["1941"]]},"page":"196–206","title":"Buddhist Evidence for the Early Existence of Drama","type":"article-journal","volume":"17"},
  {"id":"WilliamsAL 1930a","citation-key":"WilliamsAL 1930a","contributor":[{"family":"Williams","given":"Arthur Lukyn"}],"event-place":"London","file":"Williams-1930-justin-martyr-the-dialogue-with-trypho.pdf","issued":{"date-parts":[["1930"]]},"publisher":"Society for Promoting Christian Knowledge","publisher-place":"London","title":"Justin Martyr: The Dialogue with Trypho. Translation, Introduction, and Notes","title-short":"Justin Martyr: The Dialogue with Trypho.","type":"book"},
  {"id":"WitzelM 1987a","author":[{"family":"Witzel","given":"Michael"}],"citation-key":"WitzelM 1987a","container-title":"Studien zur Indologie und Iranistik","file":"Witzel-1987-the-case-of-the-shattered-head.pdf","issued":{"date-parts":[["1987"]]},"page":"363–415","title":"The Case of the Shattered Head","type":"article-journal","volume":"13/14"},
  {"id":"WujastykD 1984a","author":[{"family":"Wujastyk","given":"Dominik"}],"citation-key":"WujastykD 1984a","collection-title":"New Series","container-title":"Oriental Art","file":"Wujastyk-1984-the-spikes-in-the-ears-of-the-ascetics-an-illustrated-tale.pdf","issue":"2","issued":{"date-parts":[["1984"]]},"page":"189–194","title":"The Spikes in the Ears of the Ascetics: An Illustrated Tale in Buddhism and Jainism","type":"article-journal","volume":"30"},
  {"id":"WujastykD 2022a","abstract":"The article surveys the history of South Asian literature and epigraphy for reliable evidence regarding the existence of early hospitals.  It explores the reasons that may account for the exclusion of South Asian data from international scholarship on the history of hospitals.  The widely-repeated idea that King Aśoka built hospitals is refuted.  Nevertheless, hospitals may be very early in India.  It is suggested that scholarly medical literature on the building and equipping of a hospital was transmitted to Baghdad in the late eighth century and influenced the construction of early Islamic hospitals","accessed":{"date-parts":[["2025",5,21]]},"author":[{"family":"Wujastyk","given":"Dominik"}],"citation-key":"WujastykD 2022a","container-title":"History of Science in South Asia","container-title-short":"Hist. Sci. South Asia","DOI":"10.18732/hssa70","file":"Wujastyk-2022-evidence-for-hospitals-in-early-india.pdf","ISSN":"2369-775X","issued":{"date-parts":[["2022"]]},"license":"http://creativecommons.org/licenses/by-sa/4.0","page":"1-43","title":"Evidence for Hospitals in Early India","type":"article-journal","URL":"https://journals.library.ualberta.ca/hssa/index.php/hssa/article/view/70","volume":"10"},
  {"id":"WynneA 2004a","author":[{"family":"Wynne","given":"Alexander"}],"citation-key":"WynneA 2004a","container-title":"The Journal of the International Association of Buddhist Studies","file":"Wynne-2004-the-oral-transmission-of-early-buddhist-literature.pdf","issue":"1","issued":{"date-parts":[["2004"]]},"page":"97–127","title":"The Oral Transmission of Early Buddhist Literature","type":"article-journal","URL":"https://www.academia.edu/9209691/The_Oral_Transmission_of_Early_Buddhist_Literature","volume":"27"},
  {"id":"WynneA 2007a","abstract":"Having identified early material that goes back to the Buddha himself, the author argues that the two teachers of the Buddha were historical figures. Based on the early Brahminic literature, namely the early Upanishads and Moksadharma, the author asserts the origin of the method of meditation learned by the Buddha from these teachers, and attempts to use them to identify some authentic teachings of the Buddha on meditation.Stimulating debate within the field of Buddhist Studies, the following claims are put forward:the Buddha was taught by Alara Kalama and Uddaka Ramaputta, as stated in the literature of numerous early Buddhist sects, is historically authentic Alara Kalama and Uddaka Ramaputta taught a form of early Brahminic meditation the Buddha must consequently have been trained in a meditative school whose ideology was provided by the philosophical portions of early UpanishadsShedding new light on a fascinating aspect of the origins of Buddhism, this book will be of interest to academics in the field of Buddhist studies, Asian religion and South Asian studies.","author":[{"family":"Wynne","given":"Alexander"}],"citation-key":"WynneA 2007a","file":"Wynne_2007_The Origin of Buddhist Meditation.pdf","ISBN":"978-0-415-54467-2","issued":{"date-parts":[["2007"]]},"language":"English","number-of-pages":"184","publisher":"Routledge","title":"The Origin of Buddhist Meditation","type":"book","URL":"https://www.routledge.com/The-Origin-of-Buddhist-Meditation/Wynne/p/book/9780415544672"},
  {"id":"WynneA 2019a","author":[{"family":"Wynne","given":"Alexander"}],"citation-key":"WynneA 2019a","container-title":"The Journal of the Oxford Center for Buddhist Studies","file":"Wynne-2019-did-the-buddha-exist.pdf","issued":{"date-parts":[["2019"]]},"page":"98–148","title":"Did the Buddha Exist","type":"article-journal","URL":"https://www.academia.edu/39253185/Did_the_Buddha_exist?email_work_card=view-paper","volume":"16"},
  {"id":"ZyskKG 1991a","abstract":"The rich Indian medical tradition is usually traced back to Sanskrit sources, the earliest of which cannot much antedate the common era. In this book Kenneth Zysk show that Buddhist scriptures some centuries older than this contain abundant information about medical practices, and are our earliest evidence for a rational approach to medicine in India. He argues that Buddhism and the medical tradition were mutually supportive: that Buddhist monks and people associated with them contributed to the development of medicine, while skills as physical as well as spiritual healers enhanced their reputation and popular support. Drawing on a wide range of textual, archaeological, and secondary sources, Zysk first present an overview of the history of Indian Medicine in its religious context. He then examines primary literature from the Pali Buddhist Canon and from the Sanskrit treatises of Bhela, Caraka, and Susruta. By close comparison of these convincingly shows how theories delineated in the medical classic actually become practice","author":[{"family":"Zysk","given":"Kenneth G."}],"citation-key":"ZyskKG 1991a","event-place":"Delhi","file":"Zysk-1991-asceticism-and-healing-in-ancient-india-medicine-in-the-bud.pdf","ISBN":"978-81-208-1507-0","issued":{"date-parts":[["1991"]]},"language":"English","number-of-pages":"200","publisher":"Motilal Banarsidass,","publisher-place":"Delhi","title":"Asceticism and Healing in Ancient India: Medicine in the Buddhist Monastery","title-short":"Asceticism and Healing in Ancient India","type":"book"}
]
