[
  {"id":"Abeynayake 2000a","abstract":"ISBN: 9780951895719 - Signed by Author(s) - First Edition. - Softcover - World Buddhist Foundation, London - 2000 - Condition: Very Good - Inscribed by Editor. Size: 8vo 7 3/4 - 9 3/4\". 433 pp. Binding firm, spine slightly cocked. Edges slightly marked. Inscribed by Venerable Galayaye Piyadassi, a member of the book's editorial board. Quantity Available: 1. Shipped Weight: Under 1 kilogram. Category: Religion & Theology; Modern; Philosophy. Inscribed by Editor. ISBN: 0951895710. ISBN/EAN: 9780951895719. Pictures of this item not already displayed here available upon request. Inventory No: 59036. - Buddhism for the New Millennium","accessed":{"date-parts":[["2025",12,21]]},"author":[{"family":"Abeynayake","given":"Oliver"}],"citation-key":"Abeynayake 2000a","container-title":"Buddhism for the New Millennium by Perera (ed.), Lakshman S","event-place":"London","file":"Abeynayake-2000-sri-lankas-contribution-to-the-development-of-the-pali-canon.pdf","issued":{"date-parts":[["2000"]]},"language":"en_GB","publisher":"World Buddhist Foundation","publisher-place":"London","title":"Sri Lanka’s Contribution to the Development of the Pali Canon","type":"chapter"},
  {"id":"Akanuma 1990a","citation-key":"Akanuma 1990a","editor":[{"family":"Akanuma","given":"Chizen"}],"event-place":"Delhi","file":"","ISBN":"978-81-7030-231-5","issued":{"date-parts":[["1990"]]},"language":"English","number-of-pages":"440","publisher":"Sri Satguru Publications","publisher-place":"Delhi","title":"Comparative Catalogue of Chinese Agamas and Pali Nikayas","type":"book"},
  {"id":"AllonM 1987a","author":[{"family":"Allon","given":"Mark"}],"citation-key":"AllonM 1987a","event-place":"Canberra, Australia","file":"","issued":{"date-parts":[["1987"]]},"publisher":"Australian National University","publisher-place":"Canberra, Australia","title":"The Mahā Parinirvāṇa Sūtra—translation of Das Mahāparinirvāṇa Sūtra (in 3 parts), Akadamie-Verlag, 1950, 1951 (Complete reconstructed Sanskrit Mahāparinirvāṇa Sutta) by Ernst Waldschmidt","type":"thesis"},
  {"id":"Anacker 1984a","abstract":"Vasubandhu one of the most famous Mahayana Buddhist philosophers wrote works on a vast variety of subjects. this collection of translations includes the Vadavidhi a work on logic the Panca-skandhaka-prakarana which deals with the aggregates making up 'Personality'; the Karmasiddhi prakarana, which in explaining psychic continuity, also attacks many features of earlier Buddhist psychology; the famous Vimsalika and Trimsika, which take Buddhist psychology into hitherto unexplored areas; the Madhyanta-Vibhaga-bhasya, one of the most profound books for Mahayana realization; and the Tri-svabhava-nirdesa which shows a way for ridding consciousness of ensnaring mental constructions. A glossary of key words is included, as are the texts of those works which survive in Sanskrit. Each translation is prefaced by an explanatory introduction and is followed by notes. These include also references to other Indian philosophical systems and occasional comparisons with modern Western psychological systems, particularly where the latter seem inadequate in comparison with Vasubandhu's Yogacara.","author":[{"family":"Anacker","given":"Stefan"}],"citation-key":"Anacker 1984a","event-place":"Delhi","file":"Anacker-1984-seven-works-of-vasubandhu-the-buddhist-psychological-doctor.pdf","issued":{"date-parts":[["1984"]]},"language":"English","note":"IACode:sevenworksofvasu0000vasu","number-of-pages":"490","publisher":"Motilal Banarsidass","publisher-place":"Delhi","title":"Seven Works of Vasubandhu: The Buddhist Psychological Doctor","title-short":"Seven Works of Vasubandhu","type":"book"},
  {"id":"Analayo 2003a","author":[{"family":"Anālayo","given":"Bhikkhu"}],"citation-key":"Analayo 2003a","event-place":"Cambridge","file":"Anālayo-2003-satipaṭṭhāna-the-direct-path-to-realization.pdf","ISBN":"978-1-899579-54-9","issued":{"date-parts":[["2003"]]},"language":"eng","number-of-pages":"319","publisher":"Windhorse Publ","publisher-place":"Cambridge","title":"Satipaṭṭhāna: The Direct Path to Realization","type":"book"},
  {"id":"Anesaki 1908a","author":[{"family":"Anesaki","given":"Masaharu"}],"citation-key":"Anesaki 1908a","file":"Anesaki-1908-the-four-buddhist-āgamas-in-chinese-a-concordance.pdf","issued":{"date-parts":[["1908"]]},"language":"zh-TW","number-of-pages":"164","publisher":"Kelly & Walsh l'd.","title":"The Four Buddhist Āgamas in Chinese: A Concordance of Their Parts and of the Corresponding Counterparts in the Pāli Nikāyas","title-short":"The Four Buddhist Āgamas in Chinese","type":"book"},
  {"id":"Beal 1875a","abstract":"This work is a translation of the Chinese version of the Abhinishkramana Sutra done into that language by Djnanakuta a Buddhist priest from North India. It refers to Buddha`s leaving the palace for a religious life Buddha`s flight from his palace to become an ascetic. The legend also include Buddha`s previous and subsequent history.","author":[{"family":"Beal","given":"Samuel"}],"citation-key":"Beal 1875a","file":"Beal-1875-the-romantic-legend-of-sakya-buddha.pdf","ISBN":"978-81-208-2519-2","issued":{"date-parts":[["1875"]]},"language":"en","number-of-pages":"412","publisher":"Motilal Banarsidass Publishing House","source":"Google Books","title":"The Romantic Legend Of Sakya Buddha","type":"book"},
  {"id":"Beal 1882a","author":[{"family":"Beal","given":"Samuel"}],"citation-key":"Beal 1882a","file":"Beal-1988-buddhist-literature-in-china.pdf","issued":{"date-parts":[["1988"]]},"language":"en","number-of-pages":"220","publisher":"Sri Satguru Publications","title":"Buddhist Literature in China","type":"book"},
  {"id":"Bodhi 1995a","abstract":"This book offers a complete translation of the Majjhima Nikāya, or Middle Length Discourses of the Buddha, one of the major collections of texts in the Pali Canon, the authorized scriptures of Theravāda Buddhism. This collection—among the oldest records of the historical Buddha’s original teachings—consists of 152 suttas or discourses of middle length, distinguished as such from the longer and shorter suttas of the other collections. The Majjhima Nikāya might be concisely described as the Buddhist scripture that combines the richest variety of contextual settings with the deepest and most comprehensive assortment of teachings. These teachings, which range from basic ethics to instructions in meditation and liberating insight, unfold in a fascinating procession of scenarios that show the Buddha in living dialogue with people from many different strata of ancient Indian society: with kings and princes, priests and ascetics, simple villagers and erudite philosophers. Replete with drama, reasoned argument, and illuminating parable and simile, these discourses exhibit the Buddha in the full glory of his resplendent wisdom, majestic sublimity, and compassionate humanity.\n\nThe translation is based on an original draft translation left by the English scholar-monk Bhikkhu Ñāṇamoli, which has been edited and revised by the American monk Bhikkhu Bodhi, who provides a long introduction and helpful explanatory notes. Combining lucidity of expression with accuracy, this translation enables the Buddha to speak across twenty-five centuries in language that addresses the most pressing concerns of the contemporary reader seeking clarification of the timeless issues of truth, value, and the proper conduct of life.","accessed":{"date-parts":[["2023",3,15]]},"citation-key":"Bodhi 1995a","collection-title":"Teachings of the Buddha","contributor":[{"family":"Bodhi","given":"Bhikkhu"},{"family":"Ñāṇamoli","given":"Bhikkhu"}],"event-place":"Boston","file":"","ISBN":"978-0-86171-072-0","issued":{"date-parts":[["1995"]]},"language":"en","note":"attachment-label:Contents, Preface, Introduction & Summary of Suttas","number-of-pages":"1424","publisher":"Wisdom Publications","publisher-place":"Boston","title":"The Middle Length Discourses of the Buddha: A Translation of the Majjhima Nikāya","title-short":"The Middle Length Discourses of the Buddha","type":"book","URL":"https://wisdomexperience.org/product/middle-length-discourses-buddha/"},
  {"id":"Bodhi 2000a","citation-key":"Bodhi 2000a","collection-title":"Teachings of the Buddha","contributor":[{"family":"Bodhi","given":"Bhikkhu"}],"event-place":"Boston","file":"","ISBN":"978-0-86171-331-8","issued":{"date-parts":[["2000"]]},"language":"eng","number-of-pages":"2072","publisher":"Wisdom Publications","publisher-place":"Boston","title":"The Connected Discourses of the Buddha: A Translation of the Saṃyutta Nikāya; translated from the Pāli","title-short":"The Connected Discourses of the Buddha","type":"book","URL":"https://wisdomexperience.org/product/connected-discourses-buddha/"},
  {"id":"BoinWebb-Rahula 2001a","abstract":"There are two systems of Abhidharma, according to Tibetan tradition, lower and higher. The lower system is taught in the Abhidharmakosa, while the higher system is taught in the Abhidharmasamuccaya. Thus the two books form a complementary pair. Asanga, author of the Abhidharmasamuccaya, is founder of the Yogacara school of Mahayana Buddhism. His younger brother Vasubandhu wrote the Abhidharmakosa before Asanga converted him to Mahayana Buddhism. Yet the Kosa is written in verse, usual for Mahayana treatises, while the Samuccaya follows the traditional prose question and answer style of the older Pali Abhidharma texts. Walpola Rahula, in preparing his 1971 French translation of this Mahayana text from the Sanskrit, Chinese, and Tibetan, has brought to bear on its many technical terms his extensive background and great expertise in the Pali canon. J. W. de Jong says in his review of this work:\"Rahula deserves our gratitude for his excellent translation of this difficult text.\" Sara Boin-Webb is well known for her accurate English translations of Buddhist books from the French. She has now made accessible in English Rahula's French translation, the first into a modern language, of this fundamental text.","citation-key":"BoinWebb-Rahula 2001a","contributor":[{"family":"Boin-Webb","given":"Sara"},{"family":"Rahula","given":"Walpola"}],"file":"","ISBN":"978-0-87573-020-2","issued":{"date-parts":[["2001"]]},"language":"English","number-of-pages":"358","publisher":"Jain Pub Co","title":"Abhidharmasamuccaya: The Compendium of the Higher Teaching (Philosophy) by Asaṅga","type":"book"},
  {"id":"BronkhorstJ 1985a","abstract":"Most commonly it is presented as a list of beneficial psychic characteristics (kuśala dharma) or simply psychic characteristics (dharma). Sometimes practising the items of this list is stated to be a precondition for liberation from the intoxicants (āśrava). Or else the list is said to constitute the ‘cultivation of the road’ (mārgabhāvanā). In a few instances the items of the list are characterized as ‘jewels’ (ratna). This characterization occurs where doctrine and discipline (dharmavinaya) are compared with the ocean, and finds its justification in this comparison.","accessed":{"date-parts":[["2025",12,22]]},"author":[{"family":"Bronkhorst","given":"Johannes"}],"citation-key":"BronkhorstJ 1985a","container-title":"Bulletin of SOAS","DOI":"10.1017/S0041977X00033371","file":"Bronkhorst-1985-dharma-and-abhidharma.pdf","ISSN":"1474-0699, 0041-977X","issue":"2","issued":{"date-parts":[["1985",6]]},"language":"en","page":"305–320","source":"Cambridge University Press","title":"Dharma and Abhidharma","type":"article-journal","URL":"https://www.cambridge.org/core/journals/bulletin-of-the-school-of-oriental-and-african-studies/article/abs/dharma-and-abhidharma1/4E9DC0E3E8132BE62C46B2DAD64B15B7","volume":"48"},
  {"id":"BronkhorstJ 1993a","abstract":"This book elucidates the early Buddhist teachings and beliefs concerning meditaions and its role in the process to liberation. In a number of cases, the Buddhist canonical texts reject practices which they accept elsewhere. When these practices-sometimes rejected, sometimes accepted-correspond to what is known about non-Buddhist practices, the conculsion in then proposed that they are non-Buddhist practices which have somehow found their way into the Buddhist texts. A similar procedure enables one to choose between conflicting beliefs.","author":[{"family":"Bronkhorst","given":"Johannes"}],"citation-key":"BronkhorstJ 1993a","file":"Bronkhorst-1993-two-traditions-of-meditation-in-ancient-india.pdf","ISBN":"978-81-208-1643-5","issued":{"date-parts":[["1993"]]},"language":"English","number-of-pages":"153","publisher":"Motilal Banarsidass","title":"Two Traditions of Meditation in Ancient India","type":"book"},
  {"id":"BucknellRS 2007a","abstract":"The meaning of its title, ‘Section with Verses’, may appear sufficient to explain why the Sagatha-vagga was identified as a discrete entity within the Samyuttanikaya. However, this article looks beyond that simple explanation, to discover whether some other rationale may underlie this grouping of samyuttas. It examines evidence that the compiling of the Sagatha-vagga was probably based on a familiar, although doctrinally marginal, piece of Buddhist teaching, namely the ‘eight Assemblies’.","accessed":{"date-parts":[["2025",12,22]]},"author":[{"family":"Bucknell","given":"Roderick S."}],"citation-key":"BucknellRS 2007a","container-title":"Buddhist Studies Review","container-title-short":"BSRV","DOI":"10.1558/bsrv.v24i1.7","file":"Bucknell-2007-structure-of-the-sagatha-vagga-of-the-samyutta-nikaya.pdf","ISSN":"1747-9681, 0265-2897","issue":"1","issued":{"date-parts":[["2007",5,1]]},"page":"7–34","source":"DOI.org (Crossref)","title":"Structure of the Sagatha-Vagga of the Samyutta-Nikaya","type":"article-journal","URL":"https://journal.equinoxpub.com/BSR/article/view/8852","volume":"24"},
  {"id":"CarrDM 1996a","abstract":"Historical and Literary Approaches","author":[{"family":"Carr","given":"David McLain"}],"citation-key":"CarrDM 1996a","file":"","ISBN":"978-0-664-22071-6","issued":{"date-parts":[["1996",1,1]]},"language":"en","note":"IACode: readingfractures0000carr","number-of-pages":"410","publisher":"Westminster John Knox Press","source":"Google Books","title":"Reading the Fractures of Genesis: Historical and Literary Approaches","title-short":"Reading the Fractures of Genesis","type":"book"},
  {"id":"ChangG 1983a","abstract":"The Mahāratnakūta Sūtra is one of the five major sutra groups in the Mahāyāna canon. Of the two great schools of Buddhism, Mahāyāna has the greatest number of adherents worldwide―it prevails among the Chinese, Japanese, Koreans, Tibetans, and Vietnamese―and contains within it a number of movements, notably Zen, which have been of growing interest in the West in recent decades. Yet despite this increased attention and enormous following, translations of Mahāyāna scriptures have been scarce and fragmentary; clearly, a comprehensive translation of a major work within the canon was called for.This volume addresses that need. It contains 22 of the 49 Sūtras of the Mahāratnakūta (or \"Treasury\") Sūtra, many translated for the first time in a Western language, selected and arranged to give the modern reader a progressive introduction to one of the world's major religious traditions. Subjects covered include Māyā and miracles, the teachings on Consciousness, Emptiness, and monastic discipline, the Mystical Light of the Tathāgata, and the devotional practice of Pure Land, making this a comprehensive source book of Mahāyāna Buddhism hitherto unavailable in English. The book also includes an introduction to provide historical and interpretive guidance, annotations that assist in the comprehension of difficult passages, and an extensive glossary that will be valuable to specialist and layman alike. A team of scholars, working in Taiwan, spent eight years translating the Treasury's million words from Chinese, using Tibetan texts for comparison and checking each Sūtra with an international board of scholars. In the course of translating from the original, special effort was made to retain both the devotional style appropriate for religious reading and the precision required by the scholar, while presenting the material with a clarity and flow that would make it accessible to the Western layman. The editors then selected, arranged, and annotated the 22 Sūtras presented here.Published in cooperation with The Institute for Advanced Studies of World Religions.","citation-key":"ChangG 1983a","editor":[{"family":"Chang","given":"Garma C. C."}],"event-place":"University Park, Pa","file":"Chang-1983-mahāyāna-sūtras-selections-from-the-Maharatnakuta.pdf","ISBN":"978-0-271-00341-2","issued":{"date-parts":[["1983"]]},"language":"English","number-of-pages":"512","publisher":"Pennsylvania State University Press","publisher-place":"University Park, Pa","source":"Amazon","title":"A Treasury of Mahāyāna Sūtras: Selections from the Mahāratnakūta Sūtra","title-short":"A Treasury of Mahāyāna Sūtras","type":"book"},
  {"id":"Choong 2000a","abstract":"This book is a comparative examination of the main teachings contained in the Sutranga portion of the Pali Samyutta-nikaya (SN) and its counterpart in Chinese canon, a translation of a now lost Sanskrit Samyuktagama (Za-ahan-jing) (SA). The SN and SA are essentially two different versions of the same collection of discourses.This study builds on the work of Yin Shun, which demonstrates the historical importance of SN/SA in the formation of the early Buddhist canon. In particular, it is based on Yin Shun's recognition of the three-anga structure of SN/SA, and of the status of its Sutranga portion as of prime importance in the historical formation of this nikaya/agama, and as containing the most fundamental teachings of Buddha. The aim of this research is to reveal and clarify the similarities and differences between SN and SA, with regard to the principal Buddhist teachings contained in their Sutranga portion.","author":[{"family":"Choong","given":"Mun-Keat"}],"citation-key":"Choong 2000a","collection-number":"32","collection-title":"Contributions to Indology","event-place":"Wiesbaden","file":"Choong_2000_The Fundamental Teachings of Early Buddhism, A Comparative Study Based on the.pdf","ISBN":"978-3-447-04232-1","issued":{"date-parts":[["2000"]]},"language":"English","number-of-pages":"269","publisher":"Harrassowitz","publisher-place":"Wiesbaden","title":"The Fundamental Teachings of Early Buddhism, A Comparative Study Based on the Sūtrāṅga portion of the Pāli Saṃyutta-Nikāya and the Chinese Saṃyuktāgama","title-short":"The Fundamental Teachings of Early Buddhism","type":"book","URL":"https://www.harrassowitz-verlag.de/The_Fundamental_Teachings_of_Early_Buddhism/titel_421.ahtml"},
  {"id":"ClearyT 1993a","abstract":"A masterful translation of one of the most influential Buddhist sutras—the Avatamsaka Sutra—by one of the greatest translators of Buddhist texts of our time  Known in Chinese as Hua-yen and in Japanese as Kegon-kyo, the Avatamsaka Sutra, or Flower Ornament Scripture, is held in the highest regard and studied by Buddhists of all traditions. Through its structure and symbolism, as well as through its concisely stated principles, it conveys a vast range of Buddhist teachings. This one-volume edition contains Thomas Cleary’s definitive translation of all thirty-nine books of the sutra, along with an introduction, a glossary, and Cleary’s translation of Li Tongxuan’s seventh-century guide to the final book, the Gandavyuha, “Entry into the Realm of Reality.”","author":[{"family":"Cleary","given":"Thomas"}],"citation-key":"ClearyT 1993a","event-place":"Boston","file":"Cleary-1993-the-flower-ornament-scripture-translation-of-the-avatamsaka.pdf","ISBN":"978-0-87773-940-1","issued":{"date-parts":[["1993"]]},"language":"English","number-of-pages":"1656","publisher":"Shambhala Publications Inc","publisher-place":"Boston","title":"The Flower Ornament Scripture: Translation of the Avatamsaka Sutra: A Translation of the Avatamsaka Sutra","title-short":"The Flower Ornament Scripture","type":"book"},
  {"id":"ConzeE 1975a","abstract":"Some 2000 years ago Buddhism experienced a major reformation through a movement called the Mahayana, or \"Great Vehicle,\" which dominated religious through in much of Asia for many centuries and still exerts considerable influence. The basic Mahayana texts, sermons ascribed to the Buddha and called \"sutras\" in Sanskrit, discussed the \"perfect wisdom.\" The \"Large Sutra on Perfect Wisdom\" took shape between 50 and 2000 A.D. in southern India during one of the most momentous outbursts of religious creativity in human history.","author":[{"family":"Conze","given":"Edward"}],"citation-key":"ConzeE 1975a","event-place":"Berkeley","file":"Conze-1975-the-large-sutra-on-perfect-wisdom.pdf","ISBN":"978-0-520-05321-2","issued":{"date-parts":[["1975"]]},"language":"English","number-of-pages":"700","publisher":"University of California Press","publisher-place":"Berkeley","title":"The Large Sutra on Perfect Wisdom: With the Divisions of the Abhisamayalankara","title-short":"The Large Sutra on Perfect Wisdom","type":"book"},
  {"id":"CousinsL 1983a","author":[{"family":"Cousins","given":"Lance"}],"citation-key":"CousinsL 1983a","collection-number":"4","collection-title":"Collected Papers on South Asia","container-title":"Buddhist studies: Ancient and Modern","editor":[{"family":"Denwood","given":"Philip"},{"family":"Piatigorsky","given":"Alexander"}],"event-place":"London","file":"Cousins-1983-pali-oral-literature.pdf","ISBN":"978-0-389-20264-6 978-0-7007-0153-7","issued":{"date-parts":[["1983"]]},"language":"eng","publisher":"Curzon [u.a.]","publisher-place":"London","title":"Pali Oral Literature","type":"chapter"},
  {"id":"CousinsL 1984a","author":[{"family":"Cousins","given":"Lance"}],"citation-key":"CousinsL 1984a","container-title":"Buddhist Studies: In Honour of Hammalava Saddhātissa","file":"Cousins-1984-samatha-yāna-and-vipassanā-yāna.pdf","issued":{"date-parts":[["1984"]]},"language":"en","page":"56–68","publisher":"Hammalava Saddhātissa Felicitation Volume Committee","title":"Samatha-yāna and vipassanā-yāna","type":"chapter"},
  {"id":"CousinsL 1992a","author":[{"family":"Cousins","given":"Lance"}],"citation-key":"CousinsL 1992a","container-title":"The Buddhist Forum","editor":[{"family":"Skorupski","given":"Tadeusz"}],"event-place":"London","file":"Cousins-1992-the-‘five-points’-and-the-origins-of-the-buddhist-schools.pdf","issued":{"date-parts":[["1992"]]},"page":"27–60","publisher":"SOAS","publisher-place":"London","title":"The ‘Five Points’ and the Origins of the Buddhist Schools","type":"paper-conference","URL":"https://www.shin-ibs.edu/documents/bForum/v2/03Cousins.pdf","volume":"2"},
  {"id":"CrangleEF 1994a","author":[{"family":"Crangle","given":"Edward Fitzpatrick"}],"citation-key":"CrangleEF 1994a","file":"Crangle-1994-the-origin-and-development-of-early-indian-contemplative-pra.pdf","ISBN":"978-3-447-03479-1","issued":{"date-parts":[["1994"]]},"language":"en","number-of-pages":"332","publisher":"Otto Harrassowitz Verlag","source":"Google Books","title":"The Origin and Development of Early Indian Contemplative Practices","type":"book"},
  {"id":"Dayal 1932a","abstract":"The present work consists of seven chapters that deal with the Bodhisattva doctrine as expounded in the principal Buddhist Sanskrit Literature. Chapter 1 describes the nature of the Bodhisattva doctrine with particular stress on the distinct chatacteristics of arhat, Bodhisattva and sravaka. Chapter II recounts the different factors including the influence Persian religio-cult, Greek art and Christian ethics that contributed to the rise and growth of the Boddhisattva doctrine. Chapter III expounds the production of the thought of Enlightenment for the welfare and liberation of all creatures. Chapters IV describes thirty-seven practices and principles conducive to the attainment of Enlightenment. Chapter V expalins the ten perfections that lead to welfare, rebirth, serenity, spiritual cultivation, and supreme knowledge. Chapter VI states different stages of spiritual progress in the aspirant`s long journey to the goal of final emancipation and Chapter VII relates the events of the Gautama Buddha`s past lives as Bodhisattva. The book contains comprehensive notes and references besides a general index appended at the end. It is written in a very lucid style that speaks of the writer`s scholarly acumen and mastry of literary art.","author":[{"family":"Dayal","given":"Har"}],"citation-key":"Dayal 1932a","file":"Dayal-1932-the-bodhisattva-doctrine-in-buddhist-sanskrit-literature.pdf","issued":{"date-parts":[["1932"]]},"language":"en","number-of-pages":"424","title":"The Bodhisattva Doctrine in Buddhist Sanskrit Literature","type":"book"},
  {"id":"deLaValleePoussinL 1988a","abstract":"This is the most important compendium of Indian Buddhist philosophy and psychology. The four volume masterwork begins with a history of Abhidharma literature and covers a vast array of subjects from a Buddhist viewpoint. Some of these subjects are Buddhist cosmology and the process of rebirth, karma and the Buddhist ethical theory, mental defilements, causes of suffering and the path to enlightenment, the supernatural powers of a Buddha, a taxonomy of meditative states and a refutation of the existence of soul.\"... one of the landmark achievements in the history of Buddhist Studies. \nUnder the influence of his teacher, Louis de la Valle Poussin, Prof. Lamotte published several works in French, which were primarily editions, translations and commentaries on Tibetan and Chinese Buddhist texts. The theories and concepts contained in this particular work are closely related to those of the Abhidharmakosa, and as such it makes a valuable companion to that larger work. Here Prof. Pruden has provided a masterful English translation of Prof. Lamotte’s work, and has added a brief biography of Prof. Lamotte and his scholarly accomplishments to familiarize the reader with this great scholar of Buddhism.","citation-key":"deLaValleePoussinL 1988a","contributor":[{"family":"La Vallee Poussin","given":"Louis","non-dropping-particle":"de"}],"file":"de La Vallee Poussin-1988-abhidharmakośabhāṣyam-of-vasubhandhu-1.pdf;de La Vallee Poussin-1988-abhidharmakośabhāṣyam-of-vasubhandhu-2.pdf;de La Vallee Poussin-1988-abhidharmakośabhāṣyam-of-vasubhandhu-3.pdf;de La Vallee Poussin-1988-abhidharmakośabhāṣyam-of-vasubhandhu-4.pdf","ISBN":"978-0-89581-908-6","issued":{"date-parts":[["1988"]]},"language":"en","note":"attachment-label:Vol 1;2;3;4","number-of-pages":"440","number-of-volumes":"4","publisher":"Asian Humanities Press","title":"Abhidharmakośabhāṣyam of Vasubhandhu","translator":[{"family":"Pruden","given":"Leo M"}],"type":"book","volume":"1–4"},
  {"id":"Dict-Monier-Williams","accessed":{"date-parts":[["2024",1,15]]},"author":[{"family":"Monier-Williams","given":"Monier"}],"citation-key":"Dict-Monier-Williams","file":"","title":"Monier-Williams Sanskrit Dictionary 1899 Advanced","type":"webpage","URL":"https://www.sanskrit-lexicon.uni-koeln.de/scans/MWScan/2020/web/webtc2/index.php"},
  {"id":"DietzS 1984a","abstract":"Text: German","citation-key":"DietzS 1984a","editor":[{"family":"Dietz","given":"Siglinde"}],"event-place":"Göttingen","file":"","ISBN":"978-3-525-82425-2","issued":{"date-parts":[["1984"]]},"language":"German","number-of-pages":"104","publisher":"Vandenhoeck & Ruprecht Gmbh & Co","publisher-place":"Göttingen","title":"Fragmente des Dharmaskandha: Ein Abhidharma-Text in Sanskrit aus Gilgit","title-short":"Fragmente des Dharmaskandha","type":"book"},
  {"id":"Dundas 1992a","abstract":"The Indian religion of Jainism, whose central tenet involves non-violence to all creatures, is one of the world's oldest and least-understood faiths. Dundas looks at Jainism in its social and doctrinal context, explaining its history, sects, scriptures and ritual, and describing how the Jains have, over 2500 years, defined themselves as a unique religious community. This revised and expanded edition takes account of new research into Jainism.","author":[{"family":"Dundas","given":"Paul"}],"citation-key":"Dundas 1992a","event-place":"London New York","file":"Dundas-1992-the-jains.pdf","ISBN":"978-0-415-26606-2","issued":{"date-parts":[["1992"]]},"language":"English","number-of-pages":"368","publisher":"Routledge","publisher-place":"London New York","title":"The Jains","type":"book"},
  {"id":"DuttN 1978a","author":[{"family":"Dutt","given":"Nalinaksha"}],"citation-key":"DuttN 1978a","file":"Dutt-1978-buddhist-sects-in-india.pdf","issued":{"date-parts":[["1978"]]},"language":"English","number-of-pages":"297","publisher":"Motilal Banarsidass","title":"Buddhist Sects in India","type":"book"},
  {"id":"EnomotoF 1986a","abstract":".","accessed":{"date-parts":[["2025",12,23]]},"author":[{"family":"Enomoto","given":"Fumio"}],"citation-key":"EnomotoF 1986a","container-title":"Buddhist Studies Review","container-title-short":"BSRV","DOI":"10.1558/bsrv.v3i1.16141","file":"Enomoto-1986-on-the-formation-of-the-original-texts-of-the-chinese-agamas 1.pdf","ISSN":"1747-9681, 0265-2897","issue":"1","issued":{"date-parts":[["1986",3,14]]},"page":"19–30","title":"On the Formation of the Original Texts of the Chinese Agamas","type":"article-journal","URL":"https://journal.equinoxpub.com/BSR/article/view/16141","volume":"3"},
  {"id":"EnomotoF 2000a","author":[{"family":"Enomoto","given":"Fumio"}],"citation-key":"EnomotoF 2000a","collection-number":"37","collection-title":"Indica et Tibetica","container-title":"Vividharatnakaraṇḍaka: Festgabe für Adelheid Mette","editor":[{"family":"Chojnacki","given":"Christine"},{"family":"Hartmann","given":"Jens-Uwe"},{"family":"Tschannerl","given":"Volker M."}],"event-place":"Swisttal-Odendorf","file":"","ISBN":"978-3-923776-37-5","issued":{"date-parts":[["2000"]]},"language":"ger eng fre san","page":"239–248","publisher":"Indica et Tibetica Verl","publisher-place":"Swisttal-Odendorf","title":"“Mūlasarvāstivādin” and “Sarvāstivādin”","type":"chapter","URL":"https://www.iet-verlag.de/ser_iet40.html#i37"},
  {"id":"Frauwallner 1995a","author":[{"family":"Frauwallner","given":"Erich"}],"citation-key":"Frauwallner 1995a","collection-title":"SUNY series in Indian thought","event-place":"Albany (N.Y)","file":"Frauwallner_1995_Studies in Abhidharma Literature and the Origins of Buddhist Philosophical.pdf","ISBN":"978-0-7914-2699-9","issued":{"date-parts":[["1995"]]},"language":"eng","publisher":"State university of New York press","publisher-place":"Albany (N.Y)","title":"Studies in Abhidharma Literature and the Origins of Buddhist Philosophical Systems","translator":[{"family":"Kidd","given":"Sophie Francis"},{"family":"Steinkellner","given":"Ernst"}],"type":"book","URL":"https://sunypress.edu/Books/S/Studies-in-Abhidharma-Literature-and-the-Origins-of-Buddhist-Philosophical-Systems"},
  {"id":"FrauwallnerE 1956a","abstract":"Vinaya literature constitutes the original nucleus of Buddhist literature. It comprises brief reports, some of which have allowed to reconstruct the life of the historical Buddha. Erich Frauwallner, a pioneer in the field of Buddhist studies, restores back the whole disruptive force of a work of extraordinary importance. A fundamental work for those who wish to draw from the fount of this very ancient discipline.","author":[{"family":"Frauwallner","given":"Erich"}],"citation-key":"FrauwallnerE 1956a","collection-title":"Serie Orientale Roma","file":"Frauwallner-1956-the-earliest-vinaya-and-the-beginnings-of-buddhist-literatur.pdf","ISBN":"978-88-575-2679-9","issued":{"date-parts":[["1956"]]},"language":"English","number-of-pages":"218","publisher":"Mimesis International","source":"Amazon","title":"The Earliest Vinaya and the Beginnings of Buddhist Literature","type":"book","volume":"8"},
  {"id":"GethinRML 1992a","abstract":"This comprehensive study draws exhaustively on a wide range of sources both primary and secondary, and in particular the Pali texts, to offer an authoritative study of the \"thirty-seven conditions that contribute to awakening\". This classic set of Buddhist teachings is examined both collectively and individually, thus revealing how early Buddhist thinkers understood the process of spiritual practice by which ordinary consciousness is transformed in the mystic mind. Sensitive, conscientious, and featuring full notes and extensive bibliography, this text will be appreciated by scholars and students alike.","author":[{"family":"Gethin","given":"R. M. L."}],"citation-key":"GethinRML 1992a","event-place":"Oxford","file":"Gethin-1992-the-buddhist-path-to-awakening.pdf","ISBN":"978-1-85168-285-0","issued":{"date-parts":[["1992"]]},"language":"English","number-of-pages":"374","publisher":"Oneworld Publications","publisher-place":"Oxford","title":"The Buddhist Path to Awakening","type":"book"},
  {"id":"GethinRML 1992b","author":[{"family":"Gethin","given":"Rupert"}],"citation-key":"GethinRML 1992b","container-title":"In the Mirror of Memory: Reflections on Mindfulness and Remembrance in Indian and Tibetan Buddhism","editor":[{"family":"Gyatso","given":"Janet"}],"event-place":"Albany","file":"Gethin-1992-the-mātikās-memorization-mindfulness-and-the-list.pdf","issued":{"date-parts":[["1992"]]},"page":"149–172","publisher":"SUNY Press","publisher-place":"Albany","title":"The Mātikās: Memorization, Mindfulness and the List","type":"paper-conference","URL":"https://www.academia.edu/24132029/The_M%C4%81tik%C4%81s_Memorization_Mindfulness_and_the_List"},
  {"id":"GnanaramaP 1997a","author":[{"family":"Gnanarama","given":"Pategama"}],"citation-key":"GnanaramaP 1997a","event-place":"Singapore","file":"Gnanarama-1997-the-mission-accomplished-a-historical-analysis-of-the-mahap.pdf","ISBN":"978-981-00-9087-6","issued":{"date-parts":[["1997"]]},"language":"eng","publisher":"Ti Sarana Buddhist Association","publisher-place":"Singapore","title":"The Mission Accomplished: A Historical Analysis of the Mahaparinibbana Sutta of the Digha Nikaya of the Pali Canon","title-short":"The mission accomplished","type":"book"},
  {"id":"GnoliR 1977a","author":[{"family":"Gnoli","given":"Raniero"}],"citation-key":"GnoliR 1977a","collection-number":"XLIX","collection-title":"Serie Orientale Roma","event-place":"Roma","file":"Gnoli-1977-the-gilgit-manuscript-of-the-saṅghabhedavastu-1.pdf","issued":{"date-parts":[["1977"]]},"language":"english","number-of-volumes":"2","publisher":"Istituto italiano per il medio ed estremo oriente","publisher-place":"Roma","title":"The Gilgit Manuscript of the Saṅghabhedavastu: being the 17th and last section of the Vinaya of the Mūlasarvāstivādin","type":"book","volume":"1"},
  {"id":"GnoliR 1978a","author":[{"family":"Gnoli","given":"Raniero"}],"citation-key":"GnoliR 1978a","collection-number":"XLIX","collection-title":"Serie Orientale Roma","event-place":"Roma","file":"Gnoli-1978-the-gilgit-manuscript-of-the-saṅghabhedavastu.pdf","issued":{"date-parts":[["1978"]]},"language":"english","number-of-volumes":"2","publisher":"Istituto italiano per il medio ed estremo oriente","publisher-place":"Roma","title":"The Gilgit Manuscript of the Saṅghabhedavastu: being the 17th and last section of the Vinaya of the Mūlasarvāstivādin","type":"book","volume":"2"},
  {"id":"Gombrich 1996a","abstract":"Written by one of the world's top scholars in the field of Pali Buddhism, this new and updated edition of How Buddhism Began, discusses various important doctrines and themes in early Buddhism. It takes 'early Buddhism' to be that reflected in the Pali canon, and to some extent assumes that these doctrines reflect the teachings of the Buddha himself. Two themes predominate. Firstly, the author argues that we cannot understand the Buddha unless we understand that he was debating with other religious teachers, notably Brahmins. The other main theme concerns metaphor, allegory and literalism. This accessible, well-written book is mandatory reading for all serious students of Buddhism.","accessed":{"date-parts":[["2024",1,9]]},"author":[{"family":"Gombrich","given":"Richard"}],"citation-key":"Gombrich 1996a","file":"Gombrich_1996_How Buddhism Began.pdf","ISBN":"0-415-37123-6","issued":{"date-parts":[["1996"]]},"language":"en","publisher":"Routledge","title":"How Buddhism Began: The Conditioned Genesis of the Early Teachings","type":"book","URL":"https://www.routledge.com/How-Buddhism-Began-The-Conditioned-Genesis-of-the-Early-Teachings/Gombrich/p/book/9780415514163"},
  {"id":"HarrisonP 1990a","citation-key":"HarrisonP 1990a","collection-number":"5","collection-title":"Studia philologica Buddhica Monograph series","editor":[{"family":"Harrison","given":"Paul"}],"event-place":"Tokyo","file":"","ISBN":"978-4-906267-21-7","issued":{"date-parts":[["1990"]]},"language":"eng","number-of-pages":"345","publisher":"The Internat. Inst. for Buddhist Studies","publisher-place":"Tokyo","title":"The Samadhi of Direct Encounter with the Buddhas of the Present: An Annotated English Translation of the Tibetan Version of the Pratyutpanna-Buddha-Sammukhavasthita-Samadhi-Sutra (T № 416)","type":"book","URL":"https://www.icabs.ac.jp/wp/iibs_html/publications.html"},
  {"id":"HeirmanA 2002","author":[{"family":"Heirman","given":"Ann"}],"citation-key":"HeirmanA 2002","collection-number":"47-49","collection-title":"Buddhist tradition series","event-place":"Delhi","file":"","ISBN":"978-81-208-1800-2 978-81-208-1822-4 978-81-208-1823-1 978-81-208-1824-8","issued":{"date-parts":[["2002"]]},"language":"eng chi san","publisher":"Motilal Banarsidass","publisher-place":"Delhi","title":"\"The discipline in four parts\": Rules for nuns according to the Dharmaguptakavinaya","type":"book"},
  {"id":"Hinüber 1996a","author":[{"family":"Hinüber","given":"Oskar","dropping-particle":"von"}],"citation-key":"Hinüber 1996a","collection-number":"2","collection-title":"Indian Philology and South Asian Studies","event-place":"Berlin ; New York","file":"Hinüber_1996_A Handbook of Pāli literature.pdf","ISBN":"978-3-11-014992-0","issued":{"date-parts":[["1996"]]},"number-of-pages":"257","publisher":"Walter de Gruyter","publisher-place":"Berlin ; New York","title":"A Handbook of Pāli literature","type":"book","URL":"https://doi.org/10.1515/9783110814989"},
  {"id":"HopkinsJ 1983a","abstract":"In this major work, Jeffrey Hopkins, on e of the world's foremost scholar-practitioners of Tibetan Buddhism, offers a clear exposition of the Prasangika-Madhyamaka view of emptiness as presented in the Ge-luk-ba tradition of Tibetan Buddhism. In bringing this remarkable and complex philosophy to life, he describes the meditational practices by which emptiness can be realized and shows throughout that, far from being merely abstract, these teachings can be vivid and utterly practical. Presented in six parts, this book is indispensable for those wishing to delve deeply into Buddhist thought.","author":[{"family":"Hopkins","given":"Jeffrey"}],"citation-key":"HopkinsJ 1983a","event-place":"Boston","file":"","ISBN":"978-0-86171-110-9","issued":{"date-parts":[["1983"]]},"language":"English","number-of-pages":"992","publisher":"Wisdom Publications,U.S.","publisher-place":"Boston","title":"Meditation on Emptiness","type":"book","URL":"https://wisdomexperience.org/product/meditation-emptiness/"},
  {"id":"HurvitzL 1978a","author":[{"family":"Hurvitz","given":"Leon"}],"citation-key":"HurvitzL 1978a","container-title":"Mahāyāna buddhist meditation: Theory and practice","DOI":"10.1515/9780824885984-011","editor":[{"family":"Kiyota","given":"Minoru"}],"event-place":"Honolulu","file":"Hurvitz-1978-fa-shengs-observations-on-the-four-stations-of-mindfulness.pdf","issued":{"date-parts":[["1978"]]},"page":"207–248","publisher":"University of Hawai'i Press","publisher-place":"Honolulu","title":"Fa-sheng's Observations on the Four Stations of Mindfulness","type":"paper-conference"},
  {"id":"JayatillekeKN 1963a","abstract":"The author of this volume, an accomplished philologist, historian and philosopher, analyzes the relevant earlier and later texts and traces the epistemological foundations of Pali canonical thought from the Vedic period onwards. Originally published in 1963, it sheds new light on later developments and elucidates from the Indian point of view some of the basic problems of the conflict between metaphysics and logical and linguistic analysis.","accessed":{"date-parts":[["2024",1,9]]},"author":[{"family":"Jayatilleke","given":"Kulatissa Nanda"}],"citation-key":"JayatillekeKN 1963a","file":"Jayatilleke_1963_Early Buddhist Theory of Knowledge.pdf","issued":{"date-parts":[["1963"]]},"language":"en","title":"Early Buddhist Theory of Knowledge","type":"book","URL":"https://www.routledge.com/Early-Buddhist-Theory-of-Knowledge/Arasteh/p/book/9780415461078"},
  {"id":"JianhuaC a","abstract":"Early Buddhist texts and modern translations. Suttas (sutras) from the Tipitaka (Tripitaka) in Pali, Chinese, Sanskrit, and Tibetan with the Buddha's teachings on mindfulness, insight, wisdom, and meditation.","accessed":{"date-parts":[["2026",1,2]]},"author":[{"family":"Jianhua","given":"Cheng"}],"citation-key":"JianhuaC a","container-title":"SuttaCentral","file":"","language":"en","title":"A Critical Translation of Fan Dong Jing, the Chinese Version of Brahmajala Sutra","type":"webpage","URL":"https://suttacentral.net/da21/en/cheng"},
  {"id":"JonesJJ 1949a","abstract":"Translation from the Buddhist Sanskrit of a text of the Lokottaravada-Mahasamghika school; contains many parallels to canonical Pali materials","citation-key":"JonesJJ 1949a","contributor":[{"family":"Jones","given":"John James"}],"event-place":"London","file":"JonesJJ-1949-mahāvastu-volume1.pdf","issued":{"date-parts":[["1949"]]},"language":"English","number-of-pages":"324","number-of-volumes":"3","publisher":"Luzac & Co","publisher-place":"London","title":"Mahāvastu I, Translated from the Buddhist Sanskrit","type":"book","volume":"1"},
  {"id":"JonesJJ 1952a","abstract":"Translation from the Buddhist Sanskrit of a text of the Lokottaravada-Mahasamghika school; contains many parallels to canonical Pali materials","citation-key":"JonesJJ 1952a","contributor":[{"family":"Jones","given":"John James"}],"event-place":"London","file":"JonesJJ-1952-mahāvastu-volume-2.pdf","issued":{"date-parts":[["1952"]]},"language":"English","number-of-pages":"454","number-of-volumes":"3","publisher":"Luzac & Co","publisher-place":"London","title":"Mahāvastu II, Translated from the Buddhist Sanskrit","type":"book","volume":"2"},
  {"id":"JonesJJ 1956a","abstract":"Translation from the Buddhist Sanskrit of a text of the Lokottaravada-Mahasamghika school; contains many parallels to canonical Pali materials","citation-key":"JonesJJ 1956a","contributor":[{"family":"Jones","given":"John James"}],"event-place":"London","file":"JonesJJ-1956-mahāvastu-volume-3.pdf","issued":{"date-parts":[["1956"]]},"language":"English","number-of-pages":"480","number-of-volumes":"3","publisher":"Luzac & Co","publisher-place":"London","title":"Mahāvastu III, Translated from the Buddhist Sanskrit","type":"book","volume":"3"},
  {"id":"KajiyamaY 1978a","accessed":{"date-parts":[["2026",1,2]]},"author":[{"family":"Kajiyama","given":"Yuichi"}],"citation-key":"KajiyamaY 1978a","container-title":"Mahayana Buddhist Meditation: Theory and Practice","file":"Kajiyama-1978-later-madhyamikas-on-epistemology-and-meditation.pdf","issued":{"date-parts":[["1978"]]},"language":"en","title":"Later Madhyamikas on Epistemology and Meditation","type":"article-journal"},
  {"id":"KeenanJP 2000a","abstract":"The basic sutra of the Fa-hsian School, The Scripture on the Explication of Underlying Meaning expounds the thought of the Yogacara, or Mind-Only School (Vijnanavada), stating that all phenomena are manifestations of the mind. It belongs to the middle period of Indian Mahayana Buddhism and is considered to have been composed at the start of the fourth century A.D.","citation-key":"KeenanJP 2000a","collection-number":"25","collection-title":"BDK english tripiṭaka series","contributor":[{"family":"Keenan","given":"John P."}],"event-place":"Berkeley, Calif","file":"Keenan-2000-the-scripture-on-the-explication-of-underlying-meaning.pdf","ISBN":"978-1-886439-10-8","issued":{"date-parts":[["2000"]]},"language":"English","number-of-pages":"126","publisher":"Hawaii Distributed Titles","publisher-place":"Berkeley, Calif","title":"The Scripture on the Explication of Underlying Meaning: Translated from the Chinese of Hsiian-tsang (Taisho Volume 16, Number 676)","type":"book","volume":"IV"},
  {"id":"KiyotaM-JonesEW 1978a","abstract":"It represents some of the best of contemporary scholarship in Mahayana buddhist studies and deal with the theory and practice of Mahayana meditation.","author":[{"family":"Kiyota","given":"Minoru"},{"family":"Jones","given":"Elvin W."}],"citation-key":"KiyotaM-JonesEW 1978a","file":"Kiyota and Jones-1978-mahayana-buddhist-meditation-theory-and-practice.pdf","ISBN":"978-81-208-0760-0","issued":{"date-parts":[["1978"]]},"language":"English","number-of-pages":"328","publisher":"Motilal Banarsidass","title":"Mahayana Buddhist Meditation: Theory and Practice","type":"book"},
  {"id":"KloppenborgR 1973a","citation-key":"KloppenborgR 1973a","collection-number":"1","collection-title":"Nisaba","contributor":[{"family":"Kloppenborg","given":"Ria"}],"event-place":"Leiden","file":"","ISBN":"978-90-04-03611-6","issued":{"date-parts":[["1973"]]},"language":"eng","number-of-pages":"123","publisher":"Brill","publisher-place":"Leiden","title":"The Sūtra on the Foundation of the Buddhist OOrder (Catuṣpariṣatsūtra): relating the events from the Bodhisattva's enlightenment up to the conversion of Upatiṣya (Śāriputra) and Kolita (Maudgalyāyana)","title-short":"The Sūtra on the foundation of the Buddhist order (Catuṣpariṣatsūtra)","type":"book"},
  {"id":"Lamotte 1983a","abstract":".","accessed":{"date-parts":[["2026",1,6]]},"author":[{"family":"Lamotte","given":"Étienne"}],"citation-key":"Lamotte 1983a","container-title":"Buddhist Studies Review","container-title-short":"BSRV","DOI":"10.1558/bsrv.v1i1.16227","file":"Lamotte-1983-assessment-of-textual-authenticity-in-buddhism.pdf","ISSN":"1747-9681, 0265-2897","issue":"1","issued":{"date-parts":[["1983",5,19]]},"page":"4–15","title":"Assessment of Textual Authenticity in Buddhism","type":"article-journal","URL":"https://journal.equinoxpub.com/BSR/article/view/16227","volume":"1"},
  {"id":"Lamotte-Webb 1988a","abstract":"The History of Indian Buddhism is undoubtedly Msgr. E. Lamotte's most brilliant contribution to the field of Buddhist exegesis. The work contains a vivid, vigorous and fully-detailed description of early Buddhism and its teachings, the material organization of the Community, the formation and further developments of the writings, the conciliar traditions, the evolution of Buddhist sculpture and architecture, the origins of the sects, the Buddhist dialects and the constitution of the legends, and sets them in the historical background in which buddhist doctrines originated and expanded in India and in the neighbouring countries. Using the material evidence provided by Indian epigraphy and archaeological remains on the one hand, and taking into account the data supplied by Western (Latin and Greek) and Far Eastern (Tibetan and Chinese) sources on the other, Msgr. E. Lamotte has succeeded in producing a lucid and basic book that is unanimously considered as a classic of contemporary Buddhist studies. After thirty years, the work has retained all its value, but, in order to meet the requirements of recent Buddhist scholarship, the History of Indian Buddhism has been supplemented with an additional bibliography, an index of technical terms and revised geographical maps.","author":[{"family":"Lamotte","given":"Etienne"},{"family":"Dantinne","given":"Jean"}],"citation-key":"Lamotte-Webb 1988a","event-place":"Louvain-la-Neuve","file":"Lamotte and Dantinne-1988-history-of-indian-buddhism-from-the-origins-to-the-saka-era.pdf","ISBN":"978-90-6831-100-6","issued":{"date-parts":[["1988"]]},"language":"English","number-of-pages":"870","publisher":"Peeters Pub & Booksellers","publisher-place":"Louvain-la-Neuve","title":"History of Indian Buddhism: From the Origins to the Saka Era","title-short":"History of Indian Buddhism","translator":[{"family":"Webb-Boin","given":"Sara"}],"type":"book"},
  {"id":"LinL 1949a","author":[{"family":"Lin","given":"Li-kuang"},{"family":"Demiéville","given":"Paul"}],"citation-key":"LinL 1949a","event-place":"Paris","file":"","issued":{"date-parts":[["1949"]]},"language":"fr","number-of-pages":"424","publisher":"Adrien-Maisonneuve","publisher-place":"Paris","title":"L'aide-mémoire de la Vraie Loi (Saddharma-smrtyupasthāna-sūtra): recherches sur un sūtra développé du petit véhicule","title-short":"L'aide-mémoire de la Vraie Loi (Saddharma-smrtyupasthāna-sūtra)","type":"book"},
  {"id":"LiR 1993a","citation-key":"LiR 1993a","collection-number":"76,2","collection-title":"BDK English Tripiṭaka","contributor":[{"family":"Li","given":"Rongxi"},{"family":"Saṅghavarman","given":""}],"event-place":"Berkeley, Calif","file":"","ISBN":"978-0-9625618-4-9","issued":{"date-parts":[["1993"]]},"language":"eng","number-of-pages":"203","publisher":"Numata Center for Buddhist Translation and Research","publisher-place":"Berkeley, Calif","title":"The Biographical Scripture of King Aśoka (A-yu-wang-jing, or Aśokarājasūtra, T № 2043)","type":"book"},
  {"id":"MasefieldP 1983a","author":[{"family":"Masefield","given":"Peter"}],"citation-key":"MasefieldP 1983a","container-title":"Buddhist and Western Psychology","editor":[{"family":"Katz","given":"Nathan"}],"event-place":"Boulder","file":"Masefield-1983-mindcosmos-maps-in-the-pali-nikāyas.pdf","ISBN":"978-0-87773-758-2","issued":{"date-parts":[["1983"]]},"language":"English","publisher":"Shambhala Publications Inc","publisher-place":"Boulder","title":"Mind/Cosmos Maps in the Pali Nikāyas","type":"chapter"},
  {"id":"MatsumuraH 1980a","abstract":"The present work is a study of the avadanas preserved in the Gilgit Manuscripts which are supposed to be of the 5th-6th century A.D. In chapter I of the introduction I have classified these Gilgit avadanas as belonging to the earliest stage in the history of Avadana literature, when an attempt was made, to compile an avadana collection by selecting materials from Vinaya literature. In the following chapters a brief account of four avadanas and their manuscripts is given. The edition of these four avadanas with annotations is the main part of this work. There I have attempted to establish a text of the Gilgit recension. All remarkable words or phrases are discussed in the footnotes to the Sanskrit texts, because without any comprehensive understanding of the relevant word we cannot establish even one syllable of that word. At the same time I have noted the results of comparisons with the other Sanskrit recensions, and the Tibetan and Chinese translations, which indicate well the closeness of the Gilgit text to the Tibetan translation. The editions of the parallal Tibetan texts which must be consulted in order to establish the Sanskrit texts are given in the following section. Appendices I-IV contain notes which are too long to put into the footnotes to the Sanskrit text. The last part is an Index, arranged in Sanskrit alphabetical order, of the terms which are discussed in the footnotes to the Sanskrit texts.","accessed":{"date-parts":[["2026",1,9]]},"author":[{"family":"Matsumura","given":"Hisashi"}],"citation-key":"MatsumuraH 1980a","contributor":[{"family":"University","given":"The Australian National"}],"file":"Matsumura-1980-four-avadanas-from-the-gilgit-manuscripts.pdf","issued":{"date-parts":[["1980"]]},"language":"en","publisher":"The Australian National University","title":"Four avadanas from the Gilgit manuscripts","type":"thesis","URL":"https://openresearch-repository.anu.edu.au/handle/1885/11002"},
  {"id":"MeisigK 1987a","author":[{"family":"Meisig","given":"Konrad"}],"citation-key":"MeisigK 1987a","file":"","ISBN":"978-3-447-02711-3","issued":{"date-parts":[["1987"]]},"language":"de","number-of-pages":"646","publisher":"O. Harrassowitz","source":"Google Books","title":"Das Śrāmaṇyaphala-sūtra: synoptische Übersetzung und Glossar der chinesischen Fassungen verglichen mit dem Sanskrit und Pāli","title-short":"Das Śrāmaṇyaphala-sūtra","type":"book"},
  {"id":"MinhChau 1991a","abstract":"In A Comparative Study of the Chinese Madhyama Agama and the Pali Majjhima Nikaya efforts are made to introduce one important section of Sarv Canon, the Madhyama Agama almost in its entirety. The Agama is dealt with very extensively, starting with the composition of the whole work in its division into vargas, fasciculi, days of recital of Sutras. It also explains some difference in practices actually followed by the people of some Buddhist countries in modern times.","author":[{"family":"Minh Chau","given":"Bhiksu Thích"}],"citation-key":"MinhChau 1991a","event-place":"Delhi","file":"","ISBN":"978-81-208-0794-5","issued":{"date-parts":[["1991"]]},"language":"English","number-of-pages":"388","publisher":"Motilal Banarsidass,","publisher-place":"Delhi","title":"The Chinese \"Madhyama Agama\" and the Pali \"Majjhima Nikaya\": A Comparative Study","title-short":"The Chinese \"Madhyama Agama\" and the Pali \"Majjhima Nikaya\"","type":"book"},
  {"id":"NakamuraH 1996a","abstract":"Reading books is a kind of enjoyment. Reading books is a good habit. We bring you a different kinds of books. You can carry this book where ever you want. It is easy to carry. It can be an ideal gift to yourself and to your loved ones. Care instruction keep away from fire.","author":[{"family":"Nakamura","given":"Hajime"}],"citation-key":"NakamuraH 1996a","event-place":"Delhi","file":"","ISBN":"978-81-208-0272-8","issued":{"date-parts":[["1996"]]},"language":"English","number-of-pages":"435","publisher":"Motilal Banarsidass Publications","publisher-place":"Delhi","title":"Indian Buddhism: A Survey With Bibliographical Notes","title-short":"Indian Buddhism","type":"book"},
  {"id":"Ñāṇamoli  1964a","author":[{"family":"Ñāṇamoli","given":""}],"citation-key":"Ñāṇamoli  1964a","collection-number":"35","collection-title":"Translation Series","event-place":"Oxford","file":"Ñāṇamoli-1964-the-piṭaka-disclosure.pdf","ISBN":"978-0-86013-026-0","issued":{"date-parts":[["1964"]]},"language":"eng","number-of-pages":"402","publisher":"Pali Text Society","publisher-place":"Oxford","title":"The Piṭaka-Disclosure (Peṭakopadesa): According to Kaccāna Thera","title-short":"The Piṭaka-Disclosure (Peṭakopadesa)","type":"book"},
  {"id":"Ñāṇamoli 1956a","abstract":"The Visuddhimagga is the \"great treatise\" of Theravada Buddhism, an encyclopedic manual of doctrine and meditation written in the fifth century by the great Buddhist commentator, Buddhaghosa.The most esteemed commentary in all of Pali literature, The Path of Purification, or Visuddhimagga, is a systematic examination and condensation of Buddhist doctrine and meditation technique. The various teachings of the Buddha, found throughout the Pali Canon, are organized in a clear, comprehensive manner. In the course of his treatise Buddhaghosa gives full and detailed instructions on the forty subjects of meditation aimed at concentration, an elaborate account of the Buddhist Abhidhamma philosophy, and explicit descriptions of the stages of insight culminating in final liberation.The author, Bhadantacaryia Buddhaghosa, composed the Visuddhimagga in the early part of the 5th century A.D. The India-born monk-scholar traveled to Sri Lanka to translate into Pali the extensive Sinhalese commentaries preserved there. His crystallization of the entire Pali Canon reinvigorated Theravada Buddhism in India and Sri Lanka. It still shines as clearly today, in this brilliant 1956 translation by the British-born monk, Bhikkhu Ñāṇamoli, that in itself is considered an outstanding achievement of Pali scholarship of the 20th century.This book is from BPS Pariyatti Editions, which co-publishes classic and contemporary titles from the Buddhist Publication Society of Kandy, Sri Lanka.","citation-key":"Ñāṇamoli 1956a","collection-number":"207H","collection-title":"Book Publications","contributor":[{"family":"Ñāṇamoli","given":"Bhikkhu"}],"file":"Ñanamoli-1956-the-path-of-purification.pdf","issued":{"date-parts":[["1956"]]},"language":"English","publisher":"Buddhist Publication Society","title":"The Path of Purification (Visuddhimagga) by Bhadantācariya Buddhaghosa","type":"book","URL":"https://www.bps.lk/library-search-select.php?id=bp207h"},
  {"id":"Ñāṇamoli 1992","abstract":"Composed entirely of texts from the Pali canon, this unique biography presents the oldest authentic record of the Buddha’s life and revolutionary philosophy. The ancient texts are rendered here in a language marked by lucidity and dignity. A framework of narrators and voices connect the canonical texts. Vivid recollections of his personal attendant Ananda and other disciples bring the reader into the Buddha’s presence, where his example offers profound inspiration and guidance on the path to freedom.","author":[{"family":"Ñāṇamoli","given":"Bhikkhu"}],"citation-key":"Ñāṇamoli 1992","event-place":"Seattle","file":"Ñāṇamoli-1992-the-life-of-the-buddha-according-to-the-pali-canon.pdf","ISBN":"978-1-928706-12-0","issued":{"date-parts":[["1992"]]},"language":"English","number-of-pages":"400","publisher":"Pariyatti Publishing","publisher-place":"Seattle","title":"The Life of the Buddha: According to the Pali Canon","title-short":"The Life of the Buddha","type":"book"},
  {"id":"NhấtHạnh 2006a","abstract":"The teachings contained in this The Sutra on the Four Establishments of Mindfulness are fundamental to the practice of meditation, and constitute the foundation of all mindfulness practice.The Sutra has been studied, practiced and handed down with special care from generation to generation for 2,500 years. In his commentaries Thich Nhat Hanh guides the reader to an understanding of the fundamental basis of the Buddhist practice and encourages application in daily life.It describes the four methods of mindfulness: mindfulness of the body, the feelings, the mind, and the object of mind. It teaches how to deal with anger and jealousy, to nurture the best qualities in our children, spouse, and friends, and to greet death with compassion and equanimity.Three versions of the Sutra on the Four Establishments of Mindfulness are presented here, along with Thich Nhat Hanh''s insightful commentary and twenty-three exercises-or contemplations-to aid in the practice of mindfulness in daily life.Thich Nhat Hanh''s presentation of the sutra is easy to follow making it accessible for novice Buddhist as well as more advanced practitioners. It gives you the basics of breathing and how to use your breathing for meditation and contemplation.With a new introduction by Thich Nhat Hanh.","author":[{"family":"Nhất Hạnh","given":"Thich"}],"citation-key":"NhấtHạnh 2006a","event-place":"Berkeley, Calif","file":"Nhất Hạnh-2006-transformation-and-healing-sutra-on-the-four-establishments.pdf","ISBN":"978-1-888375-62-6","issued":{"date-parts":[["2006"]]},"language":"English","number-of-pages":"152","publisher":"Parallax Press","publisher-place":"Berkeley, Calif","title":"Transformation and Healing: Sutra on the Four Establishments of Mindfulness","title-short":"Transformation and Healing","type":"book"},
  {"id":"NormanKR 1979a","author":[{"family":"Norman","given":"K. R."}],"citation-key":"NormanKR 1979a","container-title":"Studies in Pali and Buddhism: A Memorial Volume in Honour of Bhikku Jagdish Kashyap","editor":[{"family":"Narain","given":"A. K."}],"event-place":"Delhi","file":"Norman-1979-magadhisms-in-the-kathāvatthu.pdf","ISBN":"978-93-80852-69-0","issued":{"date-parts":[["1979"]]},"language":"English","publisher":"B. R. Publishing Corporation","publisher-place":"Delhi","title":"Magadhisms in the Kathāvatthu","type":"chapter"},
  {"id":"Nyanaponika 1973a","abstract":"This is a classic text on the essence of Buddhist meditation. It is an excellent, indepth description of mindfulness practice and its benefits. It includes a concise explanation of clear comprehension, which is the kind of mindfulness you use in the course of your daily life. It also presents an easily understandable explanation of the Four Foundations of Mindfulness. This new edition includes an introduction from noted author and teacher Sylvia Boorstein. Although the Buddha lived over 2500 years ago, his teachings on meditation are among the most effective methods for healing the pain of grief, finding inner peace, and overcoming the sense of dislocation caused by living in the 21st century. Mindfulness is a method not only for committed Buddhists. It is for everyone interested in mastering the mind. From the introduction by Sylvia BoorsteinThe Heart of Buddhist Meditation was the first serious, didactic Dharma book I read. It was the early nineteeneighties. My teacher, Jack Kornfield, suggested it as the beginning formal training of my becoming a Mindfulness teacher. I have that original copy and I am touched by how many underlined passages, how many exclamation points in margins, how many addendums of my own written in tiny scrawl appear in its fading pages.","author":[{"family":"Nyanaponika","given":"Thera"}],"citation-key":"Nyanaponika 1973a","event-place":"Sri Lanka","file":"Nyanaponika-1973-the-heart-of-buddhist-meditation.pdf","issued":{"date-parts":[["1973"]]},"language":"English","number-of-pages":"225","publisher":"Buddhist Publication Society","publisher-place":"Sri Lanka","title":"The Heart of Buddhist Meditation: The Buddha's Way of Mindfulness","title-short":"The Heart of Buddhist Meditation","type":"book"},
  {"id":"PeMaungTin1920a","abstract":"Translation of Atthasālinī  Commentary on the Dhammasaṅgaṇī by Buddhaghosa. (5th century C.E.)  Tr. Pe Maung Tin  2 volumes, 1920, 1921, reprinted as one volume 1976","accessed":{"date-parts":[["2025",9,26]]},"author":[{"literal":"Pe Maung Tin"}],"citation-key":"PeMaungTin1920a","file":"Pe-Maung-Tin-1920-the-expositor-(atthasālīnī)-1.pdf;Pe Maung Tin-1920-the-expositor-(atthasālīnī)-2.pdf","issued":{"season":1,"date-parts":[[1920]]},"note":"attachment-label:Vol1;Vol2","title":"The Expositor (Atthasālīnī): Buddhagosa’s Commentary on the Dhammasaṅgaṇī; The First Book of the Abhidhamma Piṭaka","type":"book","URL":"https://palitextsociety.org/product/the-expositor/"},
  {"id":"PrasadS 1932a","author":[{"family":"Prasad","given":"Sital"}],"citation-key":"PrasadS 1932a","event-place":"Madras","file":"Prasad-1932-a-comparative-study-of-jainism-and-buddhism.pdf","issued":{"date-parts":[["1932"]]},"language":"en","number-of-pages":"362","publisher":"Sri Satguru Publications","publisher-place":"Madras","title":"A Comparative Study of Jainism and Buddhism","type":"book"},
  {"id":"PrzyluskiJ 1926a","author":[{"family":"Przyluski","given":"Jean"}],"citation-key":"PrzyluskiJ 1926a","collection-title":"Buddhica","event-place":"Paris","file":"Przyluski-1926-le-concile-de-rajagrha.pdf","issued":{"date-parts":[["1926"]]},"language":"fre","number-of-pages":"434","publisher":"Librairie Orientaliste Paul Geuthner","publisher-place":"Paris","title":"Le Concile de Rajagrha: Introduction à l'histoire des Canons et des Sectes Bouddhiques","title-short":"Le Concile de Rajagrha","type":"book"},
  {"id":"RahulaT 1978","author":[{"family":"Rahula","given":"Bhikkhu Telwatte"}],"citation-key":"RahulaT 1978","file":"","issued":{"date-parts":[["1978"]]},"language":"English","number-of-pages":"435","publisher":"Motilal Banarsidass,","title":"A Critical Study Of The Mahavastu.","type":"book"},
  {"id":"Rhys Davids TW 1921a","abstract":"T.W. Rhys Davids and William Stede, 1921-25, reprinted 1992,1995, repr. with corrections 2015  See also University of Chicago site.","accessed":{"date-parts":[["2023",3,15]]},"author":[{"family":"Rhys Davids","given":"T.W."},{"family":"Stede","given":"William"}],"citation-key":"Rhys Davids TW 1921a","file":"Rhys Davids_Stede_1921_Pāli-English Dictionary.pdf","issued":{"date-parts":[["1921"]]},"publisher":"Pali Text Society","title":"Pāli-English Dictionary","type":"book","URL":"https://palitextsociety.org/product/pali-english-dictionary/"},
  {"id":"RockhillW 1884a","abstract":"This title describes about the history of the world from the time of its renovation up until the reign of Suddhodana, the Buddha's life from then until his death, the history of the Buddhist order during the 110 years following the Buddha's death and about the history of the schools of Hinayana Buddhism.","author":[{"family":"Rockhill","given":"W. Woodville"}],"citation-key":"RockhillW 1884a","event-place":"London","file":"Rockhill-1884-the-life-of-the-buddha-and-the-early-history-of-his-order.pdf","ISBN":"978-81-7769-111-5","issued":{"date-parts":[["1884"]]},"language":"English","number-of-pages":"273","publisher":"Kegan Paul, Trench, Trubner & Co. Ltd.","publisher-place":"London","title":"The Life of the Buddha and the Early History of His Order","type":"book"},
  {"id":"SamtaniNH 1971a","abstract":"Buddhist canonical text; critical edition with commentary.","author":[{"family":"Samtani","given":"N. H."}],"citation-key":"SamtaniNH 1971a","collection-number":"XIII","collection-title":"Tibetan Sanskrit Works","event-place":"Patna","file":"Samtani-1971-the-arthaviniścaya-sūtra-&-its-commentary.pdf","issued":{"date-parts":[["1971"]]},"publisher":"K.P. Jayaswal Research Institute","publisher-place":"Patna","title":"The Arthaviniścaya-Sūtra & its Commentary (Nibandhna) written by Bhikṣu Vīryaśrīdatta of Śrī Nālandāvihāra","type":"book"},
  {"id":"SchmithausenL 1976a","accessed":{"date-parts":[["2026",1,12]]},"author":[{"family":"Schmithausen","given":"Lambert"}],"citation-key":"SchmithausenL 1976a","container-title":"Zeitschrift für Missionswissenschaft und Religionswissenschaft","DOI":"10.71517/ZMR.V60I4.21694","file":"Schmithausen-1976-die-vier-konzentrationen-der-aufmerksamkeit.pdf","issue":"4","issued":{"date-parts":[["1976"]]},"language":"de","page":"241–266","title":"Die vier \"Konzentrationen der Aufmerksamkeit\"","type":"article-journal","URL":"https://www.zmr-online.de/ojs/index.php/zmr/article/view/21694","volume":"60"},
  {"id":"SchopenG 1997a","abstract":"From the Preface \"The present volume provides an essential foundation for a social history of Indian Buddhist monasticism. Challenging the popular stereotype that represented the accumulation of merit as the domain of the layperson while monks concerned themselves with more sophisticated realms of doctrine and meditation, Professor Schopen problematizes many assumptions about the lay-monastic distinction by demonstrating that monks and nuns, both the scholastic elites and the less learned, participated actively in a wide range of ritual practices and institutions that have heretofore been judged 'popular,' from the accumulation and transfer of merit; to the care of deceased relatives;.... Taken together, the studies contained in this volume represent the basis for a new historiography of Buddhism, not only for their critique of many of the idees recues of Buddhist Studies but for the compelling connections they draw between apparently disparate details.\" ―Donald S. Lopez, Jr.","author":[{"family":"Schopen","given":"Gregory"}],"citation-key":"SchopenG 1997a","event-place":"Honolulu","file":"Schopen-1997-bones,-stones-and-buddhist-monks-collected-papers.pdf","ISBN":"978-0-8248-1870-8","issued":{"date-parts":[["1997"]]},"language":"English","number-of-pages":"344","publisher":"University of Hawaii Press","publisher-place":"Honolulu","title":"Bones, Stones and Buddhist Monks: Collected Papers on the Archaeology, Epigraphy and Texts of Monastic Buddhism in India","title-short":"Bones, Stones and Buddhist Monks","type":"book"},
  {"id":"SchopenG 2004a","abstract":"Buddhist Monks and Business Matters is the second in a series of collected essays by one of the today's most distinguished scholars of Indian Buddhism. In these articles, all save one published in various places from 1994 through 2001, Gregory Schopen once again displays the erudition and originality that have contributed to a major shift in the way that Indian Buddhism is perceived, understood, and studied.","author":[{"family":"Schopen","given":"Gergory"}],"citation-key":"SchopenG 2004a","event-place":"Honolulu","file":"","ISBN":"978-0-8248-2774-8","issued":{"date-parts":[["2004"]]},"language":"English","number-of-pages":"444","publisher":"University of Hawaii Press","publisher-place":"Honolulu","title":"Buddhist Monks and Business Matters: Still More Papers on Monastic Buddhism in India","title-short":"Buddhist Monks and Business Matters","type":"book"},
  {"id":"SeneviratneHL 1999a","abstract":"The Work of Kings is a stunning new look at the turbulent modern history and sociology of the Sri Lankan Buddhist Monkhood and its effects upon contemporary society. Using never-before translated Sinhalese documents and extensive interviews with monks, Sri Lankan anthropologist H.L. Seneviratne unravels the inner workings of this New Buddhism and the ideology on which it is based.  Beginning with Anagarika Dharmapala's \"rationalization\" of Buddhism in the early twentieth century, which called for monks to take on a more activist role in the community, Seneviratne shows how the monks have gradually revised their role to include involvement in political and economic spheres. The altruistic, morally pure monks of Dharamapala's dreams have become, Seneviratne trenchantly argues, self-centered and arrogant, concealing self-aggrandizement behind a façade of \"social service.\"  A compelling call for reform and a forceful analysis, The Work of Kings is essential to anthropologists, historians of religion, and those interested in colonialism, nationalism, and postcolonial politics.","author":[{"family":"Seneviratne","given":"H. L."}],"citation-key":"SeneviratneHL 1999a","event-place":"Chicago","file":"","ISBN":"978-0-226-74866-5","issued":{"date-parts":[["1999"]]},"language":"English","number-of-pages":"386","publisher":"University of Chicago Press","publisher-place":"Chicago","title":"The Work of Kings","type":"book"},
  {"id":"SmithNJ 2001a","author":[{"family":"Smith","given":"Norman Joesph"}],"citation-key":"SmithNJ 2001a","container-title":"Proposed Submis to Journal of the International Association of Buddhist Studies (JIABS)","file":"Smith-2001-the-17-versions-of-the-buddhas-first-discourse.pdf","issued":{"date-parts":[["2001"]]},"title":"The 17 Versions of The Buddha’s First Discourse","type":"article-journal"},
  {"id":"Soma 1941a","abstract":"This is a new release of the original 1949 edition.","author":[{"family":"Soma","given":"Bhikkhu"}],"citation-key":"Soma 1941a","collection-number":"BP501S","collection-title":"Book Publications","event-place":"Sri Lanka","file":"Soma-1941-the-way-of-mindfulness.pdf","issued":{"date-parts":[["1941"]]},"language":"English","number-of-pages":"216","publisher":"Buddhist Publication Society","publisher-place":"Sri Lanka","title":"The Way of Mindfulness","type":"book"},
  {"id":"Sujato 2012a","author":[{"family":"Sujato","given":"Bhikkhu"}],"citation-key":"Sujato 2012a","file":"","issued":{"date-parts":[["2012"]]},"language":"English","note":"tMS: spom\ntMS-audio: audiospom","title":"A Swift Pair of Messengers: Calm with insight in the Buddha’s words","title-short":"A Swift Pair of Messengers","type":"book"},
  {"id":"Sujato 2012b","abstract":"Why are there so many schools of Buddhism? Are the differences just cultural, or do they have fundamentally different visions of Dhamma? This work assesses the claims of the traditions, and takes into account to findings of modern scholarship. It pays special attention to the origins of the monastic orders. If we are to understand the differences, and sometimes tensions, between the schools of Buddhism today, we must examine more closely the forces that spurred their formation.","author":[{"family":"Sujato","given":"Bhikkhu"}],"citation-key":"Sujato 2012b","event-place":"Place of publication not identified","file":"Sujato-2012-sects-&-sectarianism.pdf","ISBN":"978-1-921842-06-1","issued":{"date-parts":[["2012"]]},"language":"English","number-of-pages":"176","publisher":"Santipada","publisher-place":"Place of publication not identified","title":"Sects & Sectarianism","type":"book"},
  {"id":"Ṭhānissaro 1996a","author":[{"family":"Ṭhānissaro","given":"Bhikkhu"}],"citation-key":"Ṭhānissaro 1996a","file":"Ṭhānissaro-1996-the-wings-to-awakening.pdf","issued":{"date-parts":[["1996"]]},"language":"English","publisher":"Dhamma Dana Publication","title":"The Wings to Awakening","type":"book","URL":"https://www.dhammatalks.org/books/Wings/"},
  {"id":"ThiệnChâu 1999a","author":[{"family":"Thiện Châu","given":"Bhikṣu Thích"}],"citation-key":"ThiệnChâu 1999a","file":"Thiện Châu-1999-the-literature-of-the-personalists-of-early-buddhism.pdf","ISBN":"978-93-5903-378-5","issued":{"date-parts":[["1999"]]},"language":"English","number-of-pages":"256","publisher":"Motilal Banarsidass Publishing House","title":"The Literature of the Personalists of Early Buddhism","type":"book"},
  {"id":"VelkarN 1969a","author":[{"family":"Velkar","given":"Neela"}],"citation-key":"VelkarN 1969a","file":"","genre":"Unpublished","issued":{"date-parts":[["1969",6]]},"publisher":"University of Bombay","title":"Upāsana in the Upaniṣads","type":"thesis"},
  {"id":"WaldschmidtE 1951a","author":[{"family":"Waldschmidt","given":"Ernst"}],"citation-key":"WaldschmidtE 1951a","event-place":"Berlin","file":"","issued":{"date-parts":[["1951"]]},"publisher":"Akadamie-Verlag","publisher-place":"Berlin","title":"Das Mahāparinirvāṇa Sūtra (Complete reconstructed Sanskrit Mahāparinirvāṇa Sutta in 3 parts)","type":"book","URL":"https://suttacentral.net/sf245/san/waldschmidt"},
  {"id":"WaldschmidtE 1968a","author":[{"family":"Waldschmidt","given":"Ernst"}],"citation-key":"WaldschmidtE 1968a","file":"","issued":{"date-parts":[["1968"]]},"title":"Drei Fragmente Buddistischer Sūtras aus den Turfanhandschriften (Sanskrit fragment of Mahāparinirvāṇa Sutta)","type":"book","URL":"https://suttacentral.net/sf273/san/waldschmidt"},
  {"id":"Walshe 1995a","abstract":"This book offers a complete translation of the Dīgha Nikāya, the long discourses of the Buddha, one of the major collections of texts in the Pali Canon, the authorized scriptures of Theravada Buddhism. This collection—among the oldest records of the historical Buddha’s original teachings, given in India two and a half thousand years ago—consists of thirty-four longer-length suttas, or discourses, distinguished as such from the middle-length and shorter suttas of the other collections.\n\nThese suttas reveal the gentleness, compassion, power, and penetrating wisdom of the Buddha. Included are teachings on mindfulness (Mahāsatipaṭṭhāna Sutta); on morality, concentration, and wisdom (Subha Sutta); on dependent origination (Mahānidrāna Sutta); on the roots and causes of wrong views (Brahmajāla Sutta); and a long description of the Buddha’s last days and passing away (Mahāparinibbāna Sutta); along with a wealth of practical advice and insight for all those travelling along the spiritual path.\n\nVenerable Sumedho Thera writes in his foreword: “[These suttas] are not meant to be ‘sacred scriptures’ that tell us what to believe. One should read them, listen to them, think about them, contemplate them, and investigate the present reality, the present experience, with them. Then, and only then, can one insightfully know the truth beyond words.”\n\nIntroduced with a vivid account of the Buddha’s life and times and a short survey of his teachings, The Long Discourses of the Buddha brings us closer in every way to the wise and compassionate presence of Gotama Buddha and his path of truth.","accessed":{"date-parts":[["2025",4,6]]},"citation-key":"Walshe 1995a","collection-title":"Teachings of the Buddha","contributor":[{"family":"Walshe","given":"Maurice"}],"file":"","ISBN":"978-0-86171-103-1","language":"en","title":"The Long Discourses of the Buddha: A Translation of the Dīgha Nikāya","title-short":"The Long Discourses of the Buddha","type":"book","URL":"https://wisdomexperience.org/product/long-discourses-buddha/"},
  {"id":"Warder 1970a","abstract":"This volume describes the Buddhism of India on the basis of the comparison of all the available sources in various languages. It falls into three approximately equal parts. The first is a reconstruction of the original Buddhism presupposed by the traditions of the different schools known to us. It uses primarily the established methods of textual criticism, drawing out of the oldest extant texts of the different schools their common kernel. This kernel of doctrine is presumably common Buddhism of the period before the great schisms of the 4th and 3rd centuries BC. It may be substantially the Buddhism of the Buddha himself, though this cannot be proved: at any rate it is a Buddhism presupposed by the schools as existing about a 100 years after the Parinirvana of the Buddha, and there is no evidence to suggest that it was formulated by anyone other than the Buddha and his immediate followers. The second part traces the development of the \"Eighteen Schools\" of early Buddhism, showing how they elaborated their doctrines out of the common kernel. Here we can see to what extent the Sthaviravada, or \"Theravada\" of the Pali tradition, among others, added to or modified the original doctrine. The third part describes the Mahayana movement and the Mantrayana, the way of the bodhisattva and the way of ritual. The relationship of the Mahayana to the early schools is traced in detail, with its probable affiliation to one of them, the Purva Saila, as suggested by the consensus of the evidence. Particular attention is paid in this book to the social teaching of Buddhism, the part that relates to the \"world\" rather than to nirvana and which has been generally neglected in modern writings on Buddhism.","author":[{"family":"Warder","given":"A. K."}],"citation-key":"Warder 1970a","edition":"New edition 2000","event-place":"Delhi","file":"Warder-1970-indian-buddhism.pdf","ISBN":"978-81-208-1741-8","issued":{"date-parts":[["1970"]]},"language":"English","number-of-pages":"601","publisher":"Motilal Banarsidass,","publisher-place":"Delhi","title":"Indian Buddhism","type":"book"},
  {"id":"WatanabeF 1983a","author":[{"family":"Watanabe","given":"Fumimaro"}],"citation-key":"WatanabeF 1983a","event-place":"Delhi","file":"Watanabe-1983-philosophy-and-its-development-in-the-nikayas-and-abhidhamma.pdf","issued":{"date-parts":[["1983"]]},"language":"English","number-of-pages":"241","publisher":"Motilal Banarsidass Publications","publisher-place":"Delhi","title":"Philosophy and Its Development in the Nikayas and Abhidhamma","title-short":"Philosophy and Its Development in the Nikayas and Abhidhamma","type":"book"},
  {"id":"WaymanA 1961a","author":[{"family":"Wayman","given":"Alex"}],"citation-key":"WaymanA 1961a","collection-title":"University of California Publications in Classical Philosophy","event-place":"California","issued":{"date-parts":[["1961"]]},"language":"en","number-of-pages":"214","publisher":"University of California Press","publisher-place":"California","title":"Analysis of the Srãvakabhũmi Manuscript","type":"book","volume":"17"},
  {"id":"WillisM 2001a","accessed":{"date-parts":[["2026",1,13]]},"archive":"JSTOR","author":[{"family":"Willis","given":"Michael"}],"citation-key":"WillisM 2001a","container-title":"Journal of the Royal Asiatic Society","file":"Willis-2001-buddhist-saints-in-ancient-vedisa.pdf","ISSN":"13561863, 14740591","issue":"2","issued":{"date-parts":[["2001"]]},"page":"219–228","publisher":"Cambridge University Press","title":"Buddhist Saints in Ancient Vedisa","type":"article-journal","URL":"http://www.jstor.org/stable/25188132","volume":"11"},
  {"id":"WynneA 2003a","author":[{"family":"Wynne","given":"Alexander"}],"citation-key":"WynneA 2003a","file":"Wynne-2003-how-old-is-the-sutta-piṭaka.pdf","issued":{"date-parts":[["2003"]]},"title":"How Old is the Sutta-Piṭaka? The relative value of textual and epigraphical sources for the study of early Indian Buddhism","type":"document","URL":"https://www.budsas.org/ebud/ebsut056.htm"},
  {"id":"Yinshun 1971a","author":[{"family":"Yinshun","given":"Venerable"}],"citation-key":"Yinshun 1971a","event-place":"Taipei","file":"","issued":{"date-parts":[["1971"]]},"publisher":"Zhengwen Chubanshe","publisher-place":"Taipei","title":"Yuanshi Fojiao Shengdian zhi Jicheng (The Formation of Early Buddhist Texts)","type":"book"},
  {"id":"Yinshun 1991a","author":[{"family":"Yinshun","given":"Venerable"}],"citation-key":"Yinshun 1991a","event-place":"Taipei","file":"","issued":{"date-parts":[["1991"]]},"publisher":"Zhengwen Chubanshe","publisher-place":"Taipei","title":"Za-ahan Jing-Lun Huibian (Combined edition of Sūtra and Śāstra of Saṁyuktāgama)","type":"book"},
  {"id":"Yinshun 2009","abstract":"A Sixty-Year Spiritual Voyage on the Ocean of Dharma is a personal retrospect of Ven. Yinshun's long career of meticulous and wide-ranging scholarship. There was hardly a phase of Indian Buddhist literature that Yinshun did not explore and discuss in depth. His scholarly work, which is embodied in close to fifty volumes, extends from studies in the most ancient Buddhist canons to expositions of Madhyamaka and Mind-Only philosophy. These scholarly studies did not serve a merely academic purpose but contributed to his lifelong project of devising a truly contemporary expression of the Dharma. Sixty-Year Spiritual Voyage, which the Master wrote on the eve of his eightieth year, gives us a telescopic view of the momentous work of this prolific scholar as well as a concise statement of the conclusions he reached about the correct understanding of Buddhism in theory and practice.","author":[{"family":"Yinshun","given":"Venerable"}],"citation-key":"Yinshun 2009","event-place":"Towaco, NJ","file":"","ISBN":"978-0-9818531-0-9","issued":{"date-parts":[["2009"]]},"language":"English","number-of-pages":"133","publisher":"Noble Path Buddhist Education Fellowship","publisher-place":"Towaco, NJ","title":"A Sixty-Year Spiritual Voyage on the Ocean of Dharma","translator":[{"family":"Avis","given":"Yu-Jung L."},{"family":"Chang","given":"Po-Hui"},{"family":"Siegel","given":"Maxwell E."}],"type":"book"}
]
