{
    "Document" : "The Connected Discourses of the Buddha",
    "Author" : "Bhikkhu Bodhi",
    "Section" : "Nidānasaṁyutta",
    "SubSection" : "sn 12.38",
    "Title" : "Note #112",
    "Quote": "<p>Spk: Here, the phrase <em>one intends</em> (<em>ceteti</em>) includes all wholesome and unwholesome volition of the three planes; <em>one plans</em> (<em>pakappeti</em>), the mental fabrications of craving and views (<em>taṇhādiṭṭhikappā</em>) in the eight cittas accompanied by greed [Spk-pṭ: the fabrications of views occur only in the four cittas associated with views]; and <em>whatever one has a tendency towards</em> (<em>anuseti</em>) implies the underlying tendencies (<em>anusaya</em>) under the headings of conascence and decisive-support conditions for the twelve (unwholesome) volitions. (On the twelve unwholesome cittas, see CMA 1:4-7.)</p><p><em>This becomes a basis</em> (<em>ārammaṇam etaṃ hoti</em>): These various states such as volition become a condition; for here the word <em>ārammaṇa</em> is intended as condition (<em>paccaya</em>; that is, here <em>ārammaṇa </em>does <em>not</em> signify an object of consciousness, the usual meaning in the Abhidhamma). <em>For the maintenance of consciousness</em> (<em>viññāṇassa ṭhitiyā</em>): for the purpose of maintaining the kammic consciousness. When there is this condition, <em>there is a support for the establishing of consciousness </em>(<em>patiṭṭhā viññāṇassa hoti</em>), i.e., for the establishing of that kammic consciousness [Spk-pṭ: it has a capacity to yield fruit in one’s mental continuum]. <em>When that (kammic) consciousness is established and has come to growth</em> (<em>tasmiṃ patiṭṭhite viññāṇe ... virūḷhe</em>): when, having impelled kamma, it has grown, produced roots, through its ability to precipitate rebirth, <em>there is the production of future renewed existence</em>, i.e., production consisting in renewed existence.</p><p>Cp. <strong>12:64</strong> and <strong>22:53-54</strong> below. AN I 223-24 explains the process of renewed existence in similar terms (see <strong>n. 24</strong>). I see the verbs <em>ceteti</em> and <em>pakappeti</em> as allusions to <em>saṅkhārā</em> (which, as kammic activities, are expressive of <em>cetanā</em>—see AN III 415,7-8). <em>Anuseti</em> clearly refers to the <em>anusaya</em> or underlying tendencies, which include <em>avijjānusaya</em>, the underlying tendency to ignorance (= ignorance in the usual formula of dependent origination) and <em>rāgānusaya</em>, the underlying tendency to lust (= craving in the usual formula). The way they maintain consciousness is thus no different from the way the volitional formations, fueled by ignorance and craving, serve as the condition for consciousness: together, they underlie the flow of consciousness, infuse it with kammic potentials for renewed existence, and project it into a new existence, thereby initiating the process that will culminate in birth. I am not in full agreement with Spk in taking the <em>viññāṇa</em> that is “maintained” and “established”</p><p>as the kammic consciousness. I interpret it simply as the ongoing process of consciousness, including both the kammically active and resultant phases. At <strong>22:53-54</strong> the other four aggregates are spoken of as the <em>ārammaṇa</em> and <em>patiṭṭhā</em> of <em>viññāṇa</em>, but I am doubtful that this application will work here. To use the categories of the Abhidhamma, it seems that in this sutta the terms <em>ārammaṇa</em> and <em>patiṭṭhā </em>denote the decisive-support condition (<em>upanissayapaccaya</em>) for consciousness, while in the two suttas in the Khandhasaṃyutta they denote the conascence and support conditions (<em>sahajātapaccaya</em>, <em>nissayapaccaya</em>).</p><p>I use “volition” as a rendering for <em>cetanā</em> but “intends” for the corresponding verb <em>ceteti</em>; I use “intention” for the unrelated noun <em>saṅkappa</em>. I justify this apparent inconsistency on the ground that in Pāli the verb <em>saṅkappeti</em> (corresponding to <em>saṅkappa</em>) occurs very rarely (if at all), while English lacks a simple verb corresponding to “volition.” “A support for the establishing of consciousness” renders <em>patiṭṭhā viññāṇassa</em>. I find that “established” works consistently better as a rendering for the participle <em>patiṭṭhita</em>, but “support” for the noun <em>patiṭṭhā</em>, so to bridge the participle and the noun in the present passage (and at <strong>22:53</strong>, <strong>54</strong>) I have coined this compound expression.</p>"
}