{
    "termRoot" : "Dhammapada Aṭṭhakathā",
    "termEng" : "Dhamma Verses Commentary",
    "abbr" : "Dhp-a",
    "type" : "A Pali Non-canonical Text",
    "textTitle" : "From the Introduction of the Burlingame & Ānandajoti translation",
    "text": "<p>The Dhammapada commentary is one of the great collections of stories in the Pāḷi tradition that, although finalised in the mediaeval period, must have been accompanying the text (<em>pāḷi</em>) from the earliest days, being finally redacted into its present form during the first wave of commentaries that started to be written down around the 5<span class='superscript'>th</span> century CE.</p><p>Along with the other great collections of stories, like the commentaries on the Jātaka, the Apadāna, the Thera- and Therīgāthā, the Vimāna- and Petavatthus, it is a repository of knowledge about the people who were around the Buddha while he was alive; and also contains a plethora of information about former Buddhas and the previous lives of the Buddha and his disciples.</p><p>This particular collection purports to show how the teachings in the best-loved collection of wisdom verses in the tradition came to be spoken, giving ample scope for relating the stories behind the verses. It also serves to demonstrate how the workings of the doctrines made known by the Buddha played out in the long journeys in saṁsāra, as events in previous lives emerge to affect their lives in their present incarnations.</p><p>Some of the stories in this collection are epic in proportion and are indeed memorable. They have been used as teaching devices for millennia, as stories are often found to leave an impression on people, where abstract teachings – often of dry lists of factors and their interrelations – fail to be retained in memory. The Buddha and the Saṅgha, of course, are central to nearly all of these stories.</p>",
    "textAuthor": "Ānandajoti Bhikkhu",
    "textDate": "August, 2024",
    "site" : "Ancient Buddhist Texts",
    "siteURL" : "https://ancient-buddhist-texts.net/English-Texts/Dhamma-Verses-Comm/",
    "citationKey": "BurlingameEW 1921a"
}