{
    "term-root" : "Karma-vibhaṅga",
    "term-eng" : "The Analysis of Deeds",
    "abbr" : "Kv",
    "type" : "An early Sanskritised Prakrit text",
    "textTitle" : "From the Introduction of the Lévi (ed.) & Ānandajoti translation",
    "text": "<p>On the night of his Awakening the Buddha had three principal insights: he had been reborn in many different forms and lives over the course of an inconceivably long period of time; that beings are traveling through <em>saṁsāra</em> (the round of births and deaths) according to their deeds, good and bad (<em>karma-vipāka</em>); and the insight into the four noble truths, which included as the fourth truth the eightfold noble path.</p><p>The teaching of <em>karma-vipāka</em> (deeds and their results) was therefore a fundamental insight for the Buddha, which provided the basis for his Awakening, and it has remained central to the teaching throughout the development of Buddhism in its various traditions.</p><p>In the original teachings deeds and their results are presented quite subtly, as everyone, of course, produces many millions of intentional deeds, both good and bad, over the course of their lifetime. And the deeds themselves are often motivated by a mixture of good and bad intentions, which are not purely one or the other.</p><p>In the later teachings these subtleties were often obscured by the didactic need to present the message in a clear and unambiguous way, and we find what is in essence a very complex teaching reduced to something rather simplistic: do this bad deed in this life, get a complimentary bad result in the next; do this good deed, get this good result.</p><p>Although things are not quite so simple as this, it does form the backdrop to many of the later texts and teachings in the Buddhist traditions, and provided simple explanations of events that could be utilised very successfully in stories which exemplified the centrality of causality in the working out of events in people’s lives. It is this theme that is elaborated on in this discourse, and the many stories that accompany it.</p><p>The Karma-vibhaṅga (Kv) appears to be an expansion of a discourse similar to the Cūḷa-kamma-vibhaṅga-sutta found in the Pāḷi Majjhima-nikāya (MN 135), but only 14 states are explained there, the fourteen that make up the first section of the text here. There are then 66 more sections added to the list. They do not follow the same formula set up in these first 14, however, but have their own organising principles.</p>",
    "textAuthor": "Ānandajoti Bhikkhu",
    "textDate": "April, 2020",
    "site" : "Ancient Buddhist Texts",
    "siteURL" : "https://ancient-buddhist-texts.net/Texts-and-Translations/Karma-vibhanga/",
    "citationKey": ""
}