{
	"Authors": "Ajahn Brahm",
	"BookTitle": "Opening Up to Kindfulness",
	"BookSubtitle": "Buddhism: Discovering the Basics",
	"AddInfo": [],
	"Copyright": [
		"Published in **2021**",
		"182pp (in pdf format).",
		"For enquiry about the book or suggestions for improvement, please contact [wiswo.org/contact/]X(https://wiswo.org/contact/)",
		"Copyright © Ajahn Brahmavamso 2021"
	],
	"CCLicense": "<div class='cclicense'><h3>Attribution-NonCommercial-NoDerivatives 4.0 International <span>(CC BY-NC-ND 4.0)</span><span class='expander'>⟹</span></h3><div id = 'ccDetail' class ='noshow'><p>You are free to:</p><ul><li><strong>Share</strong> — copy and redistribute the material in any medium or format</li></ul><p>Under the following terms:</p><ul><li><strong>Attribution</strong> — You must give appropriate credit, provide a link to the license, and indicate if changes were made. You may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.</li><li><strong>NonCommercial</strong> — You may not use the material for commercial purposes.</li><li><strong>NoDerivatives</strong> — If you remix, transform, or build upon the material, you may not distribute the modified material.</li><li><strong>No additional restrictions</strong> — You may not apply legal terms or technological measures that legally restrict others from doing anything the license permits.</li></ul><p><strong>Notices:</strong></p><p>You do not have to comply with the license for elements of the material in the public domain or where your use is permitted by an applicable exception or limitation.</p><p>No warranties are given. The license may not give you all of the permissions necessary for your intended use. For example, other rights such as publicity, privacy, or moral rights may limit how you use the material.</p></div></div>",
	"FrontCover": "../_resources/book-data/outk/FrontLarge.jpg",
	"BackCover": "../_resources/book-data/outk/BackLarge.jpg",
	"BackMatter": [
		"*“Kindfulness goes across all faiths and cultures, creating peace and harmony, breaking barriers between people.”*",
		"Ajahn Brahm was born in London in 1951. At age sixteen, he began regarding himself as Buddhist and his interest in Buddhism flourished while studying theoretical physics at Cambridge University.",
		"He was ordained as a monk at twenty-three and spent nine years training in the Thai forest meditation tradition under the renowned meditation master Venerable Ajahn Chah.",
		"In 1983, Ajahn Brahm came to Australia to help establish a monastery near Perth. He is now the abbot of Bodhinyana Monastery and the spiritual director of the Buddhist Society of Western Australia and many others in Australia and overseas.",
		"Ajahn Brahm serves not only people in Australia but international communities, giving talks and retreats around the world.",
		"In 2004, he was awarded the John Curtin Medal for vision, leadership, and community services. In 2019, Ajahn Brahm was awarded the Order of Australia, General Division medal, for services to Buddhism and gender equality."
	],
	"AuthorsData": [
		{
			"ShortName": "Ajahn Brahm",
			"InfoImage": "../_resources/author-data/brahm/info.jpg",
			"ShortBio": [
				"Ajahn Brahmavamso Mahathera was born in London in 1951. ",
				"After graduating from Cambridge he taught in a school for one year before travelling to Thailand to train with Ajahn Chah. ",
				"After practising for nine years as a monk in Thailand, he was sent to Perth, Australia by Ajahn Chah in 1983. ",
				"He is Abbot of Bodhinyana monastery, Spiritual Director of the BSWA and a number of other Buddhist Societies and projects world-wide."
			]
		}
	]
}