[
  {
    "fnNumber": "1",
    "fnHTML": "<p><span class='sclinktext'>MN&#8239;24<span class='scsegments'>:14.1–14.2</span></span> <span class='ptsref'>PTS: M I 145</span></p>"
  },
  {
    "fnNumber": "2",
    "fnHTML": "<p><span class='sesame' data-sesame-key='zotref:'>Sunyo 2021</span></p>"
  },
  {
    "fnNumber": "3",
    "fnHTML": "<p>For example <span class='sesame biblioref'>Ñāṇananda 2016</span> p.71: “What the Arahants have done is to bring consciousness to such a state where it gets no footing on name-and-form. In other words, it is the state of unestablished consciousness (<span lang='pi'>appatiṭṭhita viññaṇa</span>).”</p>"
  },
  {
    "fnNumber": "4",
    "fnHTML": "<p>For example <span class='sesame biblioref'>Harvey 1995</span> p.202, <span class='sesame biblioref'>Ṭhānissaro 2008a</span> p.118, <span class='sesame biblioref'>Pasanno</span> p.155, <span class='sesame biblioref'>Cintita</span> p.179</p>"
  },
  {
    "fnNumber": "5",
    "fnHTML": "<p>See <span class='sesame'>Bodhi 2000 p.840</span> “The five aggregates are so called because they each unite under one label a multiplicity of phenomena that share the same defining characteristic.”</p>"
  },
  {
    "fnNumber": "6",
    "fnHTML": "<p><span class='sclinktext'>SN&#8239;22.82<span class='scsegments'>:6.1–6.7</span></span>, <span class='sclinktext'>MN&#8239;109<span class='scsegments'>:8.1–8.7</span></span> <span class='ptsref'>PTS: M III 17</span></p>"
  },
  {
    "fnNumber": "7",
    "fnHTML": "<p>For example <span class='sclinktext'>SN&#8239;22.59<span class='scsegments'>:10.1</span></span></p>"
  },
  {
    "fnNumber": "8",
    "fnHTML": "<p>As <span class='sesame biblioref'>Ṭhānissaro 2018</span> p.6</p>"
  },
  {
    "fnNumber": "9",
    "fnHTML": "<p><span class='sclinktext'>MN&#8239;49<span class='scsegments'>:25.1</span></span> <span class='ptsref'>PTS: M I 330</span>. For a discussion see <span class='sesame' data-sesame-key='zotref:'>Sunyo 2021</span></p>"
  },
  {
    "fnNumber": "10",
    "fnHTML": "<p>See <span class='sclinktext'>SN&#8239;22.56<span class='scsegments'>:13.1–14.2</span></span>, where in context of the five aggregates, the aggregate of consciousness is also defined as that of the six senses.</p>"
  },
  {
    "fnNumber": "11",
    "fnHTML": "<p><span class='sclinktext'>SN&#8239;12.2<span class='scsegments'>:12.1–12.4</span></span>, <span class='sclinktext'>SN&#8239;12.27<span class='scsegments'>:3.9</span></span>, <span class='sclinktext'>SN&#8239;12.28<span class='scsegments'>:3.9</span></span>, <span class='sclinktext'>SN&#8239;12.33<span class='scsegments'>:9.9</span></span></p>"
  },
  {
    "fnNumber": "12",
    "fnHTML": "<p><span class='sclinktext'>SN&#8239;56.28</span> explains: “They are called ‘noble one’s truths’ (<span lang='pi'>ariya-sacca</span>), because in this world […] the Truth­finder (<span lang='pi'>tathāgata</span>) is the noble one (<span lang='pi'>ariya</span>).” <span class='sesame biblioref'>Norman 1997</span> p.16 wrote: “My own feeling is that it is very likely that ‘the truth of the noble one (the Buddha)’ is the correct translation.” See also <span class='sesame biblioref'>Norman 2008</span> and <span class='sesame biblioref'>Harvey 2009</span></p>"
  },
  {
    "fnNumber": "13",
    "fnHTML": "<p><span lang='pi'>Tatra tatra</span>, ‘in various realms’. <span class='sclinktext'>MN&#8239;2<span class='scsegments'>:8.8</span></span> and <span class='sclinktext'>MN&#8239;38<span class='scsegments'>:5.11</span></span> use <span lang='pi'>tatra tatra</span> (more literally ‘in various places’) explicitly for rebirth in different realms. That this is also the intended meaning in the second truth is indicated by it being about the craving that leads to a next life. <a href='https://suttacentral.net/XXX/en/sujato#YYY' class='extlink'>Sujato 2023</a> translates “in various different realms”.</p>"
  },
  {
    "fnNumber": "14",
    "fnHTML": "<p><span class='sclinktext'>SN&#8239;56.13<span class='scsegments'>:3.1–3.4</span></span></p>"
  },
  {
    "fnNumber": "15",
    "fnHTML": "<p>See also <span class='sesame biblioref'>Piyadassi</span> p.5, <span class='sesame biblioref'>Bodhi 1984</span> p.5 n.2, <span class='sesame biblioref'>Bodhi 2015</span> p.19</p>"
  },
  {
    "fnNumber": "16",
    "fnHTML": "<p><span class='sclinktext'>AN&#8239;3.61<span class='scsegments'>:15.1–15.14</span></span></p>"
  },
  {
    "fnNumber": "17",
    "fnHTML": "<p><span lang='pi'>Paṭiccasamuppādaṁ</span>, ‘the dependent arising of things’. By this I mean the actual principles existing in nature, rather than the Buddha’s teachings on these principles, which I call ‘Dependent Arising’.</p><p>The term is sometimes translated as ‘dependent co-arising’, but the prefix <span lang='pi'>saṁ</span>- in <span lang='pi'>sam&shy;up&shy;pāda</span> is simply a redundancy for the following prefix up- (=<span lang='pi'>ud</span>-). As <span class='sesame biblioref'>PED</span> says under <span lang='pi'>saṁ</span>-: “very often merely pleonastic, esp. in comb[inatio]n with other prefixes.” Therefore, under <span lang='pi'>samuppajjati</span> it simply has, “to arise, to be produced”. No other dictionary suggests ‘co-arising’ either. To give some examples of the word <span lang='pi'>sam&shy;up&shy;pāda</span> in a daily-life context: <span class='sclinktext'>SN&#8239;3.25<span class='scsegments'>:2.14</span></span> mentions the arising (<span lang='pi'>samuppanne</span>) of a great peril, namely a mountain that crushes everything; <span class='sclinktext'>AN&#8239;8.54<span class='scsegments'>:6.1, 6.7, 7.1, 7.7</span></span> mentions wealth that has arisen (<span lang='pi'>samuppannānaṁ</span>); <a href='https://suttacentral.net/XXX/en/sujato#YYYhttps://suttacentral.net/XXX/en/sujato%23YYY' class='extlink'>Kp 8:1.3</a> mentions the arising (<span lang='pi'>samuppanne</span>) of a need to use stored up wealth; <span class='sclinktext'>Thag&#8239;1.30<span class='scsegments'>:1.3</span></span> mentions the arising (<span lang='pi'>samuppanno</span>) of sickness; and <span class='sclinktext'>Iti&#8239;43<span class='scsegments'>:3.1</span></span> uses ‘arisen’ (<span lang='pi'>samuppannaṁ</span>) as a synonym for ‘born’ (<span lang='pi'>jātaṁ</span>) and ‘came to be’ (<span lang='pi'>bhūtaṁ</span>). We do not speak of a co-arising of sickness or wealth, nor does there seem to be a good justification, certainly not on a linguistic basis, to speak of a co-arising of death, for instance. <span lang='pi'>Samupajjati</span> is simply a synonym for <span lang='pi'>upajjati</span>, including in the context of Dependent Arising. There is also no such thing as “<span lang='pi'>saṁ-nirodha</span>” (“co-cessation”) but only <span lang='pi'>nirodha</span> (cessation), which indicates “co-” is not intended in <span lang='pi'>sam&shy;up&shy;pāda</span> either. See also <span class='sesame biblioref'>Jones 2021</span> p.234: “When translating the expression <span lang='pi'>paṭicca-samuppāda</span> in the Pāli Canon, it therefore seems inappropriate to use words like ‘co-arising’ or ‘co-production’.” <span class='sesame biblioref'>Schmithausen 1997</span> n.73 similarly concluded: “It is not probable that the prefix <span lang='pi'>saṁ</span>- was, from the outset, intended to convey such a heavy meaning.”</p>"
  },
  {
    "fnNumber": "18",
    "fnHTML": "<p><span class='sclinktext'>MN&#8239;28<span class='scsegments'>:28.5–28.9</span></span> <span class='ptsref'>PTS: M I 191</span></p>"
  },
  {
    "fnNumber": "19",
    "fnHTML": "<p><span class='sclinktext'>SN&#8239;22.5<span class='scsegments'>:2.1–4.10</span></span></p>"
  },
  {
    "fnNumber": "20",
    "fnHTML": "<p><span class='sclinktext'>SN&#8239;22.30</span></p>"
  },
  {
    "fnNumber": "21",
    "fnHTML": "<p>As glossed by <span class='sesame biblioref'>PED</span>, <span class='sesame biblioref'>CPD</span>, <span class='sesame biblioref'>CPED</span>, <span class='sesame biblioref'>DOP</span>, <span class='sesame biblioref'>DPD</span>. I translate it as ‘production’ primarily to illustrate the simile of the painter, which uses the same word for producing a painting. See also note 166</p>"
  },
  {
    "fnNumber": "22",
    "fnHTML": "<p>For example <span class='sesame biblioref'>Bodhi 2012</span>, <span class='sclinktext'>AN&#8239;10.65</span></p>"
  },
  {
    "fnNumber": "23",
    "fnHTML": "<p><span class='sclinktext'>Ud&#8239;8.9<span class='scsegments'>:5.1–5.4</span></span></p>"
  },
  {
    "fnNumber": "24",
    "fnHTML": "<p>For the meaning of ‘fuel’ see for example <span class='sclinktext'>SN&#8239;44.9<span class='scsegments'>:6.5–6.6</span></span>: “When a being laid down their body and is not yet reborn in another body, I say craving is their fuel (<span lang='pi'>upādāna</span>), because craving is what fuels them at that time.” For the meaning of ‘taking up’ see for example <span class='sclinktext'>MN&#8239;75<span class='scsegments'>:24.6–24.8</span></span> <span class='ptsref'>PTS: M I 512</span>: “I have long been tricked, cheated, and deceived by this mind. For what I have been taking up was just form, sensation, perception, will, and consciousness. And dependent on that taking up (<span lang='pi'>upādāna</span>) of mine, there was existence.”</p>"
  },
  {
    "fnNumber": "25",
    "fnHTML": "<p>For the ten powers and four reasons to be self-confident see <span class='sclinktext'>MN&#8239;12<span class='scsegments'>:9.1–27.1</span></span> <span class='ptsref'>PTS: M I 69</span></p>"
  },
  {
    "fnNumber": "26",
    "fnHTML": "<p><span class='sclinktext'>SN&#8239;12.21</span></p>"
  },
  {
    "fnNumber": "27",
    "fnHTML": "<p><span lang='pi'>Imasmiṁ sati idaṁ hoti</span>, ‘There will be this (<span lang='pi'>idaṁ hoti</span>), only if there is that (<span lang='pi'>imasmiṁ sati</span>)’. The clause <span lang='pi'>imasmiṁ sati</span> forms a locative absolute. There have been discussions whether this implies that the factors of Dependent Arising happen simultaneously or whether it allows for a separation in time (e.g. <span class='sesame biblioref'>Brahmavamso 2002</span>). But this misses the fact that the locative absolute, although it can have temporal connotations, can also form a conditional. <span class='sesame biblioref'>Wijesekera 1993</span> §184 states: “the temporal notion is not the only idea expressed by the loc[ative] absolute. […] It may also signify a condition that exists or should exist for the fulfilment of the main action, which may be rendered by such expressions as ‘if, on condition, provided that’ etc.” See also <span class='sesame biblioref'>Duroiselle</span> §603 iii: “<span lang='pi'>Sati</span>, the locative singular of <span lang='pi'>santo</span> […] may also often be translated by ‘if, such being the case’.” This conditional meaning applies here. The clause <span lang='pi'>imasmiṁ sati</span> describes a general principle of dependency without any temporal implications.</p><p>By “a condition that exists or should exist” Wijesekera means the locative absolute can denote either a sufficient or a necessary condition. A necessary condition can be indicated with ‘provided that’, as Wijesekera suggests, but also with ‘only if’, as I have done. It is a subtle difference, but I think <span lang='pi'>imasmiṁ sati idaṁ hoti</span> should not be translated as “there will be this if there is that” (omitting ‘only’), because this forms a sufficient condition, and sufficiency does not apply to all the links—yet this statement is individually applied to all links, as in §11.</p><p>To give a general example first, “there will be rain if there are clouds” would mean it always rains whenever there are clouds. Clouds are sufficient for rain. However, “there will be rain only if there are clouds”, just means it cannot rain without clouds. Clouds are necessary for rain. In the context of Dependent Arising “there will be craving if there are sensations” would mean there will be craving whenever there are sensations. Sensations would be sufficient for craving. This is incorrect, because enlightened beings still experience sensations yet don’t have craving, and even when you’re not enlightened, you can experience sensations without craving, like in deep meditation. However, the translation “there will be craving only if there are sensations” instead means sensations are just a necessary condition for craving. Likewise, birth is not a sufficient condition for old age, since beings can die young. So there will be old age only if there is birth, not if there is birth. Or, if in §83 we were to translate the mutual dependency between consciousness and the immaterial aspects and body as “there will be the immaterial aspects and body if there is consciousness [and] there will be consciousness if there are the immaterial aspects and body”, we would technically say that the two factors keep each other in existence, since there are two statements of sufficiency. However, “there will the immaterial aspects and body only if there is consciousness [and] there will be consciousness only if there are the immaterial aspects and body” leaves room for ignorance and wilful actions to also be required. This mutual dependency is of course exactly what the simile of the bundles of reeds portrays (§95). The idea is that one bundle can stand only if the other stands; not that if one stands, the other also stands automatically.</p><p>Furthermore, if the links in Dependent Arising were translated as sufficient conditions (that is, using ‘if’ instead of ‘only if’) technically there could also be other sufficient conditions that lead to the same results. For example, wilful actions could then logically have been the result of something other than ignorance—knowledge, let’s say. For it would then be possible to say: “There will be wilful actions if there is ignorance, and there will be wilful actions if there is knowledge.” With ‘only if’ this does not work (as it shouldn’t): “There will be wilful actions only if there is ignorance, and there will be wilful actions only if there is knowledge.” The two statements conflict, because they are necessary conditions with opposing requirements. The whole point of the sequence of dependent arising is that all links are necessary conditions. Otherwise suffering could technically have been brought about through something other than ignorance.</p><p>The underlying issue is, this difference between ‘if’ and ‘only if’ does not exist in Pāli. The locative absolute can be translated as either, depending on the context. However, the context of Dependent Arising demands the latter. It demands necessary conditions. See also <span class='sesame biblioref'>Jayatilleke</span> p.449 on this phrase: “B does not occur unless A is present and occurs <em>only</em> when A is present.” (emphasis added)</p>"
  },
  {
    "fnNumber": "28",
    "fnHTML": "<p>See also <span class='sesame biblioref'>Shulman</span> p.299</p>"
  },
  {
    "fnNumber": "29",
    "fnHTML": "<p>More literally, ‘dependency (<span lang='pi'>paccayatā</span>) on something (<span lang='pi'>idap</span>)’. The term <span lang='pi'>idap&shy;pac&shy;cay&shy;atā</span> is sometimes translated as ‘causality’, which may work too. However, to many people ‘to cause’ means “to actively produce as a result” (Wiktionary.com s.v. ‘cause’)—think of billiard balls bouncing against one another—and in context of Dependent Arising this kind of causality does not always apply. Birth does not actively produce death, for example. It is heart attacks and car crashes that do so, arguably. Neither do sensations actively produce craving: it is ignorance that does. Also, consciousness and <span lang='pi'>nā&shy;ma&shy;rū&shy;pa</span>, which are mutually dependent, do not cause one another in an active way. They just rely on one another, as the simile of the reeds at §95 illustrates, both being in a sense “actively produced” by wilful actions. <span class='sesame biblioref'>Jones 2022</span> p.135 agreed: “To understand them as a causal sequence, whereby ignorance is the cause of the inherited conditioning factors (<span lang='pi'>saṅ&shy;khā&shy;rā</span>), feeling (<span lang='pi'>vedanā</span>) is the cause of craving, birth is the cause of ageing and death, and so on, leads to obscurity and contradiction. But to understand each of these conditionally-arisen phenomena as necessary and sometimes sufficient conditions for the arising of the next in the sequence allows for interpretations that are truer to the teachings.”</p><p>In everyday contexts the words <span lang='pi'>paṭicca</span> and <span lang='pi'>paccaya</span> also do not indicate what we normally call ‘causes’. It is said that the body depends on (<span lang='pi'>paṭicca</span>) food, and will die without it. (<span class='sclinktext'>SN&#8239;46.2<span class='scsegments'>:1.2</span></span>) Food is not the cause of the body: it is just one condition necessary for its continuance. In context of Dependent Arising itself, the <span class='sesame'>Longer Discourse on the Ending of Craving</span> mentions that fire depends on (<span lang='pi'>paṭicca</span>) fuel. (§102) Fuel by itself does not really cause fire either. As to <span lang='pi'>paccaya</span>, a noble disciple is said to be ‘not dependent on others’ (<span lang='pi'>aparappaccaya</span>). These and other everyday uses of the words also indicate that Dependent Arising is about dependencies, not causalities, at least not in the way the word ‘cause’ is sometimes understood.</p><p>The word <span lang='pi'>nidāna</span> is sometimes also translated as ‘cause’, particularly in the title of the <span data-sesame-key='dn-blurbs:dn15' class='sesame'>Mahānidāna Sutta</span>, then called ‘The Great Discourse on Causality’. But a common translation for the word itself is ‘source’, which I think is more accurate. See for example <span class='sesame biblioref'>Sujato 2023</span> at <span class='sclinktext'>AN&#8239;3.34</span>, <span class='sesame'>Nidāna Sutta</span>, titled ‘Sources’. As another example, discourses stemming from Sāvatthi are called <span lang='pi'>Sāvatthi-nidānaṁ</span>. In this light, the <span data-sesame-key='dn-blurbs:dn15' class='sesame'>Mahānidāna Sutta</span> should be called something like ‘The Great Discourse on the Sources [of things]’, although that definitely doesn’t sound as good. <span class='sesame biblioref'>Schmithausen 2000</span> calls it the Great Discourse on the Underlying Factors (<em>Großen Lehrrede von den zugrundeliegenden Factoren</em>). In this book I just refer to the discourse by its Pāli name.</p><p>All that said, ‘causality’ is not wrong per se. There are various ways to define the term, some of which do not differ much from dependency, if at all. Pragmatically the difference between the two may have limited relevance as well, because whether we say death depends on birth or death is caused by birth, the fundamental problem remains the same. Many of the links are also causal no matter how we interpret it. I also use the word ‘cause’ in the main text, although in the translations I stuck to ‘condition’ for <span lang='pi'>hetu</span> and ‘requirement’ for <span lang='pi'>paccaya</span>. The words have a range of meaning that does not match a single English word, so these translations are not applicable throughout the canon, but they do work in the present context.</p>"
  }
]