{
    "Document" : "The Numerical Discourses of the Buddha",
    "Author" : "Bhikkhu Bodhi <em>tr.</em>",
    "Section" : "The Book of Sevens<br>The Greart Sacrifice",
    "SubSection" : "an 7.49",
    "Title" : "Perceptions (2)",
    "Quote": "<p>“Bhikkhus, these seven perceptions, when developed and cultivated, are of great fruit and benefit, culminating in the deathless, having the deathless as their consummation. What seven? The perception of unattractiveness, the perception of death, the perception of the repulsiveness of food, the perception of nondelight in the entire world, the perception of impermanence, the perception of suffering in the impermanent, and the perception of non-self in what is suffering. These seven perceptions, when developed and cultivated, are of great fruit and benefit, culminating in the deathless, having the deathless as their consummation.</p> <p>(1) “It was said: ‘The perception of unattractiveness, bhikkhus, when developed and cultivated, is of great fruit and benefit, culminating in the deathless, having the deathless as its consummation.’ For what reason was this said?</p> <p>“When a bhikkhu often dwells with a mind accustomed to the perception of unattractiveness, his mind shrinks away from sexual intercourse, [47] turns back from it, rolls away from it, and is not drawn toward it, and either equanimity or revulsion becomes settled in him. Just as a cock’s feather or a strip of sinew, thrown into a fire, shrinks away from it, turns back from it, rolls away from it, and is not drawn toward it, so it is in regard to sexual intercourse when a bhikkhu often dwells with a mind accustomed to the perception of unattractiveness.</p> <p>“If, when a bhikkhu often dwells with a mind accustomed to the perception of unattractiveness, his mind inclines to sexual intercourse, or if he does not turn away from it,<sup>1512</sup> he should understand: ‘I have not developed the perception of unattractiveness; there is no distinction between my earlier condition and my present one;<sup>1513</sup> I have not attained the fruit of development.’ Thus he clearly comprehends this. But if, when he often dwells with a mind accustomed to the perception of unattractiveness, his mind shrinks away from sexual intercourse … and either equanimity or revulsion becomes settled in him, he should understand: ‘I have developed the perception of unattractiveness; there is a distinction between my earlier condition and my present one; I have attained the fruit of development.’ Thus he clearly comprehends this.</p> <p>“When it was said: ‘The perception of unattractiveness, bhikkhus, when developed and cultivated, is of great fruit and benefit, culminating in the deathless, having the deathless as its consummation,’ it is because of this that this was said.</p> <p>(2) “It was said: ‘The perception of death, bhikkhus, when developed and cultivated, is of great [48] fruit and benefit, culminating in the deathless, having the deathless as its consummation.’ For what reason was this said?</p> <p>“When a bhikkhu often dwells with a mind accustomed to the perception of death, his mind shrinks away from attachment to life, turns back from it, rolls away from it, and is not drawn toward it, and either equanimity or revulsion becomes settled in him. Just as a cock’s feather or a strip of sinew, thrown into a fire, shrinks away from it, turns back from it, rolls away from it, and is not drawn toward it, so it is in regard to attachment to life when a bhikkhu often dwells with a mind accustomed to the perception of death.</p> <p>“If, when a bhikkhu often dwells with a mind accustomed to the perception of death, his mind inclines to attachment to life, or if he does not turn away from it, he should understand: ‘I have not developed the perception of death; there is no distinction between my earlier condition and my present one; I have not attained the fruit of development.’ Thus he clearly comprehends this. But if, when he often dwells with a mind accustomed to the perception of death, his mind shrinks away from attachment to life … and either equanimity or revulsion becomes settled in him, he should understand: ‘I have developed the perception of death; there is a distinction between my earlier condition and my present one; I have attained the fruit of development.’ Thus he clearly comprehends this.</p> <p>“When it was said: ‘The perception of death, bhikkhus, when developed and cultivated, is of great [49] fruit and benefit, culminating in the deathless, having the deathless as its consummation,’ it is because of this that this was said.</p> <p>(3) “It was said: ‘The perception of the repulsiveness of food, bhikkhus, when developed and cultivated, is of great fruit and benefit, culminating in the deathless, having the deathless as its consummation.’ For what reason was this said?</p> <p>“When a bhikkhu often dwells with a mind accustomed to the perception of the repulsiveness of food, his mind shrinks away from craving for tastes, turns back from it, rolls away from it, and is not drawn toward it, and either equanimity or revulsion becomes settled in him. Just as a cock’s feather or a strip of sinew, thrown into a fire, shrinks away from it, turns back from it, rolls away from it, and is not drawn toward it, so it is in regard to craving for tastes when a bhikkhu often dwells with a mind accustomed to the perception of the repulsiveness of food.</p> <p>“If, when a bhikkhu often dwells with a mind accustomed to the perception of the repulsiveness of food, his mind inclines to craving for tastes, or if he does not turn away from them, he should understand: ‘I have not developed the perception of the repulsiveness of food; there is no distinction between my earlier condition and my present one; I have not attained the fruit of development.’ Thus he clearly comprehends this. But if, when he often dwells with a mind accustomed to the perception of the repulsiveness of food, his mind shrinks away from craving for tastes … and either equanimity or revulsion becomes settled in him, he should understand: ‘I have developed the perception of the repulsiveness of food; there is a distinction between my earlier condition and my present one; I have attained the fruit of development.’ Thus he clearly comprehends this. [50]</p> <p>“When it was said: ‘The perception of the repulsiveness of food, bhikkhus, when developed and cultivated, is of great fruit and benefit, culminating in the deathless, having the deathless as its consummation,’ it is because of this that this was said.</p> <p>(4) “It was said: ‘The perception of non-delight in the entire world, bhikkhus, when developed and cultivated, is of great fruit and benefit, culminating in the deathless, having the deathless as its consummation.’ For what reason was this said?</p> <p>“When a bhikkhu often dwells with a mind accustomed to the perception of non-delight in the entire world, his mind shrinks away from the world’s beautiful things, turns back from them, rolls away from them, and is not drawn toward them, and either equanimity or revulsion becomes settled in him. Just as a cock’s feather or a strip of sinew, thrown into a fire, shrinks away from it, turns back from it, rolls away from it, and is not drawn toward it, so it is in regard to the world’s beautiful things when a bhikkhu often dwells with a mind accustomed to the perception of non-delight in the entire world.</p> <p>“If, when a bhikkhu often dwells with a mind accustomed to the perception of non-delight in the entire world, his mind inclines to the world’s beautiful things, or if he does not turn away from them, he should understand: ‘I have not developed the perception of non-delight in the entire world; there is no distinction between my earlier condition and my present one; I have not attained the fruit of development.’ Thus he clearly comprehends this. But if, [51] when he often dwells with a mind accustomed to the perception of non-delight in the entire world, his mind shrinks away from the world’s beautiful things … and either equanimity or revulsion becomes settled in him, he should understand: ‘I have developed the perception of nondelight in the entire world; there is a distinction between my earlier condition and my present one; I have attained the fruit of development.’ Thus he clearly comprehends this.</p> <p>“When it was said: ‘The perception of non-delight in the entire world, bhikkhus, when developed and cultivated, is of great fruit and benefit, culminating in the deathless, having the deathless as its consummation,’ it is because of this that this was said.</p> <p>(5) “It was said: ‘The perception of impermanence, bhikkhus, when developed and cultivated, is of great fruit and benefit, culminating in the deathless, having the deathless as its consummation.’ For what reason was this said?</p> <p>“When a bhikkhu often dwells with a mind accustomed to the perception of impermanence, his mind shrinks away from gain, honor, and praise, turns back from them, rolls away from them, and is not drawn toward them, and either equanimity or revulsion becomes settled in him. Just as a cock’s feather or a strip of sinew, thrown into a fire, shrinks away from it, turns back from it, rolls away from it, and is not drawn toward it, so it is in regard to gain, honor, and praise when a bhikkhu often dwells with a mind accustomed to the perception of impermanence.</p> <p>“If, when a bhikkhu often dwells with a mind accustomed to the perception of impermanence, his mind inclines to gain, honor, and praise, or if he does not turn away from them, he should understand: ‘I have not developed the perception of impermanence; there is no distinction between my earlier condition and my present one; I have not attained the fruit of development.’ Thus he clearly comprehends this. But if, when he often dwells with a mind accustomed to the perception of impermanence, his mind shrinks away from gain, honor, and praise [52] … and either equanimity or revulsion becomes settled in him, he should understand: ‘I have developed the perception of impermanence; there is a distinction between my earlier condition and my present one; I have attained the fruit of development.’ Thus he clearly comprehends this.</p> <p>“When it was said: ‘The perception of impermanence, bhikkhus, when developed and cultivated, is of great fruit and benefit, culminating in the deathless, having the deathless as its consummation,’ it is because of this that this was said.</p> <p>(6) “It was said: ‘The perception of suffering in the impermanent, bhikkhus, when developed and cultivated, is of great fruit and benefit, culminating in the deathless, having the deathless as its consummation.’ For what reason was this said?</p> <p>“When a bhikkhu often dwells with a mind accustomed to the perception of suffering in the impermanent, a keen perception of danger becomes settled in him toward indolence, laziness, slackness, heedlessness, lack of effort, and unreflectiveness, just as toward a murderer with drawn sword.</p> <p>“If, when a bhikkhu often dwells with a mind accustomed to the perception of suffering in the impermanent, a keen perception of danger does not become settled in him toward indolence, laziness, slackness, heedlessness, lack of effort, and unreflectiveness, just as toward a murderer with drawn sword, he should understand: ‘I have not developed the perception of suffering in the impermanent; there is no distinction between my earlier condition and my present one; I have not attained the fruit of development.’ Thus he clearly comprehends this. But if, when he often dwells with a mind accustomed to the perception of suffering in the impermanent, a keen perception of danger becomes settled in him toward indolence, laziness, slackness, heedlessness, lack of effort, and unreflectiveness, just as toward a murderer with drawn sword, he should understand: ‘I have developed the perception of suffering in the impermanent; there is a distinction between my earlier condition and my present one; I have attained the fruit of development.’ Thus he clearly comprehends this.</p> <p>“When it was said: ‘The perception of suffering in the impermanent, bhikkhus, when developed and cultivated, is of great fruit [53] and benefit, culminating in the deathless, having the deathless as its consummation,’ it is because of this that this was said.</p> <p>(7) “It was said: ‘The perception of non-self in what is suffering, bhikkhus, when developed and cultivated, is of great fruit and benefit, culminating in the deathless, having the deathless as its consummation.’ For what reason was this said?</p> <p>“When a bhikkhu often dwells with a mind accustomed to the perception of non-self in what is suffering, his mind is devoid of I-making, mine-making, and conceit regarding this conscious body and all external objects; it has transcended discrimination and is peaceful and well liberated.<sup>1514</sup></p> <p>“If, when a bhikkhu often dwells with a mind accustomed to the perception of non-self in what is suffering, his mind is not devoid of I-making, mine-making, and conceit regarding this conscious body and all external objects, if it does not transcend discrimination and become peaceful and well liberated, he should understand: ‘I have not developed the perception of non-self in what is suffering; there is no distinction between my earlier condition and my present one; I have not attained the fruit of development.’ Thus he clearly comprehends this. But if, when he often dwells with a mind accustomed to the perception of non-self in what is suffering, his mind is devoid of I-making, mine-making, and conceit regarding this conscious body and all external objects, and if it has transcended discrimination and become peaceful and well liberated, he should understand: ‘I have developed the perception of non-self in what is suffering; there is a distinction between my earlier condition and my present one; I have attained the fruit of development.’ Thus he clearly comprehends this.</p> <p>“When it was said: ‘The perception of non-self in what is suffering, bhikkhus, when developed and cultivated, is of great fruit and benefit, culminating in the deathless, having the deathless as its consummation,’ it is because of this that this was said.</p> <p>“These seven perceptions, bhikkhus, when developed and cultivated, are of great fruit and benefit, culminating in the deathless, having the deathless as their consummation.” [54]</p>",
    "ZotRef": "Bodhi 2012a"
}

