{
    "Document" : "The Middle Length Discourses of the Buddha",
    "Author" : "Bhikkhu Ñāṇamoli & Bhikkhu Bodhi",
    "Section" : "Mūlapaṇṇāsa",
    "SubSection" : "MN 49",
    "Title" : "Note #513",
    "Quote": "<p>In the first edition, I retained Ñm’s own translation of these lines, which read:</p><blockquote><p>The consciousness that makes no showing,<br />Nor has to do with finiteness,<br />Not claiming being with respect to all.</p></blockquote><p>In retrospect, I find this rendering far from satisfactory and thus here offer my own. These lines (which also appear as part of a full verse at DN 11.85/i.223) have been a perennial challenge to Buddhist scholarship, and even Ācariya Buddhaghosa seems to founder over them. MA takes the subject of the sentence to be Nibbāna, called “consciousness” (<em>viññāṇṁ</em>) in the sense that “it can be cognized” (<em>vijānitabbaṁ</em>). This derivation is hardly credible, since nowhere in the Nikāyas is Nibbbāna described as consciousness, nor is it possible to derive an active noun from the gerundive. MA explains <em>anidassanaṁ</em> as meaning invisible, “because it (Nibbāna) does not come within range of eye-consciousness,” but again this is a trite explanation. The word <em>anidassana </em>occurs at MN 21.14 in the description of empty space as an unsuitable medium for painting pictures; thus the idea seems to be that of not making manifest.</p><p>MA offers three explanations of <em>sabbato pabhaṁ</em>: (1) completely possessed of luminosity (<em>pabhā</em>); (2) possessing being (<em>pabhū̇taṁ</em>) everywhere; and (3) a ford (<em>pabhaṁ</em>) accessible from all sides, i.e., through any of the thirty-eight meditation objects. Only the first of these seems to have any linguistic legitimacy. Ñm, in Ms, explains that he takes pabhaṁ to be a negative present participle of <em>pabhavati</em>—<em>apabhaṁ</em>—the negative-prefix a dropping off in conjunction with <em>sabbato</em>: “The sense can be paraphrased freely by ‘not predicating being in relation to “all,”’ or ‘not assuming of “all” that it is or is not in an absolute sense.’” But if we take <em>pabhaṁ </em>as “luminous,” which seems better justified, the verse links up with the idea of the mind as intrinsically luminous (<em>pabhassaraṁ idaṁ cittaṁ</em> , AN i.10) and also suggests the light of wisdom (<em>pa</em>), called the best of lights (AN ii.139). I understand this consciousness to be, not Nibbāna itself, but the arahant’s consciousness during the meditative experience of Nibbbāna. See in this connection AN v.7–10, 318–26. Note that this meditative experience does not make manifest any conditioned phenomena of the world, and thus may be truly described as “non-manifesting.”</p>",
    "ZotRef" : "Bodhi 1995a"
}

