{
    "Document" : "The Connected Discourses of the Buddha",
    "Author" : "Bhikkhu Bodhi",
    "Section" : "Devatāsaṁyutta",
    "SubSection" : "sn 1.20",
    "Title" : "Note #38",
    "Quote": "<p>The most common reading of this pāda is <em>pahāsi saṅkhaṃ na vimānam ajjhagā</em>, found in Be, Se, and Ee1 of <strong>v. 49</strong>, in Be and Ee1 of the parallel <strong>v. 105</strong>, and in the lemma in Spk (Be, Se) to <strong>v. 49</strong>. From his comments it is clear the commentator had a text with <em>vimāna</em>, which he explains as equivalent to <em>vividhamāna</em>: “He does not assume the threefold conceit with its nine divisions” (<em>navabhedaṃ tividhamānaṃ na upagato</em>). Spk’s alternative explanation, which takes <em>vimānaṃ</em> to be the mother’s womb, the destination of the rebirth process, seems too fanciful to be taken seriously. <em>Vimānadassī</em> occurs at Sn 887b in the sense of “contemptuous,” but this meaning of <em>vimāna</em> may be too narrow for the present context.</p><p>The verse may have originally read <em>na ca mānam</em> and this reading may have already been corrupted before the age of the commentaries, <em>c/v</em> confusion being not uncommon in Sinhala-script texts. The corruption would then have been preserved and perpetuated by the commentators. Despite the dominance of <em>na vimānam</em>, the reading <em>na ca mānam</em> is found in <strong>v. 105</strong> of Se, in the lemma to <strong>v. 49</strong> in four Sinhala mss of Spk (referred to in the notes to Spk (Se)), and in Thai eds. of SN and Spk. The Skt counterpart (quoted at Ybhūś 2:4; Enomoto, CSCS, p. 23) has <em>prahāya mānaṃ ca na saṅgam eti</em>, which corresponds more closely to the alternative reading of the Pāli. The original finite verb</p><p>may have been the rare reduplicative perfect <em>ājā</em> (as in SS) or <em>āgā</em> (as in Ee2 and Thai eds.). See von Hinüber, “On the Perfect in Pāli,” <em>Selected Papers</em>, pp. 174-76.</p><p>Spk understands <em>pahāsi saṅkhaṃ</em> to mean that the arahant can no longer be described by such concepts as lustful, hating, or deluded, but the point is more likely to be that he has stopped forming <em>papañcasaññāsaṅkhā</em>, “ideas and notions arisen from mental proliferation” (see MN I 112,2-3). The Skt reading <em>saṅgam</em> may actually make better sense in this context. It seems that this phrase refers back to <strong>v. 47</strong> and <em>na vimānam ajjhagā</em> back to <strong>v. 48</strong>. It is possible, too, that the lines describe the arahant after his parinibbāna, when he can no longer be reckoned by way of the five aggregates (see <strong>44:1</strong>). Pādas cf seem to be describing the arahant after his parinibbāna, though elsewhere he is also said to be unfindable here and now (e.g., at <strong>22:86</strong>; III 118,35-36).</p>",
    "ZotRef" : "Bodhi 2000a"
}