{
    "Document" : "The Connected Discourses of the Buddha",
    "Author" : "Bhikkhu Bodhi",
    "Section" : "Nidānasaṁyutta",
    "SubSection" : "sn 12.19",
    "Title" : "Note #48",
    "Quote": "<p>Spk: <em>This body has thereby originated</em> (<em>evam ayaṃ kāyo samudāgato</em>): This body has been produced thus because he has been hindered by ignorance and fettered by craving. <em>So there is this body</em>: one’s own conscious body. <em>And external name-and-form</em> (<em>bahiddhā ca nāmarūpaṃ</em>): the conscious body of others externally. The meaning should be explained in terms of the five aggregates and six sense bases of oneself and others. This interpretation of <em>bahiddhā nāmarūpa</em> seems dubious. We may have here, rather, a rare example of the term <em>nāmarūpa</em> being employed to represent the entire field of experience available to consciousness, “external name” being the concepts used to designate the objects cognized. See the common expression <em>imasmiṃ saviññāṇake kāye bahiddhā ca sabbanimittesu</em>, “in regard to this conscious body and all external signs,” at <strong>18:21</strong>, <strong>22</strong>; <strong>22:71</strong>, <strong>72</strong>, etc., and explained below in <strong>n. 340</strong>. Spk interprets <em>this dyad</em> (<em>etaṃ dvayaṃ</em>) as the internal and external sense bases, which it calls “the great dyad” (<em>mahādvaya</em>). However, while the sense bases are usually shown to be the condition for contact (e.g., at <strong>12:43</strong>, <strong>44</strong>) and are also called a dyad (e.g., at <strong>35:92</strong>, <strong>93</strong>), it seems that here the text intends the term dyad to denote one’s own conscious body and “external name-and-form.” The six sense bases are introduced only in the next sentence, after contact has already been said to arise from a duality. At DN II 62,12-37 too the Buddha demonstrates that name-and-form can be a direct condition for contact without mention of the six sense bases.</p>",
    "ZotRef" : "Bodhi 2000a"
}