{
    "Document" : "The Connected Discourses of the Buddha",
    "Author" : "Bhikkhu Bodhi",
    "Section" : "Devaputtasaṁyutta",
    "SubSection" : "sn 2.26",
    "Title" : "Note #182",
    "Quote": "<p>Spk glosses <em>loka</em> with <em>dukkhasacca</em> and each of the other terms by way of the other three noble truths. Thus the Buddha shows: “I do not make known these four truths in external things like grass and wood, but right here in this body composed of the four great elements.”</p><p>This pithy utterance of the Buddha, which may well be the most profound proposition in the history of human thought, is elucidated at <strong>35:116</strong> by the Venerable Ānanda, who explains that in the Noble One’s Discipline “the world” is “that in the world by which one is a perceiver and conceiver of the world,” i.e., the six sense bases. From Ānanda’s explanation we can draw out the following implications: The world with which the Buddha’s teaching is principally concerned is “the world of experience,” and even the objective world is of interest only to the extent that it serves as the necessary external condition for experience. The world is identified with the six sense bases because the latter are the necessary internal condition for experience and thus for the presence of a world. As long as the six sense bases persist, a world will always be spread out before us as the objective range of perception and cognition. Thus one cannot reach the end of the world by travelling, for wherever one goes one inevitably brings along the six sense bases, which necessarily disclose a world extended on all sides. Nevertheless, by reversing the direction of the search it is possible to reach the end of the world. For if the world ultimately stems from the six sense bases, then by bringing an end to the sense bases it is possible to arrive at the end of the world.</p><p>Now the six sense bases are themselves conditioned, having arisen from a chain of conditions rooted in one’s own ignorance and craving (see <strong>12:44</strong> = <strong>35:107</strong>). Thus by removing ignorance and craving the re-arising of the six sense bases can be prevented, and therewith the manifestation of the world is terminated. This end of the world cannot be reached by travelling, but it can be arrived at by cultivating the Noble Eightfold Path. Perfect development of the path brings about the eradication of ignorance and craving, and with their removal the underlying ground is removed for the renewed emergence of the six senses, and therewith for the reappearance of a world. For a long philosophical commentary on this sutta by Ñāṇananda, see SN-Anth 2:70-85.</p>",
    "ZotRef" : "Bodhi 2000a"
}