{
    "Document" : "The Connected Discourses of the Buddha",
    "Author" : "Bhikkhu Bodhi",
    "Section" : "Khandhasaṁyutta",
    "SubSection" : "sn 22.79",
    "Title" : "Note #114",
    "Quote": "<p>The eight flavours are: <em>ambila</em>, <em>tittaka</em>, <em>kaṭuka</em>, <em>madhuka</em>, <em>khārika</em>, <em>akhārika</em>, <em>loṇaka</em>, <em>aloṇaka</em>; see too <strong>47:8</strong>. The explanation of <em>viññāṇa</em> here is very similar to that of <em>saññā</em>, the difference being only in the type of sense object they cognize. Spk explains that the difference in object highlights a difference in their cognitive functions: “Perception is analysed by way of the eye door because it is evident in grasping the appearance and shape of the object; consciousness is analysed by way of the tongue door because it can grasp particular distinctions in an object even when there is no appearance and shape.” Spk continues with an explanation (also found at Vism 437; Ppn 14:3-5) according to which <em>saññā</em>, <em>viññāṇa</em>, and <em>paññā</em> are cognitive functions of increasing depth, discriminative acumen, and power of comprehension; this, however, is difficult to reconcile with the account of these factors found in the Nikāyas. Usually in the suttas <em>viññāṇa</em> is presented simply as the basic awareness of an object through one of the sense bases, i.e., as bare “consciousness of” rather than as a discriminative capacity. A parallel treatment of <em>viññāṇa</em> at MN I 292,26-29 defines it through its ability to cognize the three types of feelings (pleasant, painful, neutral); this just shifts the problem to that of distinguishing between <em>viññāṇa</em> and <em>vedanā</em>. Hamilton discusses the problem posed by these passages (<em>Identity and Experience</em>, pp. 53-55, 92-93). She offers the helpful suggestion that although <em>viññāṇa</em> is here defined in a way that encroaches upon the domain of <em>saññā</em>, we should understand that <em>saññā</em> does the actual discrimination (of objects at all five senses) while <em>viññāṇa</em> “is the awareness by which we experience every stage of the cognitive process, including the process of discriminating” (p. 92). From the commentarial standpoint, <em>saññā</em> is discussed more fully at As 110- 11 and <em>viññāṇa</em> (under the name <em>citta</em>) at As 63-64.</p>",
    "ZotRef" : "Bodhi 2000a"
}