{
    "Document" : "The Connected Discourses of the Buddha",
    "Author" : "Bhikkhu Bodhi",
    "Section" : "III. The Book of Aggregates (Khandhavagga)",
    "SubSection" : "Introduction",
    "Title" : "22. Khandhasaṁyutta",
    "Quote": "<p><span class='quotepno'>839</span>The Khandhasaṃyutta contains 159 suttas arranged into three divisions called <em>paññāsakas</em>, “sets of fifty.” Each <em>paññāsaka</em> is made up of five vaggas consisting of approximately ten suttas each, though several vaggas have slightly more than ten. The length and character of the suttas vary widely, ranging from texts several pages long with a unique flavour of their own to extremely terse suttas that merely instantiate a common template.</p><p>The topic of this saṃyutta is the five aggregates (<em>pañcakkhandha</em> ), the primary scheme of categories the Buddha draws upon to analyse sentient existence. Whereas the teaching on dependent origination is intended to disclose the dynamic pattern running <span class='quotepno'>840</span>through everyday experience that propels the round of birth and death forward from life to life, the teaching on the five aggregates concentrates on experience in its lived immediacy in the continuum from birth to death.</p><p>Examination of the five aggregates plays a critical role in the Buddha’s teaching for at least four reasons. First, because the five aggregates are the ultimate referent of the first noble truth, the noble truth of suffering (see <strong>56:13</strong>), and since all four truths revolve around suffering, understanding the aggregates is essential for understanding the Four Noble Truths as a whole. Second, because the five aggregates are the objective domain of clinging and as such contribute to the causal origination of future suffering. Third, because the removal of clinging is necessary for the attainment of release, and clinging must be removed from the objects around which its tentacles are wrapped, namely, the five aggregates. And fourth, because the removal of clinging is achieved by wisdom, and the kind of wisdom needed is precisely clear insight into the real nature of the aggregates.</p><p>The five aggregates are at once the constituents of sentient existence and the operative factors of lived experience, for within the thought world of the Nikāyas existence is of concern only to the extent that it is implicated in experience. Thus the five aggregates simultaneously serve the Buddha as a scheme of categories for analysing human identity and for explicating the structure of experience. However, the analysis into the aggregates undertaken in the Nikāyas is not pursued with the aim of reaching an objective, scientific understanding of the human being along the lines pursued by physiology and psychology; thus comparisons of the Buddhist analysis with those advanced by modern scientific disciplines can easily lead to spurious conclusions. For the Buddha, investigation into the nature of personal existence always remains subordinate to the liberative thrust of the Dhamma, and for this reason only those aspects of human existence that contribute to the realization of this purpose receive the spotlight of his attention.</p><p>The word <em>khandha</em> (Skt <em>skandha</em>) means, among other things, a heap or mass (<em>rāsi</em>). The five aggregates are so called because they each unite under one label a multiplicity of phenomena that share the same defining characteristic. Thus whatever form there is, “past, future, or present, internal or external, gross or subtle, <span class='quotepno'>841</span>inferior or superior, far or near,” is incorporated into the form aggregate, and so for each of the other aggregates (<strong>22:48</strong>). Two suttas in the Khandhasaṃyutta (<strong>22:56</strong>, <strong>57</strong>) spell out the constituents of each aggregate, doing so in much simpler terms than the later, more elaborate analyses found in the <em>Visuddhimagga</em> and the commentaries. The breakdown of the aggregates according to the suttas is shown in Table 5. Another sutta (<strong>22:79</strong>) explains why each aggregate is called by its assigned name, and it is revealing that these explanations are phrased in terms of functions rather than fixed essences. This treatment of the aggregates as dynamic functions rather than substantial entities already pulls the ground away from the urge to grasp upon them as containing a permanent essence that can be considered the ultimate ground of being.</p><div class='tablewrap'><table><thead><tr><th>Aggregate</th><th>Contents</th><th>Condition</th></tr></thead><tbody><tr><td>form</td><td>4 great elements and form derived from them</td><td>nutriment</td></tr><tr><td>feeling</td><td>6 classes of feeling: feeling born of contact through eye, ear, nose,tongue, body, and mind</td><td>contact</td></tr><tr><td>perception</td><td>6 classes of perception: perception of forms, sounds, odours, tastes, tactiles, and mental phenomena</td><td>contact</td></tr><tr><td>volitional formations</td><td>6 classes of volition: volition regarding forms, sounds, odours, tastes, tactiles, and mental phenomena</td><td>contact</td></tr><tr><td>consciousness</td><td>6 classes of consciousness: eye-consciousness, ear-, nose-, tongue-, body-, and mind-consciousness</td><td>name-and-form</td></tr></tbody><caption>TABLE 5: The Five Aggregates according to the Suttas (based on SN 22:56 and 57)</caption></table></div><p><span class='quotepno'>842</span>The Khandhasaṃyutta stresses in various ways that the five aggregates are <em>dukkha</em>, suffering, a point clearly articulated by the Buddha already in his first sermon when he states, “In brief, the five aggregates subject to clinging are suffering” (<strong>56:11</strong>). The aggregates are suffering because they tend to affliction and cannot be made to conform with our desires (<strong>22:59</strong>); because attachment to them leads to sorrow, lamentation, pain, displeasure, and despair (<strong>22:1</strong>); because their change induces fear, distress, and anxiety (<strong>22:7</strong>). Even more pointedly, the five aggregates are already suffering simply because they are impermanent (<strong>22:15</strong>) and thus can never fulfil our hopes for perfect happiness and security. While they give pleasure and joy, which is the gratification (<em>assāda</em>) in them, eventually they must change and pass away, and this instability is the danger (<em>ādīnava</em>) perpetually concealed within them (<strong>22:26</strong>). Though we habitually assume that we are in control of the aggregates, in truth they are perpetually devouring <em>us</em>, making us their hapless victims (<strong>22:79</strong>). To identify with the aggregates and seek fulfilment in them is to be like a man who employs as his servant a vicious murderer out to take his life (<strong>22:85</strong>).</p><p>The five aggregates are the objective domain of the defilements that bind living beings to the round of existence, particularly the taints (<em>āsava</em>) and clinging (<em>upādāna</em>). Whatever in the world one might cling to, it is only form, feeling, perception, volitional formations, and consciousness that one clings to (<strong>22:79</strong>). For this reason the aggregates that make up our mundane experience are commonly called the five aggregates subject to clinging (<em>pañcupādānakkhandha</em>). Clinging, it will be recalled, is one of the links in the chain of dependent origination, the link that leads into the production of a new existence in the future. In <strong>22:5</strong>, the five aggregates are spliced into the second half of the formula for dependent origination, thereby revealing how clinging to the five aggregates in this existence brings forth a new birth and thus the reappearance of the five aggregates in the next existence. Sutta <strong>22:54 </strong>states that because of attachment to the five aggregates, consciousness grows and thrives from life to life; but with the destruction of lust, consciousness becomes unsupported and is then peaceful and liberated. This sutta assigns to consciousness a special place among the five aggregates, since consciousness stands supported by the other aggregates and passes away and <span class='quotepno'>843</span>undergoes rebirth in dependence on them. This dictum accords with the suttas on dependent origination (such as <strong>12:12</strong>, <strong>38</strong>, and <strong>64</strong>) that treat consciousness as the channel or vehicle of the rebirth process.</p><p>Clinging to the five aggregates occurs in two principal modes, which we might call appropriation and identification. In clinging to the aggregates, one either grasps them with desire and lust (<em>chandarāga</em>) and assumes possession of them, or one identifies with them, taking them as the basis for conceit or for views about one’s real self. In a phrase often met with in the Khandhasaṃyutta, we are prone to think of the aggregates, “This is mine, this I am, this is my self” (<em>etaṃ mama, eso ’ham asmi, eso me attā</em>). Here, the notion “This is mine” represents the act of appropriation, a function of craving (<em>taṇhā</em>). The notions “This I am” and “This is my self” represent two types of identification, the former expressive of conceit (<em>māna</em>), the latter of views (<em>diṭṭhi</em>).</p><p>To break our appropriation of the aggregates, the Buddha often enjoins us to abandon desire and lust for them (<strong>22:137-45</strong>). Sometimes he tells us to abandon the aggregates themselves, for they are as completely alien to us as the twigs and foliage in Jeta’s Grove (<strong>22:33-34</strong>). But to give up clinging is difficult because clinging is reinforced by views, which rationalize our identification with the aggregates and thus equip clinging with a protective shield.</p><p>The type of view that lies at the bottom of all affirmation of selfhood is called identity view (<em>sakkāyadiṭṭhi</em>). All views of self are formulated with reference to the five aggregates either collectively or individually (<strong>22:47</strong>). The suttas often mention twenty types of identity view, obtained by considering one’s self to stand in any of four relations to each of the five aggregates: either as identical with it, as possessing it, as containing it, or as contained within it (<strong>22:1</strong>, <strong>7</strong>, <strong>47</strong>, <strong>81</strong>, <strong>82</strong>, etc.). The Buddha describes identity view as the leash that keeps the worldling bound to the round of rebirths, revolving in circles like a dog going around a post (<strong>22:99</strong>, <strong>117</strong>). He also makes identity view the first of the ten fetters to be eradicated on the path to liberation. The most common way the suttas distinguish between “the uninstructed worldling” (<em>assutavā puthujjana</em>) and “the instructed noble disciple” (<em>sutavā ariyasāvaka</em>) is precisely by way of identity view: the worldling perpetually regards the aggregates as a self or a self’s accessories; <span class='quotepno'>844</span>the noble disciple never does so, for such a disciple has seen with wisdom the selfless nature of the aggregates (<strong>22:1</strong>, etc.).</p><p>As the formula for dependent origination demonstrates, clinging to the five aggregates is ultimately sustained by ignorance (<em>avijjā</em>). In relation to the aggregates, ignorance weaves a net of three delusions that nurture desire and lust. These delusions, which infiltrate cognition at a variety of levels, are the notions that the five aggregates are permanent, a true source of happiness, and a self or the accessories of a self. The antidote needed to break the spell of this delusion is wisdom (<em>paññā</em>) or knowledge (<em>vijjā</em>), which means knowing and seeing the five aggregates as they really are: as impermanent (<em>anicca</em>), as suffering (<em>dukkha</em>), and as nonself (<em>anattā</em>). These are known in the Buddhist tradition as the three characteristics (<em>tilakkhaṇa</em>), and in the Khandhasaṃyutta they are extensively applied to the five aggregates in a variety of patterns. The suttas devoted to this theme can be highly repetitive, but the repetition is designed to serve a vital purpose: to strip away the delusions of permanence, pleasure, and selfhood that envelop the five aggregates and keep us trapped in the chain of dependent origination.</p><p>Perhaps the original nucleus of the Khandhasaṃyutta consisted of the template suttas at <strong>22:9-20</strong>, along with the auxiliary template suttas prevalent in The Final Fifty. These suttas were never intended to be read merely to gather information, but to offer concise instructions on the development of insight (<em>vipassanābhāvanā</em> ). Behind the repetitive utterances, occasionally irksome on first acquaintance, the attentive eye can discern subtle variations attuned to the diversity in the proclivities and intellectual capacities of the people to be guided. Some suttas seem to make the contemplation of one or another of the three characteristics alone sufficient for reaching the goal, though the exegetical texts insist that all must be contemplated to some degree. As the three characteristics are closely intertwined, the most common formula throughout the Nikāyas is the one that discloses their internal relationship. This formula, first enunciated in the Buddha’s second discourse at Bārāṇasī (<strong>22:59</strong>), uses the characteristic of impermanence to reveal the characteristic of suffering, and both conjointly to reveal the characteristic of nonself. But whatever approach is taken, all the different expositions of the three characteristics eventually converge on the eradication of clinging by <span class='quotepno'>845</span>showing, with regard to each aggregate, “This is not mine, this I am not, this is not my self.” The lesson this maxim teaches is that there is no point in appropriating anything, no point in identifying with anything, because the subject of appropriation and identification, the “self,” is merely a fabrication of conceptual thought woven in the darkness of ignorance.</p><p>Different suttas within the Khandhasaṃyutta speak of the three characteristics under various</p><p>synonyms, and to navigate one’s way through this chapter it is important to recognize which characteristic is being indicated. Thus the statement that the five aggregates are “impermanent, conditioned, dependently arisen, subject to destruction, to vanishing, to fading away, to cessation” (<strong>22:21</strong>) is obviously using different terms to point out the characteristic of impermanence. Less obviously, the sutta on the fragile (<strong>22:32</strong>) and the two on arising, vanishing, and alteration (<strong>22:37</strong>, <strong>38</strong>) are doing the same thing. The suttas that speak of knowing the aggregates as subject to arising and vanishing are also commending contemplation of impermanence (<strong>22:126-28</strong>). Such suttas as the one on the burden (<strong>22:22</strong>), on misery (<strong>22:31</strong>), and on being devoured (<strong>22:79</strong>), emphasize the contemplation of suffering. Among the many suttas that directly expound nonself, one that deserves special attention is the discourse on the lump of foam (<strong>22:95</strong>), with its striking similes for the empty, insubstantial nature of the aggregates.</p><p>Besides the three characteristics, the Khandhasaṃyutta makes use of other patterns as guidelines for contemplation and understanding. The “gratification triad” is often applied to the aggregates (<strong>22:26</strong>, <strong>107</strong>, <strong>130</strong>), sometimes expanded into a pentad by the addition of “origin and passing away” (<strong>22:108</strong>, <strong>132</strong>). Another is the four-truth pattern: understanding each aggregate, its origin, its cessation, and the way to its cessation (<strong>22:56</strong>, <strong>114</strong>). A sevenfold hybrid is obtained by merging the four-truth pattern with the gratification triad (<strong>22:57</strong>). In two suttas (<strong>22:122</strong>, <strong>123</strong>) the Venerable Sāriputta recommends a scheme of eleven ways of attending to the aggregates, obtained by differentiating various aspects of the three characteristics. This method of contemplation, he says, leads all the way from the first steps on the path of meditation to the final stage of arahantship and can even be recommended to the arahant.</p><p>According to a stock formula attached to most of the suttas on <span class='quotepno'>846</span>the three characteristics, the insight into the five aggregates as impermanent, suffering, and nonself induces revulsion (<em>nibbidā</em>), dispassion (<em>virāga</em>), and liberation (<em>vimutti</em>). Revulsion is explained by the commentaries as a profound inward turning away from conditioned existence that comes with the higher stages of insight. Dispassion is the supramundane path, particularly the path of arahantship, which eliminates the last traces of craving. Dispassion culminates in liberation, the release of the mind from clinging and the taints, and liberation is in turn ascertained by the subsequent “knowledge and vision of liberation,” a reviewing knowledge that gives the assurance that the round of rebirths has been stopped and nothing further remains to be done.</p><p>The Khandhasaṃyutta shows that the elimination of clinging occurs in two distinct stages. The first is the elimination of the conceptual types of clinging expressed by wrong views, above all by identity view. This stage of release comes with the breakthrough to the Dhamma, the attainment of stream- entry. At this point the disciple sees the selfless nature of the aggregates and thus overcomes all views of self. For this reason the defining mark of the “instructed noble disciple,” the one who has made the breakthrough, is the elimination of every kind of identity view. However, disciples in training (<em>sekha</em>), even those at the penultimate stage of nonreturner, still retain a subtle notion of “I am” that continues to linger over the five aggregates like the scent of soap over newly washed clothes. This is spoken of as “a residual conceit ‘I am,’ a desire ‘I am,’ an underlying tendency ‘I am’” (<strong>22:89</strong>). However, as the noble disciple continues to contemplate the rise and fall of the aggregates, in time even this residual notion of “I am” disappears. It is only the arahant who has fully understood the five aggregates down to the root and thus eradicated the subtlest tendencies to self-affirmation.</p><p>Elsewhere in the Khandhasaṃyutta the distinction between the trainee and the arahant is drawn in other terms, based on the same principle but differently expressed. Sutta <strong>22:56</strong> explains that trainees have directly known the five aggregates by way of the four-truth pattern and are practising for their fading away and cessation; thereby they “have gained a foothold in this Dhamma and Discipline.” Arahants have also directly known the five aggregates by way of the four-truth pattern, but they have extirpated all attachment to the aggregates and are liberated by <span class='quotepno'>847</span>nonclinging; thus they are called consummate ones for whom “there is no round for describing them” (see too <strong>22:57</strong>, which expands the sphere of direct knowledge into a sevenfold pattern). While direct knowledge (<em>abhiññā</em>) of the aggregates is ascribed to both trainees and arahants, only arahants are said to have full understanding (<em>pariññā</em>) of the aggregates, for full understanding implies the destruction of lust, hatred, and delusion (<strong>22:106</strong>; see too <strong>22:23</strong>). At <strong>22:79</strong> the trainee is described as one who is abandoning the five aggregates and does not cling to them. The arahant, in contrast, is one who neither abandons nor clings, but “abides having abandoned.” And at <strong>22:109-10</strong>, the stream-enterer is defined as one who understands the five aggregates by way of their origin, passing away, gratification, danger, and escape, while the arahant is one who, having understood the aggregates thus, is liberated by nonclinging. Thus these passages indicate the essential difference between the trainee and the arahant to consist in the extent to which they have developed liberating knowledge. The trainee has arrived at this knowledge and thereby eliminated the conceptually explicit types of ignorance crystallized in wrong views, but he has not yet fully utilized it to eradicate the emotively tinged types of ignorance manifest as clinging. The arahant has mastered this knowledge and fully developed it, so that in his mind all the defilements along with the subtlest shades of ignorance have been abolished. The trainee might be compared to a person walking along a mountain path who catches a distant glimpse of a splendid city but must still walk across several more mountains to reach his destination. The arahant is like one who has arrived at the city and now dwells comfortably within its bounds.</p><p>Beneath its repetitiveness and copious use of template formulas, the Khandhasaṃyutta is a rich compilation of texts, and no brief introduction can do justice to all its suggestive themes. Special mention, however, might be made of the Theravagga, the fourth vagga, on the elder monks. Here we find Ānanda’s first-hand account of his breakthrough to the Dhamma while listening to a discourse on the aggregates (<strong>22:83</strong>); Sāriputta’s refutation of the annihilationist interpretation of Nibbāna (<strong>22:85</strong>); Anurādha’s puzzlement about the Tathāgata’s status after death (<strong>22:86</strong>); the story of Vakkali, who attained final Nibbāna while dying at his own hand (<strong>22:87</strong>); the Khemaka Sutta, on the distinction between <span class='quotepno'>848</span>the trainee and the arahant (<strong>22:89</strong>); and the story of the refractory monk Channa whose change of heart proved abundantly fruitful (<strong>22:90</strong>).</p>"
}