{
    "Document" : "The Connected Discourses of the Buddha",
    "Author" : "Bhikkhu Bodhi",
    "Section" : "General Introduction",
    "SubSection" : "",
    "Title" : "The Saṃyutta Nikāya And The Saṃyuktāgama",
    "Quote": "<p><span class='quotepno'>28</span>The Pāli commentaries, and even the canonical Cullavagga, give an account of the First Buddhist Council which conveys the impression that the participating elders arranged the Sutta Piṭaka into essentially the form in which it has come down to us today, even with respect to the precise sequence of texts. This is extremely improbable, and it is also unlikely that the council</p><p><span class='quotepno'>29</span>Table 2—Thematic Analysis of the Saṃyutta Nikāya</p><p><img src='../_resources/sesame-data/bodhi-nikaya-notes/SN-Images/SN_Table2.webp'></p><p>established a fixed and final recension of the Nikāyas. The evidence to the contrary is just too massive. This evidence includes the presence in the canon of suttas that could only have appeared after the First Council (e.g., MN Nos. 84, 108, 124); signs of extensive editing internal to the suttas themselves; and, a weighty factor, the differences in content and organization <span class='quotepno'>30</span>between the Pāli Nikāyas and the North Indian Āgamas preserved in the Chinese Tripiṭaka. It is much more likely that what took place at the First Council was the drafting of a comprehensive scheme for classifying the suttas (preserved only in the memory banks of the monks) and the appointment of an editorial committee (perhaps several) to review the material available and cast it into a format conducive to easy memorization and oral transmission. Possibly too the editorial committee, in compiling an authorized corpus of texts, would have closely considered the purposes their collections were intended to serve and then framed their guidelines for classification in ways designed to fulfil these purposes. This is a point I will return to below. The distribution of the texts among groups of reciters (<em>bhāṇakas</em>), charged with the task of preserving and transmitting them to posterity, would help to explain the divergences between the different recensions as well as the occurrence of the same suttas in different Nikāyas.</p><p>Comparison of the Pāli SN with the Chinese Saṃyuktāgama is particularly instructive and reveals a remarkable correspondence of contents arranged in a different order. I already alluded just above to some differences in organization, but it is illuminating to examine this in more detail. The Chinese version contains nine major Vaggas (following Anesaki, I use the Pāli terms and titles for consistency). The first is the Khandhavagga (our III), the second the Saḷāyatanavagga (our IV), the third the Nidānavagga (our II), which latter also contains the Saccasaṃyutta (56) and the Vedanāsaṃyutta (36), departing markedly from SN in these allocations. Then follows a fourth part named Sāvakavagga, without a counterpart in the Pāli version but which includes among others the Sāriputta- (28), Moggallāna- (40), Lakkhaṇa- (19), Anuruddha- (52), and Cittasaṃyuttas (41). The fifth part, whose Pāli title would be Maggavagga, corresponds to SN Mahāvagga (our V), but its saṃyuttas are arranged in a sequence that follows more closely the canonical order of the sets making up the thirty-seven aids to enlightenment: Satipaṭṭhāna (47), Indriya (48), Bala (50), Bojjhaṅga (46), and Magga (45); this part also includes the Ānāpānasati- (54) and Sotāpattisaṃyuttas (55), while a series of small chapters at the end includes a Jhānasaṃyutta (53) and an Asaṅkhatasaṃyutta (43). The sixth Vagga of the Saṃyuktāgama is without a Pāli <span class='quotepno'>31</span>parallel but contains the Opammasaṃyutta (20) and a collection of suttas on sick persons which draws together texts distributed among various chapters of SN. Then, as the seventh book, comes the Sagāthāvagga (our I), with twelve saṃyuttas—all eleven of the Pāli version but in a different order and with the addition of the Bhikkhusaṃyutta (21), which in this recension must contain only suttas with verses. Finally comes a Buddha-or Tathāgatavagga, which includes the Kassapa- (16)and Gāmanisaṃyuttas (42), and an Assasaṃyutta, “Connected Discourses on Horses.” This last chapter includes suttas that in the Pāli Canon are found in the Aṅguttara Nikāya.</p>",
    "ZotRef" : "Bodhi 2000a"
}

