{
    "Document" : "The Connected Discourses of the Buddha",
    "Author" : "Bhikkhu Bodhi",
    "Section" : "General Introduction",
    "SubSection" : "",
    "Title" : "The Groundplan of the Saṃyutta Nikāya",
    "Quote": "<p><span class='quotepno'>22</span>Despite the immense dimensions of the work, the plan according to which it is constructed is fairly simple and straightforward. The Saṃyutta Nikāya that has come down in the Pāli tradition consists of five major <em>Vaggas</em>, parts or “books,” each of which corresponds to a single volume in the Pali Text Society’s roman-script edition of the work. Between them, these five volumes contain fifty-six <em>saṃyuttas</em>, chapters based on unifying themes.<sup>1</sup> The longer saṃyuttas are in turn divided into subchapters, also called <em>vaggas</em>, while the smaller saṃyuttas can be considered to consist of a single vagga identical with the saṃyutta itself. Each vagga, in this sense, ideally contains ten suttas, though in actuality the number of suttas in a vagga can range from as few as five to as many as sixty. Thus we find the word <em>vagga</em>, literally “a group,” used to designate both the five major parts of the entire collection and the subordinate sections of the chapters.<sup>2</sup></p><p>The two largest saṃyuttas, the Khandhasaṃyutta (22) and the Saḷāyatanasaṃyutta (35), are so massive that they employ still another unit of division to simplify organization. This is the <em>paññāsaka </em>or “set of fifty.” This figure is only an approximation, since the sets usually contain slightly more than fifty suttas; indeed, the Fourth Fifty of the Saḷāyatanasaṃyutta contains ninety-three suttas, among them a vagga of sixty! Most of these suttas, however, are extremely short, being merely variations on a few simple themes.</p><p><span class='quotepno'>23</span>Unlike the suttas of the first two Nikāyas, the Dīgha and the Majjhima, the suttas of SN do not have proper names unanimously agreed upon by all the textual traditions. In the old ola leaf manuscripts the suttas follow one another without a clean break, and the divisions between suttas have to be determined by certain symbolic markings. Each vagga ends with a short mnemonic verse called the <em>uddāna</em>, which sums up the contents of the vagga by means of key words representing its component suttas. In modern printed editions of SN these key words are taken to be the titles of the suttas and are placed at their head. As the <em>uddānas</em> often differ slightly between the Sinhalese and the Burmese textual traditions, with the PTS edition following now one and now the other, the names of the suttas also differ slightly between the several editions. Moreover, the most recent Burmese edition, that prepared at the Sixth Buddhist Council, sometimes assigns the suttas titles that are fuller and more meaningful than those derivable from the mnemonic verses. In this translation I have generally followed the Burmese edition.</p><p>The titles of the vaggas also occasionally differ between the traditions. Whereas the Burmese- script edition often names them simply by way of their numerical position—e.g., as “The First Subchapter” (<em>paṭhamo vaggo</em>), etc.—the Sinhala-script Buddha Jayanti edition assigns them proper names. When the titles of the vaggas differ in this way, I have placed the numerical name given in the Burmese-script edition first, followed parenthetically by the descriptive name given in the Sinhala- script edition. The titles of the vaggas are without special significance and do not imply that all the suttas within that vagga are related to the idea expressed by the title. Often these titles are assigned merely on the basis of one sutta within the vagga, often the first, occasionally a longer or weightier sutta coming later. The grouping of suttas into vaggas also appears largely arbitrary, though occasionally several successive suttas deal with a common theme or exemplify an extended pattern.</p><p>In his commentaries to the Pāli Canon, Ācariya Buddhaghosa states that SN contains 7,762 suttas, but the text that has come down to us contains, on the system of reckoning used here, only 2,904 suttas.<sup>3</sup> Due to minor differences in the method of distinguishing suttas, this figure differs slightly from the total of 2,889 counted by Léon Feer on the basis of his roman-script edition.</p><p><span class='quotepno'>24 &amp; 25 </span></p><p>Table 1 A Breakdown of the Saṃyutta Nikāya by Vaggas and Suttas (<em>Feer’s sutta counts in Ee differing from my own are shown to the far right.</em>)</p><p><img src='../_resources/sesame-data/bodhi-nikaya-notes/SN-Images/SN_Table1.webp'></p><p><span class='quotepno'>26</span>Table 1 shows how these figures are arrived at, with the divisions into Vaggas, saṃyuttas, and vaggas; the variant figures counted by Feer are given next to my own. The fact that our totals differ so markedly from that arrived at by Buddhaghosa should not cause alarm bells to ring at the thought that some 63% of the original Saṃyutta has been irretrievably lost since the time of the commentaries. For the <em>Sāratthappakāsinī,</em> the SN commentary, itself provides us with a check on the contents of the collection at our disposal, and from this it is evident that there are no suttas commented on by Buddhaghosa that are missing from the Saṃyutta we currently possess. The difference in totals must certainly stem merely from different ways of expanding the vaggas treated elliptically in the text, especially in Part V. However, even when the formulaic abridgements are expanded to the full, it is difficult to see how the commentator could arrive at so large a figure.</p><p>The five major Vaggas or “books” of the Saṃyutta Nikāya are constructed according to different principles. The first book, the Sagāthāvagga, is unique in being compiled on the basis of literary genre. As the name of the Vagga indicates, the suttas in this collection all contain <em>gāthās</em> or verses, though it is not the case (as Feer had assumed at an early point) that all suttas in SN containing verses are included in this Vagga. In many suttas of Part I, the prose setting is reduced to a mere framework for the verses, and in the first saṃyutta even this disappears so that the sutta becomes simply an exchange of verses, presumably between the Buddha and an interlocutor. The other four Vaggas contain major saṃyuttas concerned with the main doctrinal themes of early Buddhism, accompanied by minor saṃyuttas spanning a wide diversity of topics. Parts II, III, and IV each open with a large chapter devoted to a theme of paramount importance: respectively, the chain of causation (i.e., dependent origination, in SN 12), the five aggregates (22), and the six internal and external sense bases (35). Each of these Vaggas is named after its opening saṃyutta and also includes one other saṃyutta dealing with another important topic secondary to the main one: in Part II, the elements (14); in Part III, philosophical views (24); and in Part IV, feeling (36). The other saṃyuttas in each of these collections are generally smaller and thematically lighter, though within these we can also find texts of great depth and power. <span class='quotepno'>27</span>Part V tackles themes that are all of prime importance, namely, the various groups of training factors which, in the post-canonical period, come to be called the thirty-seven aids to enlightenment (<em>sattatiṃsa bodhipakkhiyā dhammā</em>). The Vagga concludes with a saṃyutta on the original intuition around which the entire Dhamma revolves, the Four Noble Truths. Hence this book is called the Mahāvagga, the Great Book, though at one point it might have also been called the Maggavagga, the Book of the Path (and indeed the Sanskrit version translated into Chinese was so named).</p><p>The organization of SN, from Parts II to V, might be seen as corresponding roughly to the pattern established by the Four Noble Truths. The Nidānavagga, which focuses on dependent origination, lays bare the causal genesis of suffering, and is thus an amplification of the second noble truth. The Khandhavagga and the Saḷāyatanavagga highlight the first noble truth, the truth of suffering; for in the deepest sense this truth encompasses all the elements of existence comprised by the five aggregates and the six internal and external sense bases (see <strong>56:13</strong>, <strong>14</strong>). The Asaṅkhatasaṃyutta (43), coming towards the end of the Saḷāyatanavagga, discusses the unconditioned, a term for the third noble truth, Nibbāna, the cessation of suffering. Finally, the Mahāvagga, dealing with the path of practice, makes known the way to the cessation of suffering, hence the fourth noble truth. If we follow the Chinese translation of the Skt Saṃyuktāgama, the parallelism is still more obvious, for this version places the Khandhavagga first and the Saḷāyatanavagga second, followed by the Nidānavagga, thus paralleling the first and second truths in their proper sequence. But this version assigns the Asaṅkhatasaṃyutta to the end of the Mahāvagga, perhaps to show the realization of the unconditioned as the fruit of fulfilling the practice.</p><p>I said above that what makes the suttas of this collection “connected discourses” are the themes that unite them into fixed saṃyuttas. These, which we might consider the “yokes” or binding principles, constitute the groundplan of the collection, which would preserve its identity even if the saṃyuttas had been differently arranged. There are fifty-six such themes, which I have distinguished into four main categories: doctrinal topics, specific persons, classes of beings, and types of persons. Of the two <span class='quotepno'>28</span>saṃyuttas that do not fall neatly into this typology, the Vanasaṃyutta (9) is constructed according to a fixed scenario, generally a monk being admonished by a woodland deity to strive more strenuously for the goal; the Opammasaṃyutta (20) is characterized by the use of an extended simile to convey its message.</p><p>In Table 2 (A) I show how the different saṃyuttas can be assigned to these categories, giving the total numbers of suttas in each class and the percentage which that class occupies in the whole. The results of this tabulation should be qualified by noting that the figures given are based on a calculation for the whole Saṃyutta Nikāya. But the Sagāthāvagga is so different in character from the other Vaggas that its eleven saṃyuttas skew the final results, and thus to arrive at a more satisfactory picture of the overall nature of the work we might omit this Vagga. In Table 2 (B) I give the results when the Sagāthāvagga is not counted. Even these figures, however, can convey a misleading picture, for the classification is made by way of titles only, and these provide a very inadequate indication of the contents of the actual saṃyutta. The Rāhulasaṃyutta and the Rādhasaṃyutta, for example, are classified under “Specific Person,” but they deal almost exclusively with the three characteristics and the five aggregates, respectively, and give us absolutely no personal information about these individuals; thus their content is properly doctrinal rather than biographical. Moreover, of the eleven chapters named after specific persons, nine are almost entirely doctrinal. Only saṃyuttas 16 and 41, respectively on Mahākassapa and Citta the householder, include material that might be considered of biographical interest. Since the chapters on the main doctrinal topics are invariably much longer than the other chapters, the number of <em>pages</em> dealing with doctrine would be immensely greater than those dealing with other themes.</p>",
    "ZotRef" : "Bodhi 2000a"
}

