[
  {"id":"Analayo 2011a","abstract":"A thorough examination of each discourse in the Majjhima-nikāya in the light of its parallels.\nIn this thousand-page tome, Bhikkhu Analayo goes systematically through the MN, one sutta at a time, and explains how the Pāli text differs (or not) from its parallels preserved in Sanskrit, Chinese and Tibetan. Perhaps surprisingly, they don’t differ all that much, though in some places the differences do shed light on the original teaching and shows what kinds of changes occurred to the texts during the process of transmission.\nThe book begins and ends with Bhikkhu Analayo’s reflections on the EBTs and the process of oral transmission, and while the book could certainly be read cover-to-cover, the primary way to use this book is as a reference work alongside the Majjhima Nikaya.","author":[{"family":"Anālayo","given":"Bhikkhu"}],"citation-key":"Analayo 2011a","file":"Anālayo_2011_A Comparative Study of the Majjhima-nikāya.pdf;Anālayo_2011_A Comparative Study of the Majjhima-nikāya2.pdf","issued":{"date-parts":[["2011"]]},"language":"en","note":"attachment-label:Vol1;Vol2","publisher":"Dharma Drum Publishing Corporation","title":"A Comparative Study of the Majjhima-nikāya","type":"document","URL":"https://www.chancenter.org/chanctr/ddp/ddp.html"},
  {"id":"Bodhi 1995a","abstract":"This book offers a complete translation of the Majjhima Nikāya, or Middle Length Discourses of the Buddha, one of the major collections of texts in the Pali Canon, the authorized scriptures of Theravāda Buddhism. This collection—among the oldest records of the historical Buddha’s original teachings—consists of 152 suttas or discourses of middle length, distinguished as such from the longer and shorter suttas of the other collections. The Majjhima Nikāya might be concisely described as the Buddhist scripture that combines the richest variety of contextual settings with the deepest and most comprehensive assortment of teachings. These teachings, which range from basic ethics to instructions in meditation and liberating insight, unfold in a fascinating procession of scenarios that show the Buddha in living dialogue with people from many different strata of ancient Indian society: with kings and princes, priests and ascetics, simple villagers and erudite philosophers. Replete with drama, reasoned argument, and illuminating parable and simile, these discourses exhibit the Buddha in the full glory of his resplendent wisdom, majestic sublimity, and compassionate humanity.\n\nThe translation is based on an original draft translation left by the English scholar-monk Bhikkhu Ñāṇamoli, which has been edited and revised by the American monk Bhikkhu Bodhi, who provides a long introduction and helpful explanatory notes. Combining lucidity of expression with accuracy, this translation enables the Buddha to speak across twenty-five centuries in language that addresses the most pressing concerns of the contemporary reader seeking clarification of the timeless issues of truth, value, and the proper conduct of life.","accessed":{"date-parts":[["2023",3,15]]},"citation-key":"Bodhi 1995a","collection-title":"Teachings of the Buddha","contributor":[{"family":"Bodhi","given":"Bhikkhu"},{"family":"Ñāṇamoli","given":"Bhikkhu"}],"event-place":"Boston","file":"","ISBN":"978-0-86171-072-0","issued":{"date-parts":[["1995"]]},"language":"en","note":"attachment-label:Contents, Preface, Introduction & Summary of Suttas","number-of-pages":"1424","publisher":"Wisdom Publications","publisher-place":"Boston","title":"The Middle Length Discourses of the Buddha: A Translation of the Majjhima Nikāya","title-short":"The Middle Length Discourses of the Buddha","type":"book","URL":"https://wisdomexperience.org/product/middle-length-discourses-buddha/"},
  {"id":"Bodhi 2000a","citation-key":"Bodhi 2000a","collection-title":"Teachings of the Buddha","contributor":[{"family":"Bodhi","given":"Bhikkhu"}],"event-place":"Boston","file":"","ISBN":"978-0-86171-331-8","issued":{"date-parts":[["2000"]]},"language":"eng","number-of-pages":"2072","publisher":"Wisdom Publications","publisher-place":"Boston","title":"The Connected Discourses of the Buddha: A Translation of the Saṃyutta Nikāya ; translated from the Pāli","title-short":"The Connected Discourses of the Buddha","type":"book","URL":"https://wisdomexperience.org/product/connected-discourses-buddha/"},
  {"id":"Bodhi 2012a","abstract":"The present volume, which continues Wisdom s famous Teachings of the Buddha series, contains a full translation of the Anguttara Nikaya. The Anguttara arranges the Buddha s discourses in accordance with a numerical scheme intended to promote retention and easy comprehension. In an age when writing was still in its infancy, this proved to be the most effective way to ensure that the disciples could grasp and replicate the structure of a teaching. A broad survey of the Anguttara Nikaya shows that its primary focus is on practice, and it treats practice from a wide-angle perspective. The subjects of the discourses range from the basic ethical observances recommended to the busy layperson, through the pillars of mind training, to the highest meditative attainments. The Anguttara is also distinguished among the four Nikayas by its interest in types of persons, which it describes and classifies in detail, often with stunning similes. In such a work, it is fitting that the Buddha appears, not merely as a teacher, but as a real person with his own life story and achievements.","citation-key":"Bodhi 2012a","collection-title":"Teachings of the Buddha","contributor":[{"family":"Bodhi","given":"Bhikkhu"}],"edition":"Annotated edition","event-place":"Boston","file":"","ISBN":"978-1-61429-040-7","issued":{"date-parts":[["2012",11,13]]},"language":"English","number-of-pages":"1936","publisher":"Wisdom Publications,U.S.","publisher-place":"Boston","title":"The Numerical Discourses of the Buddha: A Complete Translation of the Anguttara Nikaya","title-short":"The Numerical Discourses of the Buddha","type":"book","URL":"https://wisdomexperience.org/product/numerical-discourses-buddha/"},
  {"id":"Kopp 1940a","abstract":"Commentary on the Aṅguttara-nikāya by the influential Pāli commentator Buddhaghosa. (5th century C.E.)","accessed":{"date-parts":[["2025",4,6]]},"citation-key":"Kopp 1940a","editor":[{"family":"Kopp","given":"Hermann"}],"file":"Kopp_1940_Manorathapurani Vol.pdf","issued":{"date-parts":[["1940"]]},"language":"pali","note":"IACode: in.ernet.dli.2015.231267","title":"Manorathapurani Vol. IV","type":"book","URL":"https://palitextsociety.org/product/manorathapura%E1%B9%87-vol-iv/"},
  {"id":"Walshe 1995a","abstract":"This book offers a complete translation of the Dīgha Nikāya, the long discourses of the Buddha, one of the major collections of texts in the Pali Canon, the authorized scriptures of Theravada Buddhism. This collection—among the oldest records of the historical Buddha’s original teachings, given in India two and a half thousand years ago—consists of thirty-four longer-length suttas, or discourses, distinguished as such from the middle-length and shorter suttas of the other collections.\n\nThese suttas reveal the gentleness, compassion, power, and penetrating wisdom of the Buddha. Included are teachings on mindfulness (Mahāsatipaṭṭhāna Sutta); on morality, concentration, and wisdom (Subha Sutta); on dependent origination (Mahānidrāna Sutta); on the roots and causes of wrong views (Brahmajāla Sutta); and a long description of the Buddha’s last days and passing away (Mahāparinibbāna Sutta); along with a wealth of practical advice and insight for all those travelling along the spiritual path.\n\nVenerable Sumedho Thera writes in his foreword: “[These suttas] are not meant to be ‘sacred scriptures’ that tell us what to believe. One should read them, listen to them, think about them, contemplate them, and investigate the present reality, the present experience, with them. Then, and only then, can one insightfully know the truth beyond words.”\n\nIntroduced with a vivid account of the Buddha’s life and times and a short survey of his teachings, The Long Discourses of the Buddha brings us closer in every way to the wise and compassionate presence of Gotama Buddha and his path of truth.","accessed":{"date-parts":[["2025",4,6]]},"citation-key":"Walshe 1995a","collection-title":"Teachings of the Buddha","contributor":[{"family":"Walshe","given":"Maurice"}],"file":"","ISBN":"978-0-86171-103-1","language":"en","title":"The Long Discourses of the Buddha: A Translation of the Dīgha Nikāya","title-short":"The Long Discourses of the Buddha","type":"book","URL":"https://wisdomexperience.org/product/long-discourses-buddha/"}
]
