{
	"Authors": "Bhikkhu Brahmāli",
	"BookTitle": "Satipaṭṭhāna and Samādhi",
	"BookSubtitle": "",
	"ShortAbstract": "<p>One of the most common unquestioned assumptions among Buddhist meditators is that <span lang='pi'>satipaṭṭhāna</span> is synonymous with <span lang='pi'>vipassanā</span>. This assumption, it seems, often is a result of reading the Satipaṭṭhāna Suttas in isolation without carefully considering the context in which <span lang='pi'>satipaṭṭhāna</span> is used throughout the suttas. When the broader view of the entire Sutta Piṭaka is taken into account, it becomes clear that such an assumption is, at best, only partially correct. In this short study I will investigate the various contexts in which <span lang='pi'>satipaṭṭhāna</span> appear and in particular consider its relationship with <span lang='pi'>samādhi</span>.</p>",
	"Abstract": "<p>None</p>",
	"ItemType": "document",
	"AddInfo": [],
	"Copyright": [
		"Copyright © Bhikkhu Brahmāli 2004, 2016, 2022",
		"Originally published in 2004.",
		"This edition published in 2022 is based on the 2016 edition with minor reference corrections."
	],
	"CCLicense": "<div class='cclicense'><h3>Attribution-NonCommercial-ShareAlike 4.0 International <span>(CC BY-NC-SA 4.0)</span></h3><div id = 'ccDetail'><p>You are free to:</p><ul><li><strong>Share</strong> — copy and redistribute the material in any medium or format</li><li><strong>Adapt</strong> — remix, transform, and build upon the material</li></ul><p>Under the following terms:</p><ul><li><strong>Attribution</strong> — You must give appropriate credit, provide a link to the license, and indicate if changes were made. You may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.</li><li><strong>NonCommercial</strong> — You may not use the material for commercial purposes.</li><li><strong>ShareAlike</strong> — If you remix, transform, or build upon the material, you must distribute your contributions under the same license as the original.</li><li><strong>No additional restrictions</strong> — You may not apply legal terms or technological measures that legally restrict others from doing anything the license permits.</li></ul><p><strong>Notices:</strong></p><p>You do not have to comply with the license for elements of the material in the public domain or where your use is permitted by an applicable exception or limitation.</p><p>No warranties are given. The license may not give you all of the permissions necessary for your intended use. For example, other rights such as publicity, privacy, or moral rights may limit how you use the material.</p></div></div>",
	"FrontCover": "../_resources/book-data/ssbl/FrontLarge.jpg",
	"BackCover": "",
	"BackMatter": [
		""
	],
	"DownloadsAvailable": "pdf=yes,epub=yes,azw3=yes",
	"DownloadHTML": "",
	"AuthorsData": [
		{
			"ShortName": "Bhikkhu Brahmāli",
			"InfoImage": "../_resources/author-data/brahmali/info.jpg",
			"ShortBio": [
				"Bhikkhu Brahmāli was born in Norway in 1964. ",
				"He began his monastic training as an anagarika in England at Amaravati and Cittaviveka. ",
				"After hearing teachings from Ajahn Brahm in 1994 he decided to travel to Australia to train at Bodhinyana Monastery. ",
				"He was ordained as a Bhikkhu, with Ajahn Brahm as his preceptor, in 1996. ",
				"In 2015 he entered his 20th Rains Retreat as a fully ordained monastic and received the title Maha Thera (Great Elder)."
			]
		}
	]
}