[
  {"id":"DalaiLama 2001a","author":[{"family":"Bstan-ʼdzin-rgya-mtsho","given":"Dalai Lama XIV"},{"family":"Vreeland","given":"Nicholas"}],"citation-key":"DalaiLama 2001a","file":"","ISBN":"978-0-316-98979-4","issued":{"date-parts":[["2001"]]},"language":"eng","note":"IACode: openheartpractic00bsta","number-of-pages":"218","publisher":"Boston : Little, Brown","title":"An Open Heart: Practicing Compassion in Everyday Life","type":"book","URL":"https://www.hodder.co.uk/titles/the-dalai-lama-2/an-open-heart/9780340794319/"},
  {"id":"DalaiLama 2001b","author":[{"family":"Bstan-ʼdzin-rgya-mtsho","given":"Dalai Lama XIV"}],"citation-key":"DalaiLama 2001b","file":"","ISBN":"978-0-86171-301-1 978-0-86171-378-3","issued":{"date-parts":[["2001"]]},"language":"eng","note":"IACode: compassionatelif0000bsta","number-of-pages":"138","publisher":"Boston : Wisdom Publications","source":"Internet Archive","title":"The Compassionate Life","type":"book","URL":"https://wisdomexperience.org/product/compassionate-life/"},
  {"id":"Dayal 1932a","abstract":"The present work consists of seven chapters that deal with the Bodhisattva doctrine as expounded in the principal Buddhist Sanskrit Literature. Chapter 1 describes the nature of the Bodhisattva doctrine with particular stress on the distinct chatacteristics of arhat, Bodhisattva and sravaka. Chapter II recounts the different factors including the influence Persian religio-cult, Greek art and Christian ethics that contributed to the rise and growth of the Boddhisattva doctrine. Chapter III expounds the production of the thought of Enlightenment for the welfare and liberation of all creatures. Chapters IV describes thirty-seven practices and principles conducive to the attainment of Enlightenment. Chapter V expalins the ten perfections that lead to welfare, rebirth, serenity, spiritual cultivation, and supreme knowledge. Chapter VI states different stages of spiritual progress in the aspirant`s long journey to the goal of final emancipation and Chapter VII relates the events of the Gautama Buddha`s past lives as Bodhisattva. The book contains comprehensive notes and references besides a general index appended at the end. It is written in a very lucid style that speaks of the writer`s scholarly acumen and mastry of literary art.","author":[{"family":"Dayal","given":"Har"}],"citation-key":"Dayal 1932a","file":"Dayal-1932-the-bodhisattva-doctrine-in-buddhist-sanskrit-literature.pdf","issued":{"date-parts":[["1932"]]},"language":"en","number-of-pages":"424","title":"The Bodhisattva Doctrine in Buddhist Sanskrit Literature","type":"book"},
  {"id":"DrogeTabor 1992a","abstract":"The right to die with dignity has emerged as a crucial issue in the 1990s. As reports of family- or doctor-assisted suicides increase, the issue of voluntary death is occupying an increasingly prominent place in our national consciousness. From theologians, medical ethicists, and talk-show hosts to people facing the issue in their own lives, all are participants in the debate, each seeking to influence and control the discourse on suicide and euthanasia. Now, this pathbreaking study provides a stunning reappraisal of the early history of this controversial human freedom. A Noble Death challenges the often unquestioning attitudes we have toward suicide and traces the evolution of these attitudes from the time of Socrates to the present day. Droge and Tabor reveal the extraordinary fact that early Christians and Jews did not absolutely condemn suicide, but instead focused on whether or not it was committed for noble reasons. In fascinating detail, the texts and traditions presented here--from Greek and Roman philosophy, to Judaism, Christianity, and the Bible itself--make clear that the decision to take one's life, or allow it to be taken, was not considered a sin but a noble choice, provided there was sufficient justification for the act. \"The Bible nowhere proscribes suicide\", the authors write. \"In fact, there are at least seven individuals in the Bible who take their own lives, and none of them is condemned for the act.... Many (have) a vague notion that the so-called Judeo-Christian tradition speaks decisively against the act of suicide, but just what that objection is, when it developed, and what came before it, are mostly not known\". From Socrates' insistence on the requirement ofa divine sign to Seneca's emphasis on the unqualified freedom of the individual to Augustine's attempt to restrict that freedom, A Noble Death illustrates how strongly we share these early attitudes toward voluntary death. But the very attempt to find a consensus indicates how the decision to die could--and can--be a conscientious one. Intensely relevant to the contemporary debate, A Noble Death takes the reader on a challenging and instructive journey to the surprising origins of Western culture's thoughts on voluntary death.","author":[{"family":"Droge","given":"Arthur J."},{"family":"Tabor","given":"James D."}],"citation-key":"DrogeTabor 1992a","file":"","ISBN":"978-0-06-062095-0","issued":{"date-parts":[["1992"]]},"language":"en","note":"IACode: nobledeathsuicid00drog","number-of-pages":"234","publisher":"HarperSanFrancisco","title":"A Noble Death: Suicide and Martyrdom Among Christians and Jews in Antiquity","type":"book"},
  {"id":"Fromm 1956a","abstract":"Since it was first published \" The Art of Loving\" has become a classic, inspiring thousands of people with its clarity and power. Erich Fromm, the renowned psychoanalyst, sees love as the ultimate need and desire of all human beings. In this book, he discusses every aspect of the subject: romantic love, the love of parents for children, brotherly love, erotic love, self-love and the love of God or the divine. He looks at the theory of love as it appears throughout the cultures of the world and at the practice, how we show or fail to show love to one another. Love is an art, which we need to develop and practice in order to find true commitment. We need to find it, individually and as a society as a whole. Erich Fromm is one of the major figures in the field of psychoanalysis. He devoted himself to consultant psychology and theoretical investigation for many years. He was the author of numerous books, including \" Fear of Freedom\" and \"Psychoanalysis and Zen\", before his death in 1980.","author":[{"family":"Fromm","given":"Erich"}],"citation-key":"Fromm 1956a","event-place":"New York City","file":"Fromm-1956-the-art-of-loving.pdf","issued":{"date-parts":[["1956"]]},"language":"English","number-of-pages":"133","publisher":"Harper & Row","publisher-place":"New York City","title":"The Art of Loving","type":"book"},
  {"id":"Geiger 1912a","author":[{"family":"Mahanama","given":""}],"citation-key":"Geiger 1912a","file":"Mahanama-1912-the-mahāvamsa-or-the-great-chronicle-of-ceylon.pdf","issued":{"date-parts":[["1912"]]},"language":"eng","note":"IACode: in.ernet.dli.2015.188996","title":"The Mahāvamsa or The Great Chronicle of Ceylon","title-short":"The Mahāvamsa","translator":[{"family":"Geiger","given":"Wilhelm"}],"type":"book"},
  {"id":"Germer 2009a","abstract":"“Buck up.” “Stop feeling sorry for yourself.” “Don’t ruin everything.” When you are anxious, sad, angry, or lonely, do you hear this self-critical voice? What would happen if, instead of fighting difficult emotions, we accepted them? Over his decades of experience as a therapist and mindfulness meditation practitioner, Dr. Christopher Germer has learned a paradoxical lesson: We all want to avoid pain, but letting it in--and responding compassionately to our own imperfections, without judgment or self-blame--are essential steps on the path to healing. This wise and eloquent book illuminates the power of self-compassion and offers creative, scientifically grounded strategies for putting it into action. Free audio downloads of the meditation exercises are available at the author's website: www.chrisgermer.com. See also The Mindful Self-Compassion Workbook, by Kristin Neff and Christopher Germer, which provides step-by-step guidance for building mindful self-compassion skills and applying them to specific life challenges, and Teaching the Mindful Self-Compassion Program, by Christopher Germer and Kristin Neff (for professionals). Association for Behavioral and Cognitive Therapies (ABCT) Self-Help Book of Merit","author":[{"family":"Germer","given":"Christopher K."}],"citation-key":"Germer 2009a","edition":"1st edition","event-place":"New York","file":"","ISBN":"978-1-59385-975-6","issued":{"date-parts":[["2009"]]},"language":"English","number-of-pages":"306","publisher":"The Guilford Press","publisher-place":"New York","title":"The Mindful Path to Self-Compassion: Freeing Yourself from Destructive Thoughts and Emotions","type":"book"},
  {"id":"Hanh 1996a","accessed":{"date-parts":[["2024",4,19]]},"author":[{"family":"Hanh","given":"Thich Nhat"}],"citation-key":"Hanh 1996a","file":"","ISBN":"978-0-938077-70-1","issued":{"date-parts":[["1996"]]},"language":"eng","note":"IACode: cultivatingmindo00nhat","number-of-pages":"142","publisher":"Parallax Press","title":"Cultivating the Mind of Love","type":"book"},
  {"id":"Hanh 1998a","abstract":"Weaving together traditional stories, personal experiences, and a deep understanding of the Buddha's way of mindful living, Thich Nhat Hanh provides step-by-step practices that foster understanding and intimacy in any relationship and extend our love even to those that cause us pain. Teachings on Love is a treasure-trove of guidance for couples, co-workers, or friends who wish to nourish the gift and strength of their relationships and deal creatively with their weaknesses and difficulties. We all yearn to experience a love that is deeper and more joyful. Teachings on Love provides a time-tested path that anyone can follow to nurture the deepest love in ourselves and others. With a new introductory chapter by Thich Nhat Hanh","author":[{"family":"Hanh","given":"Thich Nhat"}],"citation-key":"Hanh 1998a","edition":"Revised edition","file":"","ISBN":"978-1-888375-00-8","issued":{"date-parts":[["1998"]]},"language":"English","note":"IACode: teachingsonlove0000nhth","number-of-pages":"195","publisher":"Parallax Press","title":"Teachings on Love","type":"book"},
  {"id":"Harvey 2012a","abstract":"This careful analysis of early Buddhist thought opens out a perspective in which no permanent Self is accepted, but a rich analysis of changing and potent mental processes is developed. Explores issues relating to self-development, moral responsibility and the between-lives period, and more.","accessed":{"date-parts":[["2024",1,9]]},"author":[{"family":"Harvey","given":"Peter"}],"citation-key":"Harvey 2012a","event-place":"Oxon [England]","file":"Harvey-2012-the-selfless-mind.pdf","ISBN":"978-1-315-02633-6","issued":{"date-parts":[["2012"]]},"language":"eng","number-of-pages":"293","publisher":"Routledge","publisher-place":"Oxon [England]","title":"The Selfless Mind: Personality, Consciousness and Nirvāna in Early Buddhism","type":"book","URL":"https://www.taylorfrancis.com/books/e/9781136783296"},
  {"id":"Hazlewood 1988a","author":[{"family":"Hazlewood","given":"Ann Appleby"}],"citation-key":"Hazlewood 1988a","container-title":"The Journal of the Pali Text Society","file":"Hazlewood-1988-saddhammopāyana-gift-offering-of-the-true-dhamma.pdf","issued":{"date-parts":[["1988"]]},"page":"133–159","title":"Saddhammopāyana: Gift-offering of the True Dhamma","type":"article-journal","URL":"https://palitextsociety.org/journals-of-the-pali-text-society-free-downloads/","volume":"12"},
  {"id":"Kornfield 1993a","abstract":"“This important guidebook shows in detail and with great humor and insight the way to practice the Buddha’s universal teachings here in the West. Jack Kornfield is a wonderful storyteller and a great teacher.”—Thich Nhat Hanh\n\n“Jack is helping to pave the path for American Buddhism, bringing essential basics into our crazy modern lives. And the language he uses is as simple and as lovely as our breath.”—Natalie Goldberg\n \nPerhaps the most important book yet written on meditation, the process of inner transformation, and the integration of spiritual practice into our American way of life, A Path with Heart brings alive one by one the challenges of spiritual living in the modern world. Written by a teacher, psychologist, and meditation master of international renown, this warm, inspiring, and expert book touches on a wide range of essential issues including many rarely addressed in spiritual books. From compassion, addiction, and psychological and emotional healing, to dealing with problems involving relationships and sexuality, to the creation of a Zen-like simplicity and balance in all facets of life, it speaks to the concerns of many modern spiritual seekers, both those beginning on the path and those with years of experience.\n \nA Path with Heart is filled with practical techniques, guided meditations, stories, koans, and other gems of wisdom that can help ease your journey through the world. The author’s own profound—and sometimes humorous—experiences and gentle assistance will skillfully guide you through the obstacles and trials of spiritual and contemporary life to bring a clarity of perception and a sense of the sacred into your everyday experience. Reading this book will touch your heart and remind you of the promises inherent in meditation and in a life of the spirit: the blossoming of inner peace, wholeness, and understanding, and the achievement of a happiness that is not dependent on external conditions.\n \nSure to be a classic, A Path with Heart shows us how we can bring our spirituality to flower every day of our lives. It is a wise and gentle guidebook for an odyssey into the soul that enables us to achieve a deeper, more satisfying life in the world.","accessed":{"date-parts":[["2024",6,10]]},"author":[{"family":"Kornfield","given":"Jack"}],"citation-key":"Kornfield 1993a","file":"Kornfield-1993-a-path-with-heart.pdf","issued":{"date-parts":[["1993"]]},"language":"English","license":"http://creativecommons.org/publicdomain/zero/1.0/","note":"IACode: pathwithheartguidethroughtheperilsandpromisesofspirituallifejackkornfield_555_e","source":"Internet Archive","title":"A Path With Heart: A Guide Through The Perils And Promises Of Spiritual Life","type":"book","URL":"http://archive.org/details/pathwithheartguidethroughtheperilsandpromisesofspirituallifejackkornfield_555_e"},
  {"id":"Lecky 1890a","abstract":"As Lecky stated, this work is an attempt to use the historical method to understand the merits of certain theological opinions from the beginning of the Roman Empire to the Middle Ages.","accessed":{"date-parts":[["2024",4,24]]},"author":[{"family":"Lecky","given":"William Edward Hartpole"}],"citation-key":"Lecky 1890a","file":"Lecky-1890-history-of-european-morals-from-augustus-to-charlemagne-i.pdf","issued":{"date-parts":[["1890"]]},"number-of-volumes":"2","publisher":"Longmans, Green, And Co","title":"History of European Morals from Augustus to Charlemagne I","type":"book","volume":"1"},
  {"id":"Lecky 1890b","abstract":"As Lecky stated, this work is an attempt to use the historical method to understand the merits of certain theological opinions from the beginning of the Roman Empire to the Middle Ages.","accessed":{"date-parts":[["2024",4,24]]},"author":[{"family":"Lecky","given":"William Edward Hartpole"}],"citation-key":"Lecky 1890b","file":"Lecky-1890-history-of-european-morals-from-augustus-to-charlemagne-ii.pdf","issued":{"date-parts":[["1890"]]},"number-of-volumes":"2","publisher":"Longmans, Green, And Co","title":"History of European Morals from Augustus to Charlemagne II","type":"book","volume":"2"},
  {"id":"Malalasekera-Jayatilleke 1974a","author":[{"family":"Malalasekera","given":"Gunapala Piyasena"},{"family":"Jayatilleke","given":"Kulatissa Nanda"}],"citation-key":"Malalasekera-Jayatilleke 1974a","collection-number":"200/201","collection-title":"The Wheel","file":"Malalasekera-Jayatilleke-1974-buddhism-and-the-race-question.pdf","issued":{"date-parts":[["1974"]]},"language":"en","number-of-pages":"75","publisher":"Buddhist Publication Society","title":"Buddhism and the Race Question","type":"book","URL":"https://www.bps.lk/library-search-select.php?id=wh200"},
  {"id":"May 2012a","accessed":{"date-parts":[["2024",4,19]]},"author":[{"family":"May","given":"Simon (Simon Philip Walter)"}],"citation-key":"May 2012a","file":"May-2012-love-a-history.pdf","ISBN":"978-0-300-18774-8","issued":{"date-parts":[["2012"]]},"language":"eng","note":"IACode: lovehistory0000mays_q8b3","number-of-pages":"322","publisher":"New Haven, Conn. ; London : Yale University Press","title":"Love : A History","type":"book"},
  {"id":"Mencius 1970a","abstract":"The Mencius, commonly called the Mengzi, is a collection of anecdotes and conversations of the Confucian thinker and philosopher Mencius. The work dates from the second half of the 4th century BC. It was ranked as a Confucian classic and its status was elevated in Song Dynasty. Zhu Xi, the scholar generally credited with the founding of Neo-Confucianism, included the Mengzi as one of the Four Books, and it became one of the canonical texts of Neo-Confucianism.","author":[{"family":"Mencius","given":""}],"citation-key":"Mencius 1970a","file":"","ISBN":"978-0-14-044228-1","issued":{"date-parts":[["1970"]]},"language":"eng","note":"IACode: mencius00menc","number-of-pages":"294","publisher":"London : Penguin Books","title":"Mencius","translator":[{"family":"Lau","given":"D. C. (Dim Cheuk)"}],"type":"book"},
  {"id":"Mozley 1928a","accessed":{"date-parts":[["2024",5,7]]},"author":[{"family":"Statius","given":"Publius Papinius"}],"citation-key":"Mozley 1928a","file":"Statius-1928-statius-ii.pdf","issued":{"date-parts":[["1928"]]},"language":"eng","note":"IACode: statiuswithengli02statuoft","number-of-pages":"626","publisher":"London Heinemann","title":"Statius II: Thebaid V–XII and Achelleid I-II","translator":[{"family":"Mozley","given":"John Henry"}],"type":"book"},
  {"id":"Ñāṇamoli 1956a","abstract":"The Visuddhimagga is the \"great treatise\" of Theravada Buddhism, an encyclopedic manual of doctrine and meditation written in the fifth century by the great Buddhist commentator, Buddhaghosa.The most esteemed commentary in all of Pali literature, The Path of Purification, or Visuddhimagga, is a systematic examination and condensation of Buddhist doctrine and meditation technique. The various teachings of the Buddha, found throughout the Pali Canon, are organized in a clear, comprehensive manner. In the course of his treatise Buddhaghosa gives full and detailed instructions on the forty subjects of meditation aimed at concentration, an elaborate account of the Buddhist Abhidhamma philosophy, and explicit descriptions of the stages of insight culminating in final liberation.The author, Bhadantacaryia Buddhaghosa, composed the Visuddhimagga in the early part of the 5th century A.D. The India-born monk-scholar traveled to Sri Lanka to translate into Pali the extensive Sinhalese commentaries preserved there. His crystallization of the entire Pali Canon reinvigorated Theravada Buddhism in India and Sri Lanka. It still shines as clearly today, in this brilliant 1956 translation by the British-born monk, Bhikkhu Ñāṇamoli, that in itself is considered an outstanding achievement of Pali scholarship of the 20th century.This book is from BPS Pariyatti Editions, which co-publishes classic and contemporary titles from the Buddhist Publication Society of Kandy, Sri Lanka.","citation-key":"Ñāṇamoli 1956a","collection-number":"207H","collection-title":"Book Publications","contributor":[{"family":"Ñāṇamoli","given":"Bhikkhu"}],"file":"Ñanamoli-1956-the-path-of-purification.pdf","issued":{"date-parts":[["1956"]]},"language":"English","publisher":"Buddhist Publication Society","title":"The Path of Purification (Visuddhimagga) by Bhadantācariya Buddhaghosa","type":"book","URL":"https://www.bps.lk/library-search-select.php?id=bp207h"},
  {"id":"Nyanaponika 1958a","author":[{"family":"Nyanaponika","given":"Thera"}],"citation-key":"Nyanaponika 1958a","collection-number":"6","collection-title":"The Wheel","event-place":"Kandy","file":"Nyanaponika-1958-the-four-sublime-states.pdf","issued":{"date-parts":[["1958"]]},"publisher":"The Buddhist Publication Society","publisher-place":"Kandy","title":"The Four Sublime States: Contemplations on Love, Compassion, Sympathetic Joy, and Equanimity","title-short":"The Four Sublime States","type":"book"},
  {"id":"Ohnuma 2008a","abstract":"This is the first comprehensive study of a central narrative theme in premodern South Asian Buddhist literature: the Buddha's bodily self- sacrifice during his previous lives as a bodhisattva. Conducting close readings of stories from Sanskrit, Pali, Chinese, and Tibetan literature written between the third century B.c.e. and the late medieval period, Reiko Ohnuma argues that this theme has had a major impact on the development of Buddhist philosophy and culture. Whether he takes the form of king, prince, ascetic, elephant, hare, serpent, or god, the bodhisattva repeatedly gives his body or parts of his flesh to others. He leaps into fires, drowns himself in the ocean, rips out his tusks, gouges out his eyes, and lets mosquitoes drink from his blood, always out of selflessness and compassion and to achieve this highest state of Buddhahood. Ohnuma places these stories into a discrete subgenre of South Asian Buddhist literature and approaches them like case studies, analyzing their plots, characterizations, and rhetoric. She then relates the theme of the Buddha's bodily self-sacrifice to major conceptual discourses in the history of Buddhism and South Asian religions, such as the categories of the gift, the body (both ordinary and extraordinary) , kingship, sacrifice, ritual offering, and death. The work reveals a very sophisticated and influential perception of the body in South Asian Buddhist literature and highlights the way in which these stories have provided an important cultural resource for Buddhists. Combined with her rich and careful translations of classic texts, Ohnuma introduces a whole new understanding of a vital concept in Buddhists studies.","author":[{"family":"Ohnuma","given":"Reiko"}],"citation-key":"Ohnuma 2008a","event-place":"Delhi","file":"","ISBN":"978-81-208-3360-9","issued":{"date-parts":[["2008"]]},"language":"English","number-of-pages":"372","publisher":"Motilal Banarsidass","publisher-place":"Delhi","title":"Bodily Self Sacrifice in Indian Buddhist Literature","type":"book","URL":"https://www.motilalbanarsidass.com/products/bodily-self-sacrifice-in-indian-buddhist-literature"},
  {"id":"Palden 1997a","abstract":"“With this memoir by a ‘simple monk’ who spent 33 years in prisons and labor camps for resisting the Chinese, a rare Tibetan voice is heard.” —The New York Times Book Review   Palden Gyatso was born in a Tibetan village in 1933 and became an ordained Buddhist monk at eighteen—just as Tibet was in the midst of political upheaval. When Communist China invaded Tibet in 1950, it embarked on a program of “reform” that would eventually affect all of Tibet’s citizens and nearly decimate its ancient culture. In 1967, the Chinese destroyed monasteries across Tibet and forced thousands of monks into labor camps and prisons. Gyatso spent the next twenty-five years of his life enduring interrogation and torture simply for the strength of his beliefs. Palden Gyatso’s story bears witness to the resilience of the human spirit, and to the strength of Tibet’s proud civilization, faced with cultural genocide.   “To readers of this memoir, however untraveled, Tibet will never again seem remote or unfamiliar. . . . Gyatso reminds us that the language of suffering is universal.” —Library Journal   “Has the ring of undeniable truth. . . . Palden Gyatso’s clear-sighted eloquence (in Tsering Shakya’s fluent translation) makes his tale even more engrossing.” —San Francisco Chronicle","author":[{"family":"Gyatso","given":"Palden"}],"citation-key":"Palden 1997a","file":"","ISBN":"978-0-8021-9000-0","issued":{"date-parts":[["1997"]]},"language":"en","note":"IACode: autobiographyoft00pald","number-of-pages":"210","publisher":"Open Road + Grove/Atlantic","title":"The Autobiography of a Tibetan Monk","type":"book"},
  {"id":"Parkes 2009a","abstract":"Loving and grieving are two sides of the same coin: we cannot have one without risking the other. Only by understanding the nature and pattern of loving can we begin to understand the problems of grieving. Conversely, the loss of a loved person can teach us much about the nature of love.\n\nLove and Loss, the result of a lifetime's work, has important implications for the study of attachment and bereavement. In this volume, Colin Murray Parkes reports his innovative research that enables us to bring together knowledge of childhood attachments and problems of bereavement, resulting in a new way of thinking about love, bereavement and other losses. Areas covered include:\n\npatterns of attachment and grief\nloss of a parent, child or spouse in adult life\nsocial isolation and support.\n\nThe book concludes by looking at disorders of attachment and considering bereavement in terms of its implications on love, loss, and change in a wider context.\n\nIlluminating the structure and focus of thinking about love and loss, this book sheds light on a wide range of psychological issues. It will be essential reading for professionals working with bereavement, as well as graduate students of psychology, psychiatry, and sociology.","accessed":{"date-parts":[["2024",5,7]]},"author":[{"family":"Parkes","given":"Colin Murray"}],"citation-key":"Parkes 2009a","file":"","issued":{"date-parts":[["2009"]]},"language":"en","title":"Love and Loss: The Roots of Grief and its Complications","type":"book","URL":"https://www.routledge.com/Love-and-Loss-The-Roots-of-Grief-and-its-Complications/Parkes/p/book/9780415477185"},
  {"id":"Peck 1997a","abstract":"316 pages ; 22 cm","author":[{"family":"Peck","given":"M. Scott (Morgan Scott)"}],"citation-key":"Peck 1997a","file":"","ISBN":"978-0-7126-7150-7 978-0-7126-7076-0","issued":{"date-parts":[["1997"]]},"language":"eng","note":"IACode: roadlesstravelle0000peck_r0b4","number-of-pages":"326","publisher":"London : Rider","title":"The Road Less Travelled and Beyond: Spiritual Growth in an age of anxiety","type":"book"},
  {"id":"PhillipsTaylor 2009a","abstract":"What is kindness? Does it make us happier? And does it have a place in a selfish world? Psychoanalyst Adam Phillips and historian Barbara Taylor present an elegant, thoughtful and concise analysis of kindness in history, in life and in the modern world. Suggesting that acts of kindness occur when we are at our most open and honest, they ask why it is that our faith in kindness has been shaken - and why we are all too ready to believe that antagonism has taken its place.","accessed":{"date-parts":[["2024",4,19]]},"author":[{"family":"Phillips","given":"Adam"},{"family":"Taylor","given":"Barbara"}],"citation-key":"PhillipsTaylor 2009a","file":"","issued":{"date-parts":[["2009"]]},"language":"en","note":"IACode: onkindness00phil","title":"On Kindness","type":"book","URL":"https://www.penguin.co.uk/books/56739/on-kindness-by-adam-phillips-barbara-taylor/9780141039336"},
  {"id":"Pink 1968a","accessed":{"date-parts":[["2024",4,27]]},"author":[{"family":"Pink","given":"Arthur Walkington"}],"citation-key":"Pink 1968a","file":"Pink-1983-the-attributes-of-god.pdf","ISBN":"978-0-8010-6989-5","issued":{"date-parts":[["1983"]]},"language":"eng","note":"IACode: attributesofgod00pink","number-of-pages":"102","publisher":"Grand Rapids, Mich. : Baker Book House","title":"The Attributes of God","type":"book"},
  {"id":"Salzberg 1995a","accessed":{"date-parts":[["2024",4,19]]},"author":[{"family":"Salzberg","given":"Sharon"}],"citation-key":"Salzberg 1995a","file":"","ISBN":"978-1-57062-037-9","issued":{"date-parts":[["1995"]]},"language":"eng","note":"IACode: lovingkindnessre0000salz","number-of-pages":"218","publisher":"Boston : Shambhala","title":"Loving-Kindness : The Revolutionary Art of Happiness","type":"book"},
  {"id":"Samararatne 2007a","abstract":"Therefore it is very important to learn to shape the mind, and when you learn to shape the mind then you can achieve a mind that is free. So the importance of meditation is learning to achieve a mind that is free, a mind that is happy, a mind that is peaceful, a mind that has loving-kindness.","accessed":{"date-parts":[["2024",4,19]]},"author":[{"family":"Samararatne","given":"Godwin"}],"citation-key":"Samararatne 2007a","editor":[{"family":"Mynett","given":"Jeanne"}],"file":"Samararatne-2007-the-gentle-way-of-buddhist-meditation.pdf","issued":{"date-parts":[["2007"]]},"language":"en","number-of-pages":"124","publisher":"Inward Path Publisher","title":"The Gentle Way of Buddhist Meditation: A Representation of Godwin's Retreat Talks in Hong Kong, 1997","title-short":"The Gentle Way of Buddhist Meditation","type":"book"},
  {"id":"Singer 2009a","abstract":"In the first volume, Singer begins by studying love as appraisal and bestowal as well as imagination and idealization. He then examines the contrasting views of Plato, Aristotle, Plotinus, Ovid, Lucretius, Saint Augustine, Saint Thomas Aquinas, and Martin Luther. After having described the nature of erotic idealization, Singer analyzes the religious idealization in Judeo-Christian concepts of eros, philia, nomos, and agape. Medieval Catholicism sought to combine these four ideas of love in the “caritas synthesis.” Luther repudiated that attempt on the grounds that love exists only in God’s agapastic bestowal of unlimited goodness upon humanity and all of nature. In relation to the different modes of theorizing, Singer explores the humanistic implications of each.","author":[{"family":"Singer","given":"Irving"}],"citation-key":"Singer 2009a","collection-title":"The Nature of Love","event-place":"Cambridge, Mass","file":"","ISBN":"978-0-262-51272-5 978-0-262-51273-2 978-0-262-51274-9","issued":{"date-parts":[["2009"]]},"number-of-pages":"3","number-of-volumes":"3","publisher":"MIT Press","publisher-place":"Cambridge, Mass","title":"The Nature of Love, I: Plato to Luther","title-short":"The Nature of Love, Volume 1","type":"book","URL":"https://www.penguinrandomhouse.com/books/654586/the-nature-of-love-volume-1-by-irving-singer/","volume":"1"},
  {"id":"Singer 2009b","abstract":"In the second volume, Singer studies the ideas and ideals of medieval courtly love and nineteenth-century Romantic love, as well as the transition between these two perspectives. According to the traditions of courtly love in the twelfth century and thereafter, not only God but also human beings in themselves are capable of authentic love. The pursuit of love between man and woman was seen as a splendid ideal that ennobles both the lover and the beloved. It was something more than libidinal sexuality and involved sophisticated and highly refined courtliness that emulated religious love in its ability to create a holy union between the participants. Adherents to Romantic love in later centuries, affirmed the capacity of love to effect a merging between two people who thus became one. Singer analyzes the transition from courtly to Romantic by reference to the writings of many artists beginning with Dante and ending with Richard Wagner, as well as Neoplatonist philosophers of the Italian Renaissance, Descartes, Spinoza, Rousseau, Hume, Kant, Hegel, and Schopenhauer. In relation to romanticism itself, he distinguishes between two aspects—”benign romanticism” and “Romantic pessimism”—that took on renewed importance in the twentieth century.","author":[{"family":"Singer","given":"Irving"}],"citation-key":"Singer 2009b","collection-title":"The Nature of Love","event-place":"Cambridge, Mass","file":"","ISBN":"978-0-262-51273-2","issued":{"date-parts":[["2009"]]},"note":"IACode: natureoflove0002sing_d9a0","number-of-pages":"513","number-of-volumes":"3","publisher":"MIT Press","publisher-place":"Cambridge, Mass","title":"The Nature of Love, II: Courtly and Romantic","title-short":"The Nature of Love, Volume 2","type":"book","URL":"https://www.penguinrandomhouse.com/books/655008/the-nature-of-love-volume-2-by-irving-singer/","volume":"2"},
  {"id":"Singer 2009c","abstract":"In the third volume, Singer examines the pervasive dialectic between optimistic idealism and pessimistic realism in modern thinking about the nature of love. He begins by discussing “anti-Romantic Romantics” (focusing on Kierkegaard, Nietzsche, and Tolstoy), influential nineteenth-century thinkers whose views illustrate much of the ambiguity and self-contradiction that permeate thinking about love in the last hundred years. He offers detailed studies of Freud, Proust, Shaw, D. H. Lawrence, and Santayana, and he maps the ideas about love in Continental existentialism, particularly those of Sartre and de Beauvoir. Singer finally envisages a future of cooperation between pluralistic humanists and empirical scientists. This last volume of Singer’s trilogy does not pretend to offer the final word on the subject, any more than do most of the philosophers he discusses, but his masterful work can take its place beside their earlier investigations into these vast and complex questions.","author":[{"family":"Singer","given":"Irving"}],"citation-key":"Singer 2009c","collection-title":"The Nature of Love","event-place":"Cambridge, Mass","file":"","ISBN":"978-0-262-51274-9","issued":{"date-parts":[["2009"]]},"note":"IACode: natureoflove0003sing_u7c1","number-of-pages":"473","number-of-volumes":"3","publisher":"MIT Press","publisher-place":"Cambridge, Mass","title":"The Nature of Love, III: The Modern World","title-short":"The Nature of Love, Volume 3","type":"book","URL":"https://www.penguinrandomhouse.com/books/655010/the-nature-of-love-volume-3-by-irving-singer/","volume":"3"},
  {"id":"Singer 2009d","abstract":"In 1984 philosopher Irving Singer published the first volume of what would become a classic and much-acclaimed trilogy, The Nature of Love. In this new book, he maps the trajectory of his thinking on love.\" \"It is a \"partial\" summing-up of a lifework: partial because it expresses the author's still unfolding views, and because love - like any subject of that magnitude - resists a neatly comprehensive, all-inclusive formulation. Adopting an informal, even conversational, tone, Singer discusses, among other topics, the history of romantic love; the Platonic ideal; courtly and nineteenth-century Romantic love; the nature of passion; the concept of merging (and his critique of it); ideas about love in Freud, Schopenhauer, Nietzsche, Dewey, Santayana, Sartre, and other writers; and love in relation to democracy, existentialism, creativity, and the possible future of scientific investigation. --From publisher description","author":[{"family":"Singer","given":"Irving"}],"citation-key":"Singer 2009d","edition":"First MIT Press paperback edition","event-place":"Cambridge, Massachusetts.","file":"","ISBN":"978-0-262-51617-4","issued":{"date-parts":[["2009"]]},"language":"eng","note":"IACode: philosophyoflove0000sing","publisher":"MIT Press","publisher-place":"Cambridge, Massachusetts.","title":"Philosophy of Love: A Partial Summing-up","type":"book","URL":"https://www.penguinrandomhouse.com/books/654473/philosophy-of-love-by-irving-singer-foreword-by-alan-soble/9780262516174/"},
  {"id":"Singer 2009e","abstract":"An acclaimed philosopher views the search for meaning in life as the search for a mode of creativity that will make our lives meaningful.What is meaning in","accessed":{"date-parts":[["2024",4,26]]},"author":[{"family":"Singer","given":"Irving"}],"citation-key":"Singer 2009e","file":"","ISBN":"978-0-262-25918-7","issued":{"date-parts":[["2009"]]},"language":"en","note":"IACode: meaninginlifecre0000sing","publisher":"The MIT Press","title":"Meaning in Life: The Creation of Value","type":"book"},
  {"id":"Sorokin 1954a","author":[{"family":"Sorokin","given":"Pitirim A."}],"citation-key":"Sorokin 1954a","event-place":"Boston","file":"","ISBN":"978-1-59947-502-8","issued":{"date-parts":[["1954"]]},"language":"eng","publisher":"Beacon Press","publisher-place":"Boston","title":"The Ways & Power Of Love: Types, Factors, and Techniques Of Moral Transformation","type":"book"},
  {"id":"Speyer 1895a","abstract":"An English translation of this famous collection of  Jātaka stories, including one not found in the Pāli collection (with an embedded reading of the text).","accessed":{"date-parts":[["2024",4,24]]},"author":[{"family":"Āryaśūra","given":""}],"citation-key":"Speyer 1895a","file":"Āryaśūra-1895-jatakamala-or-garland-of-birth-stories.pdf","issued":{"date-parts":[["1895"]]},"language":"en","title":"Jatakamala or Garland of Birth Stories","translator":[{"family":"Speyer","given":"J. S."}],"type":"book","URL":"https://ancient-buddhist-texts.net/English-Texts/Garland-of-Birth-Stories/"},
  {"id":"SternbergBarnes 1988a","author":[{"family":"Sternberg","given":"Robert J."},{"family":"Barnes","given":"Michael L."}],"citation-key":"SternbergBarnes 1988a","event-place":"New Haven","file":"","ISBN":"978-0-300-03950-4","issued":{"date-parts":[["1988"]]},"language":"eng","note":"IACode: psychologyoflove00sterrich","number-of-pages":"412","publisher":"Yale University Press","publisher-place":"New Haven","title":"The Psychology of Love","type":"book"},
  {"id":"Titmuss 1970a","abstract":"This book's author was a pioneer in the field of social administration (now social policy). In this reissued classic, listed by the New York Times as one of the 10 most important books of the year when it was first published in 1970, the author compares blood donation in the US and UK, contrasting the British system of reliance on voluntary donors to the American one in which the blood supply is in the hands of for-profit enterprises, concluding that a system based on altruism is both safer and more economically efficient. The argument about how altruism binds societies together has proved a powerful tool in the analysis of welfare provision. This analysis is even more topical now in an age of ever-changing health care policy and at a time when health and welfare systems are under sustained attack from many quarters.","accessed":{"date-parts":[["2024",4,24]]},"author":[{"family":"Titmuss","given":"Richard"}],"citation-key":"Titmuss 1970a","file":"","ISBN":"978-1-4473-4958-7","issued":{"date-parts":[["1970"]]},"language":"en","note":"IACode: giftrelationship00titm","publisher":"Policy Press","source":"academic.oup.com","title":"The Gift Relationship: From Human Blood to Social Policy","type":"book","URL":"https://academic.oup.com/policy-press-scholarship-online/book/22093"},
  {"id":"Toland 1977a","author":[{"family":"Toland","given":"John"}],"citation-key":"Toland 1977a","file":"","issued":{"date-parts":[["1977",1,1]]},"language":"eng","note":"IACode: adolfhitlerbyjoh0000john","number-of-pages":"1130","publisher":"London: Book Club Associates","title":"Adolf Hitler","type":"book"}
]
