{
    "Page" : "Atharvaveda",
    "Title" : "Introduction",
    "Text": "<p>The <strong>Atharvaveda</strong> or <strong>Atharva Veda</strong> (Sanskrit: अथर्ववेद, IAST: <em>Atharvaveda</em>, from <em>अथर्वन्</em>, “priest” and <em>वेद</em>, “knowledge”) or is the “knowledge storehouse of <em>atharvans</em>, the procedures for everyday life”. The text is the fourth Veda, and is a late addition to the Vedic scriptures of Hinduism.</p><p>The language of the Atharvaveda is different from Rigvedic Sanskrit, preserving pre-Vedic Indo-European archaisms. It is a collection of 730 hymns with about 6,000 mantras, divided into 20 books. About a sixth of the Atharvaveda texts adapt verses from the Rigveda, and except for Books 15 and 16, the text is mainly in verse deploying a diversity of Vedic meters. Two different recensions of the text – the <em>Paippalāda</em> and the <em>Śaunakīya</em> – have survived into modern times. Reliable manuscripts of the Paippalada edition were believed to have been lost, but a well-preserved version was discovered among a collection of palm leaf manuscripts in Odisha in 1957.</p><p>The Atharvaveda is sometimes called the “Veda of magical formulas”, a description considered incorrect by other scholars. In contrast to the 'hieratic religion' of the other three Vedas, the Atharvaveda is said to represent a ‘popular religion’, incorporating not only formulas for magic, but also the daily rituals for initiation into learning (<em>upanayana</em>), marriage and funerals. Royal rituals and the duties of the court priests are also included in the Atharvaveda.</p><p>The Atharvaveda was likely compiled as a Veda contemporaneously with Samaveda and Yajurveda, or about 1200 BCE – 1000 BCE. Along with the Samhita layer of text, the Atharvaveda includes a Brahmana text, and a final layer of the text that covers philosophical speculations. The latter layer of Atharvaveda text includes three primary Upanishads, influential to various schools of Hindu philosophy. These include the Mundaka Upanishad, the Mandukya Upanishad and the Prashna Upanishad.</p>"
}