{
    "Page" : "Katha Upanishad",
    "Title" : "Introduction",
    "Text": "<p>The <em><strong>Katha Upanishad</strong></em> (Sanskrit: कठोपनिषद्, IAST: <em lang='sa-Latn'>Kaṭhopaniṣad</em>), is an ancient Hindu text and one of the <em>mukhya</em> (primary) Upanishads, embedded in the last eight short sections of the <em><em lang='sa-Latn'>Kaṭha</em></em> school of the Krishna Yajurveda. It is also known as <em><em lang='sa-Latn'>Kāṭhaka</em></em> Upanishad, and is listed as number 3 in the Muktika canon of 108 Upanishads.</p><p>The Katha Upanishad consists of two chapters (<em>Adhyāyas</em>), each divided into three sections (<em>Vallis</em>). The first <em>Adhyaya</em> is considered to be of older origin than the second. The Upanishad has the legendary story of a little boy, Nachiketa – the son of Sage Vajasravasa, who meets Yama (the king of the dead). Their conversation evolves to a discussion of the nature of man, knowledge, Atman (Self) and moksha (liberation).</p><p>The chronology of Katha Upanishad is unclear and contested, but it is generally considered to belong to the later Upanishads, dated to the 5th to first centuries BCE.</p><p>The Kathaka Upanishad is an important ancient Sanskrit corpus of the Vedanta sub-schools, and an influential Śruti to the diverse schools of Hinduism. It asserts that “Atman (Self) exists”, teaches the precept “seek Self-knowledge, which is Highest Bliss”, and expounds on this premise like the other primary Upanishads of Hinduism. The detailed teachings of Katha Upanishad have been variously interpreted, as Dvaita (dualistic) and as Advaita (non-dualistic).</p><p>It is among the most widely studied Upanishads. Katha Upanishad was translated into Persian in the 17th century, copies of which were then translated into Latin and distributed in Europe. Other philosophers such as Arthur Schopenhauer praised it, Edwin Arnold rendered it in verse as “The Secret of Death”, and Ralph Waldo Emerson credited Katha Upanishad for the central story at the end of his essay <em>Immortality</em>, as well as his poem “<em>Brahma</em>”.</p>"
}