{
    "Page" : "Mahabharata",
    "Title" : "Introduction",
    "Text": "<p>The <em><strong>Mahābhārata</strong></em>; (Sanskrit: महाभारतम्, IAST: <em>Mahābhāratam</em>) is one of the two major Smriti texts and Sanskrit epics of ancient India revered in Hinduism, the other being the <em>Rāmāyaṇa</em>. It narrates the events and aftermath of the Kurukshetra War, a war of succession between two groups of princely cousins, the Kauravas and the Pāṇḍavas.</p><p>It also contains philosophical and devotional material, such as a discussion of the four “goals of life” or <em>puruṣārtha</em>. Among the principal works and stories in the <em>Mahābhārata</em> are the <em>Bhagavad Gita</em>, the story of Damayanti, the story of Shakuntala, the story of Pururava and Urvashi, the story of Savitri and Satyavan, the story of Kacha and Devayani, the story of Rishyasringa and an abbreviated version of the <em>Rāmāyaṇa</em>, often considered as works in their own right.</p><p>Traditionally, the authorship of the <em>Mahābhārata</em> is attributed to Vyāsa. There have been many attempts to unravel its historical growth and compositional layers. The bulk of the <em>Mahābhārata</em> was probably compiled between the 3rd century BCE and the 3rd century CE, with the oldest preserved parts not much older than around 400 BCE. The text probably reached its final form by the early Gupta period (<abbr>c.</abbr>&thinsp;4th century CE).</p><p>The <em>Mahābhārata</em> is the longest epic poem known and has been described as “the longest poem ever written”. Its longest version consists of over 100,000 <em>śloka</em> or over 200,000 individual verse lines (each shloka is a couplet), and long prose passages. At about 1.8 million words in total, the <em>Mahābhārata</em> is roughly ten times the length of the <em>Iliad</em> and the <em>Odyssey</em> combined, or about four times the length of the <em>Rāmāyaṇa</em>. Within the Indian tradition it is sometimes called the fifth Veda.</p><p>The title is translated as “Great Bharat (India)”, or “the story of the great descendents of Bharata”.</p>"
}