{
    "Page" : "Sarvastivada",
    "Title" : "Introduction",
    "Text": "<p>The <em><strong>SarvÄstivÄda</strong></em> (Sanskrit: ğ‘€²ğ‘€­ğ‘†ğ‘€¯ğ‘€¸ğ‘€²ğ‘†ğ‘€¢ğ‘€ºğ‘€¯ğ‘€¸ğ‘€¤; Pali: ğ‘€²ğ‘€©ğ‘†ğ‘€©ğ‘€¢ğ‘†ğ‘€£ğ‘€ºğ‘€¯ğ‘€¸ğ‘€¤, <small>romanized: </small><em lang='pi-Latn'>SabbatthivÄda</em> Chinese: èªªä¸€åˆ‡æœ‰éƒ¨; pinyin: <em lang='zh-Latn'>ShuÅyÄ«qi&egrave;yÇ’u B&ugrave;</em>; Japanese: ã›ã¤ã„ã£ã•ã„ã†ã¶; Korean: ì„¤ì¼ì²´ìœ ë¶€; Vietnamese: <em lang='vi'>Nháº¥t thiáº¿t há»¯u bá»™</em>; Thai: à¸ªà¸£à¸§à¸²à¸ªà¸•à¸´à¸§à¸²à¸—; Sinhala: à·ƒà¶»à·Šà·€à·à·ƒà·Šà¶­à·’à·€à·à¶¯) was one of the early Buddhist schools established around the reign of Ashoka (third century BCE). It was particularly known as an Abhidharma tradition, with a unique set of seven canonical Abhidharma texts.</p><p>The SarvÄstivÄdins were one of the most influential Buddhist monastic groups, flourishing throughout North India, especially Kashmir and Central Asia, until the 7th century CE. The orthodox Kashmiri branch of the school composed the large and encyclopedic <em>Abhidharma MahÄvibhÄá¹£a ÅšÄstra</em> around the time of the reign of Kanishka (c. 127&ndash;150 CE). Because of this, orthodox SarvÄstivÄdins who upheld the doctrines in the <em>MahÄvibhÄá¹£a</em> were called <em>VaibhÄá¹£ikas.</em></p><p>There have been debates about the exact chronology of the SarvastivÄdin emergence from the Sthavira NikÄya. According to the TheravÄdin <em>DÄ«pavaá¹ƒsa</em>, the SarvÄstivÄdins coalesced out of the older MahÄ«Å›Äsaka school, but the <em lang='sa-Latn'>ÅšÄriputraparipá¹›cchÄ</em> and the <em lang='sa-Latn'>SamayabhedoparacanaÄ‡akra</em> state the opposite (i.e., that the MahÄ«Å›Äsaka emerged from the SarvÄstivÄda, rather). The SarvÄstivÄdins are believed to have given rise to the MÅ«lasarvÄstivÄda and SautrÄntika schools, although the relationship between these groups has not yet been fully determined. It has been suggested that some yogic SarvÄstivÄdins, under early MahÄyÄna influence, gave rise to YogÄcÄra, one of the most important and influential traditions of MahÄyÄna Buddhism.</p><p>TheravÄda Buddhists have, at times, tendered accusations that the SarvÄstivÄdins were heavily influenced by the non-Buddhist SÄá¹…khya school of philosophy.Nevertheless, the important Buddhist philosopher AÅ›vaghoá¹£a, who may have been associated with SarvÄstivÄda, states&mdash;in his influential <em lang='sa-Latn'>Buddhacaritam</em>&mdash;that Ä€á¸·Ära KÄlÄma, the first of the young Buddha's teachers, followed an archaic form of SÄá¹…khya.</p>"
}