{
    "Page" : "Shvetashvatara Upanishad",
    "Title" : "Introduction",
    "Text": "<p>The <em><strong>Shvetashvatara Upanishad</strong></em> (Sanskrit: श्वेताश्वतरोपनिषद्, IAST: <em lang='sa-Latn'>Śvetāśvataropaniṣad</em>) is an ancient Sanskrit text embedded in the Yajurveda. It is listed as number 14 in the Muktika canon of 108 Upanishads. The Upanishad contains 113 mantras or verses in six chapters.</p><p>The Upanishad is one of the 33 Upanishads from Taittiriyas, and associated with the <em>Shvetashvatara</em> tradition within <em>Karakas sakha</em> of the Yajurveda. It is a part of the “black” “krishna” Yajurveda, with the term “black” implying “the un-arranged, motley collection” of content in Yajurveda, in contrast to the “white” (well arranged) Yajurveda where Brihadaranyaka Upanishad and Isha Upanishad are embedded.</p><p>The chronology of Shvetashvatara Upanishad is contested, but it is generally accepted to be a late-period Upanishadic composition. The text includes a closing credit to sage <em>Shvetashvatara</em>, who is considered the author of the Upanishad. However, scholars believe that while sections of the text shows an individual stamp by its style, verses and other sections were interpolated and expanded over time; the Upanishad as it exists now is the work of more than one author.</p><p>The Shvetashvatara Upanishad opens with metaphysical questions about the primal cause of all existence, its origin, its end, and what role, if any, time, nature, necessity, chance, and the spirit had as the primal cause. It then develops its answer, concluding that “the Universal Selfs exists in every individual, it expresses itself in every creature, everything in the world is a projection of it, and that there is Oneness, a unity of Selfs in one and only Self”. The text is notable for its discussion of the concept of personal god – Ishvara, and suggesting it to be a path to one's own Highest Self. The text is also notable for its multiple mentions of both Rudra and Shiva, along with other Vedic deities, and of crystallization of Shiva as a central theme.</p><p>The Shvetashvatara Upanishad is commented by many of its ancient and medieval scholars. It is a foundational text of the philosophy of Shaivism, as well as the Yoga and Vedanta schools of Hinduism. Some 19th century scholars initially suggested that Shvetashvatara Upanishad is sectarian or possibly influenced by Christianity, hypotheses that were disputed, later discarded by scholars.</p>"
}