{
    "Page" : "Theravada",
    "Title" : "Introduction",
    "Text": "<p><em><strong>Theravāda</strong></em> (/ˌtɛrəˈvɑːdə/; lit. 'School of the Elders'; Chinese: 上座部佛教; Vietnamese: <em lang='vi'>Thượng tọa bộ</em>) is Buddhism's oldest existing school. The school's adherents, termed <em><strong>Theravādins</strong></em> (anglicized from Pali <em>theravādī</em>), have preserved their version of the Buddha's teaching or <em>Dhamma</em> in the Pāli Canon for over two millennia.</p><p>The Pāli Canon is the most complete Buddhist canon surviving in a classical Indian language, Pāli, which serves as the school's sacred language and <em>lingua franca</em>. In contrast to Mahāyāna and Vajrayāna, Theravāda tends to be conservative in matters of doctrine (<em>pariyatti</em>) and monastic discipline (<em>vinaya</em>). One element of this conservatism is the fact that Theravāda rejects the authenticity of the Mahayana sutras (which appeared c. 1st century BCE onwards). Consequently, Theravāda generally does not recognize the existence of many Buddhas and bodhisattvas believed by the Mahāyāna school, such as Amitābha and Vairocana, because they are not found in their scriptures.</p><p>Theravāda derives from Indian Sthavira nikāya (an early Buddhist school). This tradition developed significantly in India and Sri Lanka from the 3rd century BCE onward, particularly with the writing down of the Pāli Canon and the growth of its commentarial literature.From both India, as its historical origin, and Sri Lanka, as its principal center of development, the Theravāda tradition subsequently spread to Southeast Asia, where it became the dominant form of Buddhism. Theravāda is the official religion of Sri Lanka, Myanmar, and Cambodia, and the main dominant Buddhist variant found in Laos and Thailand. It is practiced by minorities in India, Bangladesh, China, Nepal, North Korea, Vietnam, the Philippines, Indonesia, Malaysia, and Taiwan. The diaspora of all of these groups, as well as converts around the world, also embrace and practice Theravāda Buddhism.</p><p>During the modern era, new developments have included Buddhist modernism, the Vipassana movement which reinvigorated Theravāda meditation practice, the growth of the Thai Forest Tradition which reemphasized forest monasticism and the spread of Theravāda westward to places such as India and Nepal, along with Buddhist immigrants and converts in the European Union and in the United States.</p>"
}